{
  "redirectURI": "Redirect URI som skal brukes når du konfigurerer identitetsleverandøren.",
  "alias": "Aliaset identifiserer en identitetsleverandør og kan brukes for å bygge en redirect uri.",
  "clientId": "Identifikator for klient registrert hos identitetsleverandør.",
  "clientSecret": "Klient secret registrert hos identitetsleverandør.",
  "discoveryEndpoint": "Importer metadata fra et eksternt IDP discovery descriptor.",
  "importConfig": "Importer metadata fra en nedlastet IDP discovery descriptor.",
  "logoutUrl": "Endepunkt for avsluttende sesjon som brukes for å logge ut bruker fra ekstern IDP.",
  "backchannelLogout": "Støtter ekstern IDP backchannel utlogging?",
  "userInfoUrl": "Brukerinfo URLen. Denne er valgfri.",
  "issuer": "Identifikator for utgiver av forespørselen. Hvis dette ikke er oppgitt vil ingen validering utføres.",
  "scopes": "Scopes som sendes når du ber om autorisasjon. Dette kan være en liste med scopes separert med mellomrom. Standard er satt til 'openid'.",
  "validateSignature": "Aktiver/deaktiver signaturvalidering av eksterne IDP signaturer.",
  "storeTokens": "Aktiver/deaktiver hvis tokens må bli lagret etter at brukere har blitt autentisert.",
  "storedTokensReadable": "Aktiver/deaktiver hvis nye brukere kan lese lagrede tokens. Dette tildeles broker.read-token rollen.",
  "trustEmail": "Hvis aktivert vil ikke e-post levert av denne leverandøren bli verifisert selv om verifisering er aktivert for sikkerhetsdomenet.",
  "firstBrokerLoginFlowAlias": "Alias for autentiseringsflyt, som trigges etter første innlogging med denne identitetsleverandøren. Begrepet 'Første innlogging' betyr at det ennå ikke eksisterer en Keycloak-konto koblet til den autentiserte kontoen til identitetsleverandøren.",
  "useEntityDescriptor": "Importer metadata fra et eksternt IDP SAML entity descriptor.",
  "samlEntityDescriptor": "Lar deg laste inn ekstern IDP metadata fra en konfigurasjonsfil eller ved å laste det ned fra en URL.",
  "ssoServiceUrl": "URL som må brukes for å sende autentiseringsforespørsler (SAML AuthnRequest).",
  "singleLogoutServiceUrl": "URL som må brukes for å sende utloggingsforespørsler.",
  "httpPostBindingAuthnRequest": "Indikerer om AuthnRequests må bli sendt ved å bruke en HTTP-POST binding. Hvis satt til false, vil HTTP-REDIRECT binding bli brukt.",
  "wantAuthnRequestsSigned": "Indikerer om identitetsleverandør forventer en signert AuthnRequest.",
  "signatureAlgorithm": "Signaturalgoritmen som brukes for å signere et dokument.",
  "forceAuthentication": "Indikerer om identitetsleverandør må autentisere presentatøren direkte i stedet for å stole på en tidligere sikkerhetskontekst.",
  "validateSignatures": "Aktiver/deaktiver signaturvalidering av SAML svar.",
  "validatingX509Certs": "Sertifikatet i PEM format som må brukes for å se etter signaturer.",
  "addIdpMapperName": "Navn på mapper."
}