{
  "requireSsl": "Требуется ли HTTPS? 'нет' означает, что HTTPS не требуется для клиентов с любым IP адресом. 'Внешние запросы' означает, что localhost и внутренние IP адреса могут получить доступ без HTTPS. 'Все запросы' означает, что HTTPS требуется вне зависимости от IP адреса.",
  "accountTheme": "Выберите тему для управления учетной записью пользователя.",
  "adminUITheme": "Выберите тему для консоли администратора.",
  "emailTheme": "Выберите тему для E-mail, которые будут отсылаться с сервера.",
  "save-user-events": "Если включено, то события будут сохранены в базу данных, что сделает их доступными администратору и консоли управления учетной записью.",
  "save-admin-events": "Если включено, то события администратора будет сохранены в базу данных, что сделает их доступными через консоль администратора.",
  "expiration": "Установить срок истечения для событий. Истекшие события периодически удаляются из базы данных.",
  "admin-clearEvents": "Удалить все события администратора из базы данных.",
  "includeRepresentation": "Включить JSON представление для запросов на создание и обновление.",
  "failureFactor": "Количество неудачных попыток входа до блокировки пользователя.",
  "waitIncrementSeconds": "Если порог ошибок превышен, сколько времени пользователь будет заблокирован?",
  "maxFailureWaitSeconds": "Максимальное время, на которое пользователь будет заблокирован.",
  "maxDeltaTimeSeconds": "Через какое время счетчик неудачных попыток будет сброшен?",
  "quickLoginCheckMilliSeconds": "Если попытки аутентификации происходят слишком часто, то пользователя необходимо заблокировать.",
  "minimumQuickLoginWaitSeconds": "Как долго ждать после неудачной попытки быстрого входа.",
  "ssoSessionIdle": "Допустимое время бездействия сессии. По истечении этого времени токены и браузерные сессии становятся невалидными.",
  "ssoSessionMax": "Максимальное время до того, как истечет сессия. По истечении этого времени токены и браузерные сессии становятся невалидными.",
  "offlineSessionIdle": "Допустимое время бездействия оффлайн сессии. Вам необходимо использовать оффлайн токен для обновления хотя бы раз за этот период, иначе сессия истечет.",
  "revokeRefreshToken": "Если включено, то токены обновления могут быть использованы один раз. Иначе токен отзываться не будет и может использоваться многократно.",
  "clientLoginTimeout": "Максимальное время клиента для завершения протокола access token. Обычно устанавливается равным 1-ой минуте.",
  "editUsername": "Если включено,то имя пользователя можно будет отредактировать, иначе оно будет доступным только для чтения."
}