#converted from translation.json
#Thu Oct 26 10:20:40 CEST 2023
anyResource=\u4EFB\u610F\u306E\u30EA\u30BD\u30FC\u30B9
themes=\u30C6\u30FC\u30DE
addClientScope=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u8FFD\u52A0
clientType=\u300COpenID Connect\u300D\u306B\u3088\u308A\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u8A8D\u53EF\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u308B\u8A8D\u8A3C\u306B\u57FA\u3065\u3044\u3066\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u691C\u8A3C\u3067\u304D\u307E\u3059\u3002\u300CSAML\u300D\u306F\u3001\u30AF\u30ED\u30B9\u30C9\u30E1\u30A4\u30F3\u306E\u30B7\u30F3\u30B0\u30EB\u30FB\u30B5\u30A4\u30F3\u30AA\u30F3\uFF08SSO\uFF09\u3092\u542B\u3080Web\u30D9\u30FC\u30B9\u306E\u8A8D\u8A3C\u304A\u3088\u3073\u8A8D\u53EF\u306E\u30B7\u30CA\u30EA\u30AA\u3092\u53EF\u80FD\u306B\u3057\u3001\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u542B\u3080\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30FB\u30C8\u30FC\u30AF\u30F3\u3092\u4F7F\u7528\u3057\u3066\u60C5\u5831\u3092\u6E21\u3057\u307E\u3059\u3002
clientSignature=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u7F72\u540D\u304C\u5FC5\u9808
unanimous=Unanimous
policy-name=\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u306E\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
clientHelp=\u8A8D\u53EF\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u4F5C\u6210\u3059\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u63D0\u4F9B\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\u8A8D\u53EF\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u4ECA\u3044\u308B\u30DA\u30FC\u30B8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3067\u884C\u308F\u308C\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002
disabledFeatures=\u4F7F\u7528\u3067\u304D\u306A\u3044\u6A5F\u80FD
wantAssertionsSignedHelp=\u3053\u306E\u30B5\u30FC\u30D3\u30B9\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u7F72\u540D\u4ED8\u304D\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u8981\u6C42\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
signOut=\u30B5\u30A4\u30F3\u30A2\u30A6\u30C8
validatorDialogColNames.colName=\u30ED\u30FC\u30EB\u540D
certificateHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3067\u767A\u884C\u3055\u308C\u3001\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u79D8\u5BC6\u9375\u3067\u7F72\u540D\u3055\u308C\u305FJWT\u3092\u691C\u8A3C\u3059\u308B\u305F\u3081\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u3067\u3059\u3002
credentialType=\u30BF\u30A4\u30D7
passLoginHint=login_hint\u3092\u6E21\u3059
operationType=\u64CD\u4F5C\u30BF\u30A4\u30D7
httpPostBindingAuthnRequestHelp=HTTP-POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u7528\u3057\u3066AuthnRequest\u3092\u9001\u4FE1\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30AA\u30D5\u306E\u5834\u5408\u306F\u3001HTTP-REDIRECT\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
userInitiatedActionLifespan=\u30E6\u30FC\u30B6\u30FC\u8D77\u52D5\u30A2\u30AF\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9593
decisionStrategy=\u6C7A\u5B9A\u6226\u7565
policyEnforcementMode=\u30DD\u30EA\u30B7\u30FC\u65BD\u884C\u30E2\u30FC\u30C9
securityDefences=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u9632\u5FA1
realmSettings=\u30EC\u30EB\u30E0\u306E\u8A2D\u5B9A
partialExport=\u90E8\u5206\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8
displayName=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u5206\u304B\u308A\u3084\u3059\u3044\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
applyToResourceTypeHelp=\u3053\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u3001\u7279\u5B9A\u30BF\u30A4\u30D7\u306E\u5168\u30EA\u30BD\u30FC\u30B9\u306B\u9069\u7528\u3055\u308C\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306F\u7279\u5B9A\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7\u306E\u5168\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u5BFE\u3057\u3066\u8A55\u4FA1\u3055\u308C\u307E\u3059\u3002
envelopeFrom=Envelope From
clientDescriptionHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8AAC\u660E\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u4F8B\u3048\u3070\u300C\u30BF\u30A4\u30E0\u30B7\u30FC\u30C8\u7528\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u300D\u3067\u3059\u3002\u30ED\u30FC\u30AB\u30E9\u30A4\u30BA\u7528\u306E\u30AD\u30FC\u3082\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u3059\u3002\u4F8B\: ${my_client_description}
effectiveRoleScopeMappings=\u6709\u52B9\u306A\u30ED\u30FC\u30EB\u30B9\u30B3\u30FC\u30D7\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0
clientAuthenticator=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C
updateFirstLoginHelp=\u521D\u56DE\u30ED\u30B0\u30A4\u30F3\u6642\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u66F4\u65B0\u306E\u6709\u52B9/\u7121\u52B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
clientSessionMax=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u6700\u5927
usermodel.clientRoleMapping.clientId.label=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID
clientId=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID
contextualAttributesHelp=\u5B9F\u884C\u74B0\u5883\u3084\u5B9F\u884C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B\u4EFB\u610F\u306E\u5C5E\u6027\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
clientLoginTimeoutHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u30FB\u30D7\u30ED\u30C8\u30B3\u30EB\u3092\u7D42\u4E86\u3059\u308B\u307E\u3067\u306E\u6700\u5927\u6642\u9593\u3002\u3053\u308C\u306F\u901A\u5E381\u5206\u3067\u3059\u3002
lastAccess=\u6700\u7D42\u30A2\u30AF\u30BB\u30B9
clientAuthentications.private_key_jwt=\u79D8\u5BC6\u9375\u3067\u7F72\u540D\u3055\u308C\u305FJWT
uiDisplayName=\u30B3\u30F3\u30BD\u30FC\u30EB\u8868\u793A\u540D
adminEventsSettings=\u7BA1\u7406\u30A4\u30D9\u30F3\u30C8\u306E\u8A2D\u5B9A
times.minutes=\u5206
disableUserInfo=UserInfo\u306E\u7121\u52B9
addressClaim.postal_code.label=\u90F5\u4FBF\u756A\u53F7\u306E\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D
forcePostBinding=POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u5F37\u5236
defaultRoles=\u30C7\u30D5\u30A9\u30EB\u30C8\u30ED\u30FC\u30EB
clientScopeTypes.default=DEFAULT
addressClaim.country.tooltip=\u300Caddress\u300D\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u5185\u306E\u300Ccountry\u300D\u30B5\u30D6\u30AF\u30EC\u30FC\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Ccountry\u300D\u3067\u3059\u3002
uuidLdapAttribute=UUID LDAP\u5C5E\u6027
topLevelFlowType=\u3069\u306E\u7A2E\u985E\u306E\u30C8\u30C3\u30D7\u30EC\u30D9\u30EB\u30FB\u30D5\u30ED\u30FC\u3092\u4F5C\u6210\u3059\u308B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u300Cclient\u300D\u30BF\u30A4\u30D7\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\uFF08\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\uFF09\u306E\u8A8D\u8A3C\u3067\u4F7F\u7528\u3057\u307E\u3059\u3002\u300Cgeneric\u300D\u306F\u30E6\u30FC\u30B6\u30FC\u3068\u4ED6\u306E\u3059\u3079\u3066\u3067\u4F7F\u7528\u3057\u307E\u3059\u3002
scopeNameHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u540D\u524D\u3002\u30EC\u30EB\u30E0\u5185\u3067\u30E6\u30CB\u30FC\u30AF\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u30B9\u30B3\u30FC\u30D7\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u5024\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u308B\u305F\u3081\u3001\u540D\u524D\u306B\u306F\u7A7A\u767D\u6587\u5B57\u3092\u542B\u3081\u306A\u3044\u3067\u304F\u3060\u3055\u3044
requiredUserActions=\u5FC5\u8981\u306A\u30E6\u30FC\u30B6\u30FC\u30FB\u30A2\u30AF\u30B7\u30E7\u30F3
flowTypeHelp=\u3069\u306E\u7A2E\u985E\u306E\u30D5\u30A9\u30FC\u30E0\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
allowRemoteResourceManagement=\u30EA\u30E2\u30FC\u30C8\u30EA\u30BD\u30FC\u30B9\u7BA1\u7406
identityProvider=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
identityProviderLinks=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30EA\u30F3\u30AF
leave=\u5916\u3059
eventTypes.IMPERSONATE.name=\u4EE3\u7406\u30ED\u30B0\u30A4\u30F3
export=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8
assertionLifespan=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650
addressClaim.formatted.label=\u6574\u5F62\u3055\u308C\u305F\u4F4F\u6240\u306E\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D
add=\u8FFD\u52A0
passwordPolicy=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30DD\u30EA\u30B7\u30FC
openIDEndpointConfiguration=OpenID\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A2D\u5B9A
backchannelLogout=\u30D0\u30C3\u30AF\u30C1\u30E3\u30F3\u30CD\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8
addressClaim.street.label=\u305D\u306E\u4ED6\u4F4F\u6240\u306E\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D
prompts.login=login
users=\u30E6\u30FC\u30B6\u30FC
offlineSessionIdleHelp=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u307E\u3067\u306E\u30AA\u30D5\u30E9\u30A4\u30F3\u6642\u9593\u3067\u3059\u3002\u3053\u306E\u671F\u9650\u5185\u306B\u5C11\u306A\u304F\u3068\u30821\u56DE\u306F\u30AA\u30D5\u30E9\u30A4\u30F3\u30FB\u30C8\u30FC\u30AF\u30F3\u3092\u4F7F\u7528\u3057\u3066\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u3057\u306A\u3044\u3068\u3001\u30AA\u30D5\u30E9\u30A4\u30F3\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u306F\u6709\u52B9\u671F\u9650\u5207\u308C\u3068\u306A\u308A\u307E\u3059\u3002
wantAssertionsEncrypted=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u306E\u6697\u53F7\u5316\u304C\u5FC5\u8981
forceNameIdFormatHelp=\u8981\u6C42\u3055\u308C\u305FNameID\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3092\u7121\u8996\u3057\u3001\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3067\u8A2D\u5B9A\u3055\u308C\u305F\u7269\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
uris=URI
port=\u30DD\u30FC\u30C8
realmRolePrefix=\u30EC\u30EB\u30E0\u30ED\u30FC\u30EB\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9
jwksUrlHelp=JWK\u5F62\u5F0F\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u9375\u304C\u683C\u7D0D\u3055\u308C\u3066\u3044\u308BURL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u8A73\u7D30\u306FJWK\u306E\u4ED5\u69D8\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u300Cjwt\u300D\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u6301\u3064Keycloak\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u300C/k_jwks\u300D\u3068\u3044\u3046\u63A5\u5C3E\u8F9E\u3092\u4ED8\u3051\u305FURL\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u4F8B\u3048\u3070\u3001\u300Chttp\://www.myhost.com/myapp/k_jwks\u300D\u3067\u3059\u3002
includeRepresentation=Representation\u3092\u542B\u3081\u308B
singleLogoutServiceUrl=\u30B7\u30F3\u30B0\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306EURL
roles=\u30ED\u30FC\u30EB
policyCode=\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u306B\u5BFE\u3059\u308B\u6761\u4EF6\u3092\u63D0\u4F9B\u3059\u308BJavaScript\u30B3\u30FC\u30C9\u3002
representation=Representation
remove=\u524A\u9664
scopePermissions.users.manage-group-membership-description=\u7BA1\u7406\u8005\u304C\u30EC\u30EB\u30E0\u5185\u306E\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u306E\u30B0\u30EB\u30FC\u30D7\u30FB\u30E1\u30F3\u30D0\u30FC\u30B7\u30C3\u30D7\u3092\u7BA1\u7406\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u3002\u3053\u308C\u306F\u3001\u7279\u5B9A\u306E\u30B0\u30EB\u30FC\u30D7\u30DD\u30EA\u30B7\u30FC\u3068\u7D44\u307F\u5408\u308F\u305B\u3066\u4F7F\u7528??\u3055\u308C\u307E\u3059
loginTheme=\u30ED\u30B0\u30A4\u30F3\u30C6\u30FC\u30DE
provider=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
flows=\u30D5\u30ED\u30FC
scope=\u30B9\u30B3\u30FC\u30D7
includeRepresentationHelp=\u4F5C\u6210\u307E\u305F\u306F\u66F4\u65B0\u30EA\u30AF\u30A8\u30B9\u30C8\u306EJSON Representation\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
signAssertionsHelp=SAML\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5185\u306E\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u7F72\u540D\u3059\u3079\u304D\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3082\u3057\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u304C\u65E2\u306B\u7F72\u540D\u6E08\u307F\u306E\u5834\u5408\u306F\u3001\u3053\u306E\u8A2D\u5B9A\u306F\u4E0D\u8981\u3067\u3059\u3002
validateSignature=\u7F72\u540D\u691C\u8A3C
headers=\u30D8\u30C3\u30C0\u30FC
effectiveProtocolMappersHelp=\u3059\u3079\u3066\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u3068\u9078\u629E\u3055\u308C\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30B9\u30B3\u30FC\u30D7\u304C\u542B\u307E\u308C\u307E\u3059\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u767A\u884C\u3055\u308C\u305F\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u3092\u751F\u6210\u3059\u308B\u3068\u304D\u306B\u3001\u3059\u3079\u3066\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u3059\u3079\u3066\u306E\u30D7\u30ED\u30C8\u30B3\u30EB\u30FB\u30DE\u30C3\u30D1\u30FC\u3068\u30ED\u30FC\u30EB\u30B9\u30B3\u30FC\u30D7\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059
fromDisplayNameHelp=\u5DEE\u51FA\u4EBA\u306E\u30A2\u30C9\u30EC\u30B9\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30D5\u30EC\u30F3\u30C9\u30EA\u30FC\u306A\u540D\u524D\u3067\u3059\uFF08\u30AA\u30D7\u30B7\u30E7\u30F3\uFF09\u3002
userObjectClasses=\u30E6\u30FC\u30B6\u30FC\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30AF\u30E9\u30B9
policyRoles=\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u3067\u8A31\u53EF\u3055\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30ED\u30FC\u30EB\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
accountLinkingOnlyHelp=\u30AA\u30F3\u306E\u5834\u5408\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u30EA\u30F3\u30AF\u3059\u308B\u3053\u3068\u306E\u307F\u3067\u304D\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u306E\u30ED\u30B0\u30A4\u30F3\u3092\u8A31\u53EF\u3057\u305F\u304F\u306A\u3044\u304C\u3001\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3068\u7D71\u5408\u3057\u305F\u3044\u5834\u5408\u306B\u4FBF\u5229\u3067\u3059
refreshTokenMaxReuseHelp=\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u3092\u518D\u5229\u7528\u3067\u304D\u308B\u6700\u5927\u56DE\u6570\u3002\u5225\u306E\u30C8\u30FC\u30AF\u30F3\u304C\u4F7F\u7528\u3055\u308C\u305F\u5834\u5408\u3001\u5373\u6642\u306B\u7121\u52B9\u5316\u3055\u308C\u307E\u3059\u3002
times.hours=\u6642
webOrigins=Web\u30AA\u30EA\u30B8\u30F3
webAuthnPolicyAuthenticatorAttachmentHelp=\u53D7\u3051\u5165\u308C\u53EF\u80FD\u306A\u30A2\u30BF\u30C3\u30C1\u30E1\u30F3\u30C8\u30FB\u30D1\u30BF\u30FC\u30F3\u3067\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u3068\u901A\u4FE1\u3057\u307E\u3059\u3002
username=\u30E6\u30FC\u30B6\u30FC\u540D
importConfig=\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3057\u305FIDP\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u30FC\u3088\u308A\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
replyToDisplayNameHelp=\u8FD4\u4FE1\u5148\u306E\u30A2\u30C9\u30EC\u30B9\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30D5\u30EC\u30F3\u30C9\u30EA\u30FC\u306A\u540D\u524D\u3067\u3059\uFF08\u30AA\u30D7\u30B7\u30E7\u30F3\uFF09\u3002
lifespan=\u6709\u52B9\u671F\u9650
storedTokensReadableHelp=\u65B0\u3057\u3044\u30E6\u30FC\u30B6\u30FC\u304C\u683C\u7D0D\u3055\u308C\u305F\u30C8\u30FC\u30AF\u30F3\u3092\u8AAD\u307F\u53D6\u308A\u53EF\u80FD\u304B\u3069\u3046\u304B\u306E\u6709\u52B9/\u7121\u52B9\u8A2D\u5B9A\u3067\u3059\u3002broker.read-token\u30ED\u30FC\u30EB\u3092\u30A2\u30B5\u30A4\u30F3\u3057\u307E\u3059\u3002
webAuthnPolicyRpIdHelp=\u3053\u308C\u306F\u3001WebAuthn\u30EA\u30E9\u30A4\u30F3\u30B0\u30FB\u30D1\u30FC\u30C6\u30A3\u30FC\u3068\u3057\u3066\u306EID\u3067\u3059\u3002\u30AA\u30EA\u30B8\u30F3\u306E\u6709\u52B9\u306A\u30C9\u30E1\u30A4\u30F3\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
authenticationFlowTypeHelp=\u3069\u306E\u7A2E\u985E\u306E\u30D5\u30A9\u30FC\u30E0\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
editUsernameHelp=\u6709\u52B9\u306E\u5834\u5408\u306F\u30E6\u30FC\u30B6\u30FC\u540D\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u7DE8\u96C6\u53EF\u80FD\u306B\u306A\u308A\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u306B\u306A\u308A\u307E\u3059\u3002
consoleDisplayConnectionUrlHelp=LDAP\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9AURL
clientAssertionSigningAlg=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
fullScopeAllowedHelp=\u5168\u3066\u306E\u5236\u9650\u306E\u7121\u52B9\u3092\u8A31\u53EF\u3057\u307E\u3059\u3002
applyPolicy=\u30DD\u30EA\u30B7\u30FC\u306E\u9069\u7528
otpType=OTP\u30BF\u30A4\u30D7
directGrantHelp=\u30C0\u30A4\u30EC\u30AF\u30C8\u30FB\u30B0\u30E9\u30F3\u30C8\u8A8D\u8A3C\u3067\u4F7F\u7528\u3057\u305F\u3044\u30D5\u30ED\u30FC\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
algorithm=\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
jsonType.tooltip=\u30C8\u30FC\u30AF\u30F3\u3078\u306EJSON\u30AF\u30EC\u30FC\u30E0\u306E\u8FFD\u52A0\u3067\u4F7F\u7528\u3055\u308C\u308BJSON\u30BF\u30A4\u30D7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002long\u3001int\u3001boolean\u3001String\u3001JSON\u304C\u6709\u52B9\u306A\u5024\u3067\u3059\u3002
enableStartTLS=StartTLS\u306E\u6709\u52B9
syncModeOverride=\u540C\u671F\u30E2\u30FC\u30C9\u306E\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9
includeInTokenScope=\u30C8\u30FC\u30AF\u30F3\u30B9\u30B3\u30FC\u30D7\u306B\u542B\u3081\u308B
eventType=\u30A4\u30D9\u30F3\u30C8\u30BF\u30A4\u30D7
accountLinkingOnly=\u30A2\u30AB\u30A6\u30F3\u30C8\u306E\u30EA\u30F3\u30AF\u306E\u307F
sectorIdentifierUri.label=\u30BB\u30AF\u30BF\u30FC\u8B58\u5225\u5B50URI
usermodel.attr.label=\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027
eventTypes.REGISTER.name=\u767B\u9332
rememberMeHelpText=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u307E\u3067\u306F\u30D6\u30E9\u30A6\u30B6\u30FC\u306E\u518D\u8D77\u52D5\u3067\u3082\u30ED\u30B0\u30A4\u30F3\u72B6\u614B\u3092\u4FDD\u5B58\u3059\u308B\u30C1\u30A7\u30C3\u30AF\u30DC\u30C3\u30AF\u30B9\u3092\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u306B\u8868\u793A\u3057\u307E\u3059\u3002
webAuthnPolicyUserVerificationRequirementHelp=\u30E6\u30FC\u30B6\u30FC\u3092\u5B9F\u969B\u306B\u691C\u8A3C\u3059\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306B\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u3068\u901A\u4FE1\u3057\u307E\u3059\u3002
idTokenSignatureAlgorithm=ID\u30C8\u30FC\u30AF\u30F3\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
syncModes.import=\u30A4\u30F3\u30DD\u30FC\u30C8
ssoServiceUrl=\u30B7\u30F3\u30B0\u30EB\u30FB\u30B5\u30A4\u30F3\u30AA\u30F3\u30FB\u30B5\u30FC\u30D3\u30B9\u306EURL
allowRemoteResourceManagementHelp=\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u308A\u30EA\u30E2\u30FC\u30C8\u3067\u7BA1\u7406\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30AA\u30D5\u306E\u5834\u5408\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u306F\u3053\u306E\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3060\u3051\u3067\u7BA1\u7406\u3055\u308C\u307E\u3059\u3002
changedUsersSyncPeriod=\u5909\u66F4\u30E6\u30FC\u30B6\u30FC\u306E\u540C\u671F\u5468\u671F
webAuthnPolicyAuthenticatorAttachment=\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u30FB\u30A2\u30BF\u30C3\u30C1\u30E1\u30F3\u30C8
userRegistration=\u30E6\u30FC\u30B6\u30FC\u767B\u9332
save=\u4FDD\u5B58
login=login
changedUsersSyncHelp=\u5909\u66F4\u307E\u305F\u306F\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305FLDAP\u30E6\u30FC\u30B6\u30FC\u306E\u540C\u671F\u5468\u671F\u3092\u79D2\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002
trustEmailHelp=\u6709\u52B9\u3068\u3057\u305F\u5834\u5408\u306F\u3001\u3053\u306E\u30EC\u30EB\u30E0\u3067E\u30E1\u30FC\u30EB\u306E\u78BA\u8A8D\u304C\u6709\u52B9\u3068\u306A\u3063\u3066\u3044\u308B\u5834\u5408\u3067\u3082\u3001\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u63D0\u4F9B\u3059\u308BE\u30E1\u30FC\u30EB\u306F\u78BA\u8A8D\u3055\u308C\u306A\u304F\u306A\u308A\u307E\u3059\u3002
credentialUserLabel=\u30E6\u30FC\u30B6\u30FC\u30E9\u30D9\u30EB
adminURLHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30A4\u30B9\u306EURL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30A2\u30C0\u30D7\u30BF\u30FC\u306EREST API\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u308B\u5834\u5408\u306B\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u306EREST API\u306B\u3088\u308A\u3001\u8A8D\u8A3C\u30B5\u30FC\u30D0\u30FC\u306F\u7121\u52B9\u5316\u30DD\u30EA\u30B7\u30FC\u3084\u4ED6\u306E\u7BA1\u7406\u30BF\u30B9\u30AF\u3092\u30D7\u30C3\u30B7\u30E5\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u901A\u5E38\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30D9\u30FC\u30B9URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
otpPolicyPeriodHelp=OTP\u30C8\u30FC\u30AF\u30F3\u304C\u6709\u52B9\u306A\u79D2\u6570\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F30\u79D2\u3067\u3059\u3002
storePasswordHelp=\u30A2\u30FC\u30AB\u30A4\u30D6\u81EA\u8EAB\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u305F\u3081\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
userFederation=\u30E6\u30FC\u30B6\u30FC\u30FB\u30D5\u30A7\u30C7\u30EC\u30FC\u30B7\u30E7\u30F3
directAccess=\u30C0\u30A4\u30EC\u30AF\u30C8\u30FB\u30A2\u30AF\u30BB\u30B9\u30FB\u30B0\u30E9\u30F3\u30C8\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306E\u53D6\u5F97\u306E\u305F\u3081\u306BKeycloak\u30B5\u30FC\u30D0\u30FC\u3068\u30E6\u30FC\u30B6\u30FC\u306E\u30E6\u30FC\u30B6\u30FC\u540D/\u30D1\u30B9\u30EF\u30FC\u30C9\u3067\u76F4\u63A5\u30A2\u30AF\u30BB\u30B9\u3092\u884C\u3044\u307E\u3059\u3002OAuth2\u306E\u4ED5\u69D8\u306B\u304A\u3051\u308B\u300C\u30EA\u30BD\u30FC\u30B9\u30FB\u30AA\u30FC\u30CA\u30FC\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30FB\u30B0\u30E9\u30F3\u30C8\u300D\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
disable=\u7121\u52B9
attributes=\u5C5E\u6027
logic=\u30ED\u30B8\u30C3\u30AF
resourceType=\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7
minuteHelp=\u30DD\u30EA\u30B7\u30FC\u304C\u8A31\u53EF\u3055\u308C\u308B\u5206\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u30022\u756A\u76EE\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u5024\u3092\u5165\u529B\u3057\u3066\u7BC4\u56F2\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u73FE\u5728\u306E\u5206\u304C\u6307\u5B9A\u3057\u305F2\u3064\u306E\u5024\u306E\u9593\u306B\u3042\u308B\u304B\u3001\u7B49\u3057\u3044\u5834\u5408\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
scopeName=\u3053\u306E\u30B9\u30B3\u30FC\u30D7\u306E\u30E6\u30CB\u30FC\u30AF\u306A\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u540D\u524D\u306F\u30B9\u30B3\u30FC\u30D7\u306E\u4E00\u610F\u306A\u8B58\u5225\u306B\u4F7F\u7528\u3055\u308C\u3001\u7279\u5B9A\u306E\u30B9\u30B3\u30FC\u30D7\u3092\u7167\u4F1A\u3059\u308B\u969B\u306B\u4F7F\u7528\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
userInfoUrlHelp=UserInfo\u306EURL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u3059\u3002
kc.realm.name=\u30EC\u30EB\u30E0
impersonate=\u4EE3\u7406\u30ED\u30B0\u30A4\u30F3
members=\u30E1\u30F3\u30D0\u30FC
scopePermissions.clients.token-exchange-description=\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u5BFE\u8C61\u3068\u3059\u308B\u30C8\u30FC\u30AF\u30F3\u306E\u30C8\u30FC\u30AF\u30F3\u4EA4\u63DB\u3092\u8A31\u53EF\u3059\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u3002
registration-access-token=\u767B\u9332\u7528\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306B\u3088\u308A\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u767B\u9332\u30B5\u30FC\u30D3\u30B9\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u3059\u3002
adminURL=\u7BA1\u7406URL
settings=\u8A2D\u5B9A
webAuthnPolicyUserVerificationRequirement=\u30E6\u30FC\u30B6\u30FC\u691C\u8A3C\u8981\u4EF6
failureFactorHelp=\u691C\u51FA\u3059\u308B\u307E\u3067\u306E\u5931\u6557\u56DE\u6570\u3067\u3059\u3002
webAuthnPolicyCreateTimeout=\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
storeTokensHelp=\u30E6\u30FC\u30B6\u30FC\u8A8D\u8A3C\u5F8C\u306E\u30C8\u30FC\u30AF\u30F3\u683C\u7D0D\u306E\u6709\u52B9/\u7121\u52B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
singleLogoutServiceUrlHelp=\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u9001\u4FE1\u306B\u4F7F\u7528\u3059\u308BURL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
useTruststoreSpi=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2SPI\u3092\u4F7F\u7528
usermodel.clientRoleMapping.rolePrefix.tooltip=\u5404\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30ED\u30FC\u30EB\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\uFF08\u30AA\u30D7\u30B7\u30E7\u30F3\uFF09\u3002
storeTokens=\u30C8\u30FC\u30AF\u30F3\u306E\u683C\u7D0D
userHelp=\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u3001\u30B5\u30F3\u30D7\u30EB\u306E\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u3092\u751F\u6210\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u3092\u9078\u629E\u3057\u307E\u3059\u3002\u30E6\u30FC\u30B6\u30FC\u3092\u9078\u629E\u3057\u306A\u3044\u3068\u3001\u8A55\u4FA1\u4E2D\u306B\u30B5\u30F3\u30D7\u30EB\u306E\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306F\u751F\u6210\u3055\u308C\u307E\u305B\u3093
Sunday=\u65E5
emailVerifiedHelp=\u30E6\u30FC\u30B6\u30FC\u306EE\u30E1\u30FC\u30EB\u304C\u78BA\u8A8D\u6E08\u307F\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
addExecution=\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0
editMode=\u7DE8\u96C6\u30E2\u30FC\u30C9
passwordHelp=SMTP\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u3053\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3001\u30DC\u30FC\u30EB\u30C8\u304B\u3089\u5024\u3092\u53D6\u5F97\u3067\u304D\u307E\u3059\u3002${vault.ID}\u5F62\u5F0F\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
groupMembership=\u30B0\u30EB\u30FC\u30D7\u30FB\u30E1\u30F3\u30D0\u30FC\u30B7\u30C3\u30D7
fullSyncPeriod=\u30D5\u30EB\u540C\u671F\u306E\u5468\u671F
addNode=\u30CE\u30FC\u30C9\u3092\u8FFD\u52A0
jwksUrl=JWKS URL
policy-description=\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u306E\u8AAC\u660E\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
policies=\u30DD\u30EA\u30B7\u30FC
parentClientScope=\u89AA\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7
importClient=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30A4\u30F3\u30DD\u30FC\u30C8
allTypes=\u3059\u3079\u3066\u306E\u30BF\u30A4\u30D7
ldapFilter=LDAP\u30D5\u30A3\u30EB\u30BF\u30FC
webAuthnPolicyRpEntityNameHelp=WebAuthn\u30EA\u30E9\u30A4\u30F3\u30B0\u30FB\u30D1\u30FC\u30C6\u30A3\u30FC\u3068\u3057\u3066\u306E\u4EBA\u9593\u304C\u8AAD\u307F\u53D6\u308C\u308B\u30B5\u30FC\u30D0\u30FC\u540D
postBrokerLoginFlowAlias=\u30ED\u30B0\u30A4\u30F3\u5F8C\u306E\u30D5\u30ED\u30FC
tokens=\u30C8\u30FC\u30AF\u30F3
refreshTokenMaxReuse=\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u306E\u6700\u5927\u518D\u5229\u7528\u56DE\u6570
encryptAssertionsHelp=SAML\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u516C\u958B\u9375\u3067AES\u3092\u4F7F\u3044\u6697\u53F7\u5316\u3059\u3079\u304D\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
clientScopes=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7
httpPostBindingLogout=HTTP-POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8
requirement=\u5FC5\u8981\u6761\u4EF6
permissionDescription=\u3053\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u8AAC\u660E\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
multivalued.label=\u30DE\u30EB\u30C1\u30D0\u30EA\u30E5\u30FC
minute=\u5206
useJwksUrl=JWKS URL\u306E\u4F7F\u7528
wantAssertionsSigned=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u306E\u7F72\u540D\u304C\u5FC5\u8981
algorithmNotSpecified=\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306E\u6307\u5B9A\u306A\u3057
scopeParameter=\u30B9\u30B3\u30FC\u30D7\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
rememberMe=\u30ED\u30B0\u30A4\u30F3\u72B6\u614B\u306E\u4FDD\u5B58
flow.registration=\u767B\u9332\u30D5\u30ED\u30FC
webAuthnPolicyAcceptableAaguids=\u8A31\u5BB9\u53EF\u80FD\u306AAAGUID
registeredClusterNodes=\u767B\u9332\u6E08\u307F\u30AF\u30E9\u30B9\u30BF\u30FC\u30CE\u30FC\u30C9
storePassword=\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
logoutServiceRedirectBindingURLHelp=\u30B7\u30F3\u30B0\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306ESAMLRedirect\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u7570\u306A\u308BBinding\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u7A7A\u3067\u3088\u3044\u3067\u3059\u3002
defaultGroups=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30B0\u30EB\u30FC\u30D7
flow.browser=\u30D6\u30E9\u30A6\u30B6\u30FC\u30D5\u30ED\u30FC
scopePermissions.clients.map-roles-client-scope-description=\u7BA1\u7406\u8005\u304C\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u305F\u30ED\u30FC\u30EB\u3092\u5225\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306B\u9069\u7528\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
addressClaim.street.tooltip=\u300Caddress\u300D\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u5185\u306E\u300Cstreet_address\u300D\u30B5\u30D6\u30AF\u30EC\u30FC\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Cstreet\u300D\u3067\u3059\u3002
includeInIdToken.tooltip=\u30AF\u30EC\u30FC\u30E0\u3092ID\u30C8\u30FC\u30AF\u30F3\u306B\u8FFD\u52A0\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
password=\u30D1\u30B9\u30EF\u30FC\u30C9
httpPostBindingResponseHelp=HTTP-POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u7528\u3057\u3066\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5FDC\u7B54\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30AA\u30D5\u306E\u5834\u5408\u306F\u3001HTTP-REDIRECT\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
allowPasswordAuthentication=\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u3092\u8A31\u53EF
pairwiseSubAlgorithmSalt.tooltip=\u30DA\u30A2\u30EF\u30A4\u30BA\u5BFE\u8C61\u8B58\u5225\u5B50\u3092\u8A08\u7B97\u3059\u308B\u969B\u306B\u4F7F\u7528\u3059\u308B\u30BD\u30EB\u30C8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u7A7A\u767D\u306E\u307E\u307E\u306B\u3059\u308B\u3068\u30BD\u30EB\u30C8\u306F\u751F\u6210\u3055\u308C\u307E\u3059\u3002
clientAuthorization=\u8A8D\u53EF
waitIncrementSecondsHelp=\u5931\u6557\u56DE\u6570\u304C\u95BE\u5024\u306B\u9054\u3057\u305F\u5834\u5408\u3001\u3069\u308C\u304F\u3089\u3044\u306E\u6642\u9593\u30E6\u30FC\u30B6\u30FC\u306F\u30ED\u30C3\u30AF\u30A2\u30A6\u30C8\u3055\u308C\u308B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
allowKerberosAuthentication=Kerberos\u8A8D\u8A3C\u3092\u8A31\u53EF
addressClaim.formatted.tooltip=\u300Caddress\u300D\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u5185\u306E\u300Cformatted\u300D\u30B5\u30D6\u30AF\u30EC\u30FC\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Cformatted\u300D\u3067\u3059\u3002
allowedClockSkew=\u8A31\u5BB9\u3055\u308C\u308B\u30AF\u30ED\u30C3\u30AF\u30B9\u30AD\u30E5\u30FC
events=\u30A4\u30D9\u30F3\u30C8
createPermission=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u4F5C\u6210
mapperType=\u30DE\u30C3\u30D1\u30FC\u30BF\u30A4\u30D7
credentialResetConfirm=E\u30E1\u30FC\u30EB\u3092\u9001\u4FE1
permissionsEnabledHelp=\u3053\u306E\u30ED\u30FC\u30EB\u3092\u7BA1\u7406\u3059\u308B\u305F\u3081\u306B\u3001\u304D\u3081\u7D30\u304B\u3044\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u7121\u52B9\u306B\u3059\u308B\u3068\u3001\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u73FE\u5728\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u3059\u3079\u3066\u524A\u9664\u3055\u308C\u307E\u3059\u3002
consentScreenTextHelp=\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u304C\u540C\u610F\u304C\u5FC5\u8981\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u8FFD\u52A0\u3055\u308C\u305F\u5834\u5408\u306B\u3001\u540C\u610F\u753B\u9762\u306B\u8868\u793A\u3055\u308C\u308B\u30C6\u30AD\u30B9\u30C8\u3002\u6307\u5B9A\u3057\u306A\u3044\u5834\u5408\u306F\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u540D\u524D\u306B\u306A\u308A\u307E\u3059
kerberosRealm=Kerberos\u30EC\u30EB\u30E0
flow.direct\ grant=\u30C0\u30A4\u30EC\u30AF\u30C8\u30FB\u30B0\u30E9\u30F3\u30C8\u30FB\u30D5\u30ED\u30FC
typeHelp=\u4F5C\u6210\u3055\u308C\u305F\u5404\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u3068\u3057\u3066\u8FFD\u52A0\u3055\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7
htmlDisplayName=HTML\u8868\u793A\u540D
authorizationUrl=\u8A8D\u53EFURL
contextualAttributes=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5C5E\u6027
replyTo=\u8FD4\u4FE1\u5148
providerDescription=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u8AAC\u660E
scopePermissions.clients.view-description=\u7BA1\u7406\u8005\u304C\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u8868\u793A\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
idpInitiatedSsoRelayStateHelp=IDP Initiated SSO\u3092\u884C\u3046\u969B\u306ESAML\u30EA\u30AF\u30A8\u30B9\u30C8\u3067\u9001\u4FE1\u3057\u305F\u3044RelayState\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
otpHashAlgorithmHelp=OTP\u3092\u751F\u6210\u3059\u308B\u306E\u306B\u3069\u306E\u30CF\u30C3\u30B7\u30E5\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u4F7F\u7528\u3059\u308B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
usermodel.clientRoleMapping.clientId.tooltip=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D4\u30F3\u30B0\u7528\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID\u3002\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30ED\u30FC\u30EB\u3060\u3051\u304C\u30C8\u30FC\u30AF\u30F3\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u3059\u3079\u3066\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30ED\u30FC\u30EB\u304C\u30C8\u30FC\u30AF\u30F3\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
default=DEFAULT
passCurrentLocaleHelp=\u73FE\u5728\u306E\u30ED\u30B1\u30FC\u30EB\u3092ui_locales\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3068\u3057\u3066\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u6E21\u3057\u307E\u3059\u3002
scopePermissions.clients.manage-description=\u7BA1\u7406\u8005\u304C\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u7BA1\u7406\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
vendor=\u30D9\u30F3\u30C0\u30FC
webAuthnPolicyRequireResidentKeyHelp=\u3053\u308C\u306F\u3001\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306B\u516C\u958B\u9375\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u5E38\u99D0\u9375\u3068\u3057\u3066\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u793A\u3057\u307E\u3059\u3002
logoutServiceRedirectBindingURL=\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306ERedirect\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL
dayMonth=\u30DD\u30EA\u30B7\u30FC\u304C\u8A31\u53EF\u3055\u308C\u308B\u65E5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u30022\u756A\u76EE\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u5024\u3092\u5165\u529B\u3057\u3066\u7BC4\u56F2\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u73FE\u5728\u306E\u65E5\u304C\u6307\u5B9A\u3057\u305F2\u3064\u306E\u5024\u306E\u9593\u306B\u3042\u308B\u304B\u3001\u7B49\u3057\u3044\u5834\u5408\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
disabled=\u7121\u52B9
idpInitiatedSsoRelayState=IDP Initiated SSO\u306ERelayState
validatingX509Certs=\u691C\u8A3C\u7528\u306EX509\u8A3C\u660E\u66F8
guiOrder=GUI\uFF08\u540C\u610F\u30DA\u30FC\u30B8\u306E\u3088\u3046\u306A\uFF09\u3067\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u9806\u5E8F\u3092\u6574\u6570\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002
userInfoUrl=UserInfo URL
displayOnConsentScreen=\u540C\u610F\u753B\u9762\u3067\u8868\u793A\u3059\u308B
principalAttributeHelp=\u5916\u90E8\u30E6\u30FC\u30B6\u30FC\u3092\u8B58\u5225\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u5C5E\u6027\u306E\u540D\u524D\u307E\u305F\u306F\u30D5\u30EC\u30F3\u30C9\u30EA\u30FC\u540D\u3002
nameIdPolicyFormat=Name ID\u30DD\u30EA\u30B7\u30FC\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
idpInitiatedSsoUrlName=IDP Initiated SSO\u3092\u884C\u3046\u969B\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u53C2\u7167\u3059\u308B\u305F\u3081\u306EURL\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u540D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u7A7A\u306B\u3059\u308B\u3068IDP Initiated SSO\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u30D6\u30E9\u30A6\u30B6\u30FC\u304B\u3089\u53C2\u7167\u3059\u308BURL\u306F\u300C{server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}\u300D\u306B\u306A\u308A\u307E\u3059\u3002
xFrameOptions=X-Frame-Options
scopeDescriptionHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u8AAC\u660E
directGrant=\u30C0\u30A4\u30EC\u30AF\u30C8\u30FB\u30B0\u30E9\u30F3\u30C8\u30FB\u30D5\u30ED\u30FC
consensus=Consensus
nameIdFormatHelp=\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u4F7F\u7528\u3059\u308BName ID\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
ssoSessionIdleRememberMe=\u30EA\u30E1\u30F3\u30D0\u30FC\u30DF\u30FC\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u307E\u3067\u306E\u30A2\u30A4\u30C9\u30EB\u6642\u9593\u3067\u3059\u3002\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u308B\u3068\u3001\u30C8\u30FC\u30AF\u30F3\u304A\u3088\u3073\u30D6\u30E9\u30A6\u30B6\u30FC\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u6A19\u6E96\u306ESSO\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30A2\u30A4\u30C9\u30EB\u5024\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
adminEvents=\u7BA1\u7406\u30A4\u30D9\u30F3\u30C8
SSOSessionIdleRememberMe=SSO\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30A2\u30A4\u30C9\u30EB\u30FB\u30EA\u30E1\u30F3\u30D0\u30FC\u30DF\u30FC
urisHelp=\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u3063\u3066\u4FDD\u8B77\u3055\u308C\u3066\u3044\u308BURI\u306E\u30BB\u30C3\u30C8\u3002
serverPrincipal=\u30B5\u30FC\u30D0\u30FC\u30FB\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
signDocuments=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3092\u7F72\u540D\u3059\u308B
tokenUrl=\u30C8\u30FC\u30AF\u30F3URL
webauthnPolicy=WebAuthn\u30DD\u30EA\u30B7\u30FC
grantedClientScopes=\u4ED8\u4E0E\u3055\u308C\u305F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7
evictionHour=\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u306E\u6642
effectiveProtocolMappers=\u6709\u52B9\u306A\u30D7\u30ED\u30C8\u30B3\u30EB\u30FB\u30DE\u30C3\u30D1\u30FC
notBefore=\u3053\u306E\u65E5\u6642\u3088\u308A\u524D
syncModes.legacy=\u30EC\u30AC\u30B7\u30FC
ldapMappersList=LDAP\u30DE\u30C3\u30D1\u30FC
titleEvents=\u30A4\u30D9\u30F3\u30C8
addIdpMapperName=\u30DE\u30C3\u30D1\u30FC\u306E\u540D\u524D\u3067\u3059\u3002
continue=\u7D9A\u3051\u308B
acceptsPromptNoneHelp=\u3053\u308C\u306F\u3001\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30FB\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u3068\u3068\u3082\u306B\u4F7F\u7528\u3055\u308C\u308B\u304B\u3001\u307E\u305F\u306Fkc_idp_hint\u304C\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u6307\u3059\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304Cprompt\=none\u3067\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u9001\u4FE1\u3057\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u307E\u3060\u8A8D\u8A3C\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30A8\u30E9\u30FC\u306F\u76F4\u63A5\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u8FD4\u3055\u308C\u307E\u305B\u3093\u304C\u3001prompt\=none\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u8EE2\u9001\u3055\u308C\u307E\u3059\u3002
included.client.audience.label=\u542B\u307E\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9
selectScope=\u30B9\u30B3\u30FC\u30D7\u3092\u9078\u629E
generateNewKeys=\u65B0\u3057\u3044\u9375\u3092\u751F\u6210
offlineSessionIdle=\u30AA\u30D5\u30E9\u30A4\u30F3\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30A2\u30A4\u30C9\u30EB
revokeRefreshToken=\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u306E\u7121\u52B9\u5316
resourceName=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u4E00\u610F\u306A\u540D\u524D\u3002\u3053\u306E\u540D\u524D\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u3092\u4E00\u610F\u306B\u8B58\u5225\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3067\u304D\u3001\u7279\u5B9A\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u7167\u4F1A\u3059\u308B\u3068\u304D\u306B\u4FBF\u5229\u3067\u3059\u3002
minimumQuickLoginWaitSeconds=\u30AF\u30A4\u30C3\u30AF\u30ED\u30B0\u30A4\u30F3\u5931\u6557\u6642\u306E\u6700\u5C0F\u5F85\u6A5F\u6642\u9593
operationTypes=\u64CD\u4F5C\u30BF\u30A4\u30D7
expireTime=\u30DD\u30EA\u30B7\u30FC\u3092\u8A31\u53EF\u3057\u306A\u3044\u65E5\u6642\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u73FE\u5728\u65E5\u6642\u304C\u3053\u306E\u5024\u3088\u308A\u524D\u304B\u3001\u7B49\u3057\u3044\u5834\u5408\u306B\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
adminThemeHelp=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30C6\u30FC\u30DE\u3092\u9078\u629E\u3057\u307E\u3059\u3002
name=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u540D\u524D\u3002\u30EC\u30EB\u30E0\u5185\u3067\u30E6\u30CB\u30FC\u30AF\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u30B9\u30B3\u30FC\u30D7\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u5024\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u308B\u305F\u3081\u3001\u540D\u524D\u306B\u306F\u7A7A\u767D\u6587\u5B57\u3092\u542B\u3081\u306A\u3044\u3067\u304F\u3060\u3055\u3044
clientList=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8
userSession.modelNote.label=\u30E6\u30FC\u30B6\u30FC\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30CE\u30FC\u30C8
next=\u6B21\u3078
pagination=\u30DA\u30FC\u30B8\u30CD\u30FC\u30B7\u30E7\u30F3
import=\u30EA\u30BD\u30FC\u30B9\u30B5\u30FC\u30D0\u30FC\u306E\u8A8D\u53EF\u8A2D\u5B9A\u3092\u542B\u3080JSON\u30D5\u30A1\u30A4\u30EB\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
otpHashAlgorithm=OTP\u30CF\u30C3\u30B7\u30E5\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
mapper.nameid.format.tooltip=\u30DE\u30C3\u30D1\u30FC\u3092\u9069\u7528\u3059\u308BName ID\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
hideOnLoginPageHelp=\u975E\u8868\u793A\u306E\u5834\u5408\u3001\u660E\u793A\u7684\u306B\u8981\u6C42\u3055\u308C\u3066\u3044\u308C\u3070\uFF08\u4F8B\u3048\u3070\u3001\u300Ckc_idp_hint\u300D\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308C\u3070\uFF09\u3001\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u3088\u308B\u30ED\u30B0\u30A4\u30F3\u304C\u53EF\u80FD\u3067\u3059\u3002
description=\u8AAC\u660E
eventListenersHelpText=\u3069\u306E\u30EA\u30B9\u30CA\u30FC\u304C\u30EC\u30EB\u30E0\u306E\u30A4\u30D9\u30F3\u30C8\u3092\u53D7\u3051\u53D6\u308B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
addressClaim.postal_code.tooltip=\u300Caddress\u300D\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u5185\u306E\u300Cpostal_code\u300D\u30B5\u30D6\u30AF\u30EC\u30FC\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Cpostal_code\u300D\u3067\u3059\u3002
providerId=ID
Tuesday=\u706B
loginTimeout=\u30ED\u30B0\u30A4\u30F3\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
idTokenEncryptionContentEncryptionAlgorithm=ID\u30C8\u30FC\u30AF\u30F3\u6697\u53F7\u5316\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u6697\u53F7\u5316\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
fineGrainSamlEndpointConfig=SAML\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A73\u7D30\u8A2D\u5B9A
hours=\u6642
maxFailureWaitSeconds=\u6700\u5927\u5F85\u6A5F\u6642\u9593
configure=\u8A2D\u5B9A
manage=\u7BA1\u7406
alwaysDisplayInUI=\u5E38\u306B\u30B3\u30F3\u30BD\u30FC\u30EB\u306B\u8868\u793A
kerberosIntegration=Kerberos\u3068\u7D71\u5408
protocolMapper=\u30D7\u30ED\u30C8\u30B3\u30EB\u3067\u3059\u3002
requiredSettings=\u5FC5\u8981\u306A\u8A2D\u5B9A
time=\u65E5\u6642
scopePermissions.users.view-description=\u7BA1\u7406\u8005\u304C\u30EC\u30EB\u30E0\u5185\u306E\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u8868\u793A\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
idTokenSignatureAlgorithmHelp=ID\u30C8\u30FC\u30AF\u30F3\u306E\u7F72\u540D\u306B\u4F7F\u7528\u3055\u308C\u308BJWA\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
sslType.all=\u5168\u3066\u306E\u30EA\u30AF\u30A8\u30B9\u30C8
excludeSessionStateFromAuthenticationResponse=\u8A8D\u8A3C\u30EC\u30B9\u30DD\u30F3\u30B9\u304B\u3089\u30BB\u30C3\u30B7\u30E7\u30F3\u72B6\u614B\u3092\u9664\u5916
httpPostBindingResponse=HTTP-POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9
saveEvents=\u30A4\u30D9\u30F3\u30C8\u306E\u4FDD\u5B58
issuer=\u767A\u884C\u8005\uFF08Issuer\uFF09
policyEnforcementModeHelp=\u30DD\u30EA\u30B7\u30FC\u65BD\u884C\u30E2\u30FC\u30C9\u306F\u3001\u8A8D\u53EF\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u8A55\u4FA1\u3059\u308B\u969B\u306B\u9069\u7528\u3055\u308C\u308B\u65B9\u6CD5\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u300CEnforcing\u300D\u306F\u3001\u4E0E\u3048\u3089\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u9023\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u304C\u5B58\u5728\u3057\u306A\u3044\u5834\u5408\u3067\u3082\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u62D2\u5426\u3055\u308C\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300CPermissive\u300D\u306F\u3001\u4E0E\u3048\u3089\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u9023\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u304C\u5B58\u5728\u3057\u306A\u3044\u5834\u5408\u3067\u3082\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u8A31\u53EF\u3055\u308C\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300CDisabled\u300D\u306F\u3001\u5B8C\u5168\u306B\u30DD\u30EA\u30B7\u30FC\u306E\u8A55\u4FA1\u3092\u7121\u52B9\u306B\u3057\u3001\u4EFB\u610F\u306E\u30EA\u30BD\u30FC\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u8A31\u53EF\u3057\u307E\u3059\u3002
lastUpdated=\u6700\u7D42\u66F4\u65B0\u65E5
credentialResetBtn=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30EA\u30BB\u30C3\u30C8
selectAUser=\u30E6\u30FC\u30B6\u30FC\u3092\u9078\u629E
eventTypes.RESET_PASSWORD.name=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u30EA\u30BB\u30C3\u30C8
oAuthMutual=OAuth 2.0\u76F8\u4E92TLS\u8A3C\u660E\u66F8\u30D0\u30A4\u30F3\u30C9\u30FB\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u304C\u6709\u52B9
keystore=\u30AD\u30FC\u30B9\u30C8\u30A2
canonicalizationHelp=XML\u7F72\u540D\u306E\u6B63\u898F\u5316\u65B9\u5F0F\uFF08Canonicalization Method\uFF09\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
sessions=\u30BB\u30C3\u30B7\u30E7\u30F3
fullSyncPeriodHelp=\u30D5\u30EB\u540C\u671F\u306E\u5468\u671F\u3092\u79D2\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002
priority=\u512A\u5148\u5EA6
trustEmail=E\u30E1\u30FC\u30EB\u3092\u4FE1\u983C
jsonType.label=\u30AF\u30EC\u30FC\u30E0JSON\u30BF\u30A4\u30D7
fullScopeAllowed=\u30D5\u30EB\u30B9\u30B3\u30FC\u30D7\u3092\u8A31\u53EF
syncModes.inherit=\u7D99\u627F
masterSamlProcessingUrlHelp=\u8A2D\u5B9A\u3055\u308C\u305F\u5834\u5408\u306F\u3001\u3053\u306EURL\u304CSP\u306E\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304A\u3088\u3073\u30B7\u30F3\u30B0\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u4E21\u65B9\u306EBinding\u306B\u4F7F\u308F\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u3001SAML\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A73\u7D30\u8A2D\u5B9A\u306B\u3042\u308B\u5404Binding\u3084\u30B5\u30FC\u30D3\u30B9\u306E\u8A2D\u5B9A\u306B\u3066\u500B\u5225\u306B\u4E0A\u66F8\u304D\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
claimJsonType=\u30C8\u30FC\u30AF\u30F3\u3078\u306EJSON\u30AF\u30EC\u30FC\u30E0\u306E\u8FFD\u52A0\u3067\u4F7F\u7528\u3055\u308C\u308BJSON\u30BF\u30A4\u30D7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002long\u3001int\u3001boolean\u3001String\u3001JSON\u304C\u6709\u52B9\u306A\u5024\u3067\u3059\u3002
sslType.external=\u5916\u90E8\u30EA\u30AF\u30A8\u30B9\u30C8
multiValued=\u5C5E\u6027\u304C\u30DE\u30EB\u30C1\u30D0\u30EA\u30E5\u30FC\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u5C5E\u6027\u306E\u3059\u3079\u3066\u306E\u5024\u30EA\u30B9\u30C8\u304C\u30AF\u30EC\u30FC\u30E0\u3068\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u6700\u521D\u306E\u5024\u3060\u3051\u304C\u30AF\u30EC\u30FC\u30E0\u3068\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
webAuthnPolicyAttestationConveyancePreferenceHelp=\u8A8D\u8A3C\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u751F\u6210\u3059\u308B\u65B9\u6CD5\u306E\u512A\u5148\u6A29\u3092\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306B\u901A\u77E5\u3057\u307E\u3059\u3002
duplicateEmailsHelpText=\u8907\u6570\u306E\u30E6\u30FC\u30B6\u30FC\u304C\u540C\u3058E\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u3092\u6301\u3064\u3053\u3068\u3092\u8A31\u53EF\u3057\u307E\u3059\u3002\u3053\u306E\u8A2D\u5B9A\u3092\u5909\u66F4\u3059\u308B\u3068\u3001\u30E6\u30FC\u30B6\u30FC\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3082\u30AF\u30EA\u30A2\u3055\u308C\u307E\u3059\u3002\u91CD\u8907\u3059\u308BE\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u7121\u52B9\u306B\u3057\u305F\u5F8C\u3067\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5185\u306E\u65E2\u5B58\u30E6\u30FC\u30B6\u30FC\u306EE\u30E1\u30FC\u30EB\u306E\u5236\u7D04\u3092\u624B\u52D5\u3067\u66F4\u65B0\u3059\u308B\u3053\u3068\u3092\u304A\u52E7\u3081\u3057\u307E\u3059\u3002
usermodel.realmRoleMapping.rolePrefix.label=\u30EC\u30EB\u30E0\u30ED\u30FC\u30EB\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9
temporaryPasswordHelpText=\u6709\u52B9\u306E\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u6B21\u306E\u30ED\u30B0\u30A4\u30F3\u6642\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u5909\u66F4\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
connectionPooling=\u63A5\u7D9A\u30D7\u30FC\u30EA\u30F3\u30B0
wantAuthnRequestsSignedHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u7F72\u540D\u4ED8\u304DAuthnRequest\u3092\u8981\u6C42\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
enabled=\u6709\u52B9
forgotPassword=\u30D1\u30B9\u30EF\u30FC\u30C9\u5FD8\u308C
idTokenEncryptionKeyManagementAlgorithmHelp=ID\u30C8\u30FC\u30AF\u30F3\u306E\u6697\u53F7\u5316\u9375\u306E\u7BA1\u7406\u306B\u4F7F\u7528\u3055\u308C\u308BJWA\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u3001\u6697\u53F7\u5316\u3055\u308C\u305FID\u30C8\u30FC\u30AF\u30F3\u304C\u5FC5\u8981\u306A\u5834\u5408\u306B\u5FC5\u9808\u3067\u3059\u3002\u7A7A\u306E\u307E\u307E\u306B\u3059\u308B\u3068\u3001ID\u30C8\u30FC\u30AF\u30F3\u306F\u7F72\u540D\u3055\u308C\u307E\u3059\u304C\u3001\u6697\u53F7\u5316\u3055\u308C\u307E\u305B\u3093\u3002
keyPassword=\u9375\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
scopePermissions.clients.map-roles-composite-description=\u7BA1\u7406\u8005\u304C\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u305F\u30ED\u30FC\u30EB\u3092\u30B3\u30F3\u30DD\u30B8\u30C3\u30C8\u3068\u3057\u3066\u5225\u306E\u30ED\u30FC\u30EB\u306B\u9069\u7528\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
startTime=\u30DD\u30EA\u30B7\u30FC\u3092\u8A31\u53EF\u3057\u306A\u3044\u65E5\u6642\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u73FE\u5728\u65E5\u6642\u304C\u3053\u306E\u5024\u3088\u308A\u5F8C\u304B\u3001\u7B49\u3057\u3044\u5834\u5408\u306B\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
logicHelp=\u30ED\u30B8\u30C3\u30AF\u306F\u3001\u30DD\u30EA\u30B7\u30FC\u306E\u5224\u5B9A\u65B9\u6CD5\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u300CPositive\u300D\u306E\u5834\u5408\u306F\u3001\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u306E\u8A55\u4FA1\u4E2D\u306B\u5F97\u3089\u308C\u305F\u7D50\u679C\uFF08\u8A31\u53EF\u307E\u305F\u306F\u62D2\u5426\uFF09\u304C\u5224\u5B9A\u306E\u5B9F\u884C\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u300CNegative\u300D\u306E\u5834\u5408\u306F\u3001\u7D50\u679C\u306F\u53CD\u8EE2\u3055\u308C\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u8A31\u53EF\u306F\u62D2\u5426\u306B\u306A\u308A\u3001\u62D2\u5426\u306F\u8A31\u53EF\u306B\u306A\u308A\u307E\u3059\u3002
clientNameHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8868\u793A\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u4F8B\u3048\u3070\u3001\u300CMy Client\u300D\u3067\u3059\u3002\u30ED\u30FC\u30AB\u30E9\u30A4\u30BA\u7528\u306E\u30AD\u30FC\u3082\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u3059\u3002\u4F8B\: ${my_client}
createPolicy=\u30DD\u30EA\u30B7\u30FC\u3092\u4F5C\u6210
clearAdminEvents=\u7BA1\u7406\u30A4\u30D9\u30F3\u30C8\u306E\u30AF\u30EA\u30A2
rootUrl=\u30EB\u30FC\u30C8URL
clientLoginTimeout=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30ED\u30B0\u30A4\u30F3\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
webAuthnPolicyExtraOrigins=\u30A8\u30AF\u30B9\u30C8\u30E9\u30AA\u30EA\u30B8\u30F3\u30BA
alwaysDisplayInUIHelp=\u30E6\u30FC\u30B6\u30FC\u306E\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u306A\u3044\u5834\u5408\u3067\u3082\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u5E38\u306B\u30A2\u30AB\u30A6\u30F3\u30C8\u30FB\u30B3\u30F3\u30BD\u30FC\u30EB\u306B\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
readTimeout=\u8AAD\u307F\u53D6\u308A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
samlSignatureKeyName=SAML\u7F72\u540D\u9375\u540D
accessTokenSignatureAlgorithm=\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
logicType.negative=Negative
otpPolicy=OTP\u30DD\u30EA\u30B7\u30FC
flow-type.form-flow=form
signDocumentsHelp=SAML\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3092\u30EC\u30EB\u30E0\u3067\u7F72\u540D\u3059\u3079\u304D\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
resetPassword=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u30EA\u30BB\u30C3\u30C8
requireSslHelp=HTTPS\u304C\u5FC5\u9808\u304B\u3069\u3046\u304B\u3002\u300C\u306A\u3057\u300D\u306F\u3001HTTPS\u304C\u3069\u306EIP\u30A2\u30C9\u30EC\u30B9\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3082\u8981\u6C42\u3055\u308C\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300C\u5916\u90E8\u30EA\u30AF\u30A8\u30B9\u30C8\u300D\u306F\u3001\u30ED\u30FC\u30AB\u30EB\u30DB\u30B9\u30C8\u3068\u30D7\u30E9\u30A4\u30D9\u30FC\u30C8IP\u30A2\u30C9\u30EC\u30B9\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304CHTTPS\u306A\u3057\u3067\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300C\u3059\u3079\u3066\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u300D\u306F\u3001HTTPS\u304C\u3059\u3079\u3066\u306EIP\u30A2\u30C9\u30EC\u30B9\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u8981\u6C42\u3055\u308C\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
addUser=\u30E6\u30FC\u30B6\u30FC\u306E\u8FFD\u52A0
includeAuthnStatementHelp=\u8A8D\u8A3C\u65B9\u5F0F\u3068\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3092\u542B\u3081\u305F\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u30ED\u30B0\u30A4\u30F3\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u542B\u3081\u308B\u3079\u304D\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
protocol=\u30D7\u30ED\u30C8\u30B3\u30EB
manageAccount=\u30A2\u30AB\u30A6\u30F3\u30C8\u306E\u7BA1\u7406
clientSecret=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8
httpPostBindingAuthnRequest=AuthnRequest\u306EHTTP-POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
includeInAccessToken.label=\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306B\u8FFD\u52A0
iconUri=\u30A2\u30A4\u30B3\u30F3URI
usersInRole=\u30ED\u30FC\u30EB\u306E\u30E6\u30FC\u30B6\u30FC
groupsClaimHelp=\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30DD\u30EA\u30B7\u30FC\u306F\u3001\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u8981\u6C42\u3059\u308B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u8868\u3059\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u307E\u305F\u306FID\u30C8\u30FC\u30AF\u30F3\u5185\u306E\u7279\u5B9A\u306E\u30AF\u30EC\u30FC\u30E0\u304B\u3089\u3001\u30E6\u30FC\u30B6\u30FC\u306E\u30B0\u30EB\u30FC\u30D7\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30E6\u30FC\u30B6\u30FC\u306E\u30B0\u30EB\u30FC\u30D7\u306F\u30EC\u30EB\u30E0\u8A2D\u5B9A\u304B\u3089\u53D6\u5F97\u3055\u308C\u307E\u3059\u3002
createGroup=\u30B0\u30EB\u30FC\u30D7\u306E\u4F5C\u6210
clientAuthentications.client_secret_jwt=JWT\u3067\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8
created=\u4F5C\u6210\u65E5
minutes=\u5206
usersDN=\u30E6\u30FC\u30B6\u30FCDN
selectUser=\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u306BID\u304C\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u3092\u9078\u629E\u3057\u307E\u3059\u3002
included.custom.audience.label=\u542B\u307E\u308C\u308B\u30AB\u30B9\u30BF\u30E0\u30FB\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9
requestObjectSignatureAlgorithm=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
tokenLifespan.expires=\u6709\u52B9\u671F\u9650
mappers=\u30DE\u30C3\u30D1\u30FC
waitIncrementSeconds=\u9023\u7D9A\u5931\u6557\u6642\u306E\u5F85\u6A5F\u6642\u9593
name-id-format=Name ID\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
credentials=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB
webAuthnPolicyCreateTimeoutHelp=\u30E6\u30FC\u30B6\u30FC\u306E\u516C\u958B\u9375\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u4F5C\u6210\u306B\u5BFE\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5024\uFF08\u79D2\u5358\u4F4D\uFF09\u30020\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u9069\u5FDC\u3055\u308C\u307E\u305B\u3093\u3002
policyType.hotp=\u30AB\u30A6\u30F3\u30BF\u30FC\u30D9\u30FC\u30B9
enableSSL=SSL\u306E\u6709\u52B9
general=\u4E00\u822C
failureFactor=\u6700\u5927\u30ED\u30B0\u30A4\u30F3\u5931\u6557\u56DE\u6570
usermodel.clientRoleMapping.tokenClaimName.tooltip=\u30C8\u30FC\u30AF\u30F3\u5185\u306B\u633F\u5165\u3059\u308B\u30AF\u30EC\u30FC\u30E0\u306E\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u300Caddress.street\u300D\u306E\u3088\u3046\u306B\u5B8C\u5168\u4FEE\u98FE\u540D\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u30CD\u30B9\u30C8\u3055\u308C\u305FJSON\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30CD\u30B9\u30C6\u30A3\u30F3\u30B0\u3092\u9632\u304E\u3001\u30C9\u30C3\u30C8\u3092\u6587\u5B57\u901A\u308A\u306B\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001\u30C9\u30C3\u30C8\u3092\u30D0\u30C3\u30AF\u30B9\u30E9\u30C3\u30B7\u30E5\uFF08\\.\uFF09\u3067\u30A8\u30B9\u30B1\u30FC\u30D7\u3057\u307E\u3059\u3002\u7279\u5225\u306A\u30C8\u30FC\u30AF\u30F3${client_id}\u3092\u4F7F\u3046\u3053\u3068\u304C\u3067\u304D\u3001\u3053\u308C\u306F\u5B9F\u969B\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002\u4F7F\u7528\u4F8B\u306F\u300Cresource_access.${client_id}.roles\u300D\u3067\u3059\u3002\u3053\u308C\u306F\u3001\u3059\u3079\u3066\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304B\u3089\u30ED\u30FC\u30EB\u3092\u8FFD\u52A0\u3059\u308B\u5834\u5408\uFF08\u7279\u306B\u300CClient ID\u300D\u30B9\u30A4\u30C3\u30C1\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\uFF09\u3084\u3001\u5404\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30ED\u30FC\u30EB\u3092\u5225\u3005\u306E\u5834\u6240\u306B\u4FDD\u5B58\u3059\u308B\u5834\u5408\u306B\u3001\u7279\u306B\u4FBF\u5229\u3067\u3059\u3002
signAssertions=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u7F72\u540D\u3059\u308B
scopePermissions.clients.map-roles-description=\u7BA1\u7406\u8005\u304C\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u305F\u30ED\u30FC\u30EB\u3092\u30DE\u30C3\u30D7\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
disableUserInfoHelp=\u8FFD\u52A0\u306E\u30E6\u30FC\u30B6\u30FC\u60C5\u5831\u3092\u53D6\u5F97\u3059\u308BUserInfo\u30B5\u30FC\u30D3\u30B9\u306E\u4F7F\u7528\u3092\u7121\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3053\u306EOIDC\u30B5\u30FC\u30D3\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
adminTheme=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u30C6\u30FC\u30DE
alias=\u30A8\u30A4\u30EA\u30A2\u30B9
validateSignatures=SAML\u30EC\u30B9\u30DD\u30F3\u30B9\u306E\u7F72\u540D\u691C\u8A3C\u306E\u6709\u52B9/\u7121\u52B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
authentication=\u8A8D\u8A3C
descriptionHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u8AAC\u660E
logoutUrlHelp=\u5916\u90E8IDP\u304B\u3089\u30E6\u30FC\u30B6\u30FC\u306E\u30ED\u30B0\u30A2\u30A6\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30BB\u30C3\u30B7\u30E7\u30F3\u7D42\u4E86\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
permissionType=\u3053\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u9069\u7528\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
policyEnforcementModes.ENFORCING=\u5B9F\u65BD
permanentLockout=\u6C38\u4E45\u30ED\u30C3\u30AF\u30A2\u30A6\u30C8
debug=\u30C7\u30D0\u30C3\u30B0
webAuthnPolicyRequireResidentKey=\u5E38\u99D0\u9375\u304C\u5FC5\u8981
clear=\u30AF\u30EA\u30A2
signatureAlgorithm=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u7F72\u540D\u306B\u4F7F\u7528\u3059\u308B\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3067\u3059\u3002
eventTypes.LOGOUT.name=\u30ED\u30B0\u30A2\u30A6\u30C8
groupsClaim=\u30B0\u30EB\u30FC\u30D7\u30AF\u30EC\u30FC\u30E0
requiredActions=\u5FC5\u9808\u30A2\u30AF\u30B7\u30E7\u30F3
authenticationOverridesHelp=\u30EC\u30EB\u30E0\u8A8D\u8A3C\u30D5\u30ED\u30FC\u30FB\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002
policyDecisionStagey=\u6C7A\u5B9A\u6226\u7565\u306F\u3001\u30DD\u30EA\u30B7\u30FC\u306E\u8A55\u4FA1\u65B9\u6CD5\u3068\u6700\u7D42\u7684\u306A\u5224\u5B9A\u65B9\u6CD5\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u300CAffirmative\u300D\u306F\u3001\u6700\u7D42\u5224\u5B9A\u304Cpositive\u3068\u306A\u308B\u305F\u3081\u306B\u306F\u3001\u5C11\u306A\u304F\u3068\u30821\u3064\u306E\u30DD\u30EA\u30B7\u30FC\u304Cpositive\u3068\u8A55\u4FA1\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u3001\u3068\u3044\u3046\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300CUnanimous\u300D\u306F\u3001\u5168\u4F53\u306E\u5224\u5B9A\u304Cpositive\u3068\u306A\u308B\u305F\u3081\u306B\u306F\u3001\u3059\u3079\u3066\u306E\u30DD\u30EA\u30B7\u30FC\u304Cpositive\u3068\u8A55\u4FA1\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u3001\u3068\u3044\u3046\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300CConsensus\u300D\u306F\u3001positive\u306E\u6570\u304Cnegative\u306E\u6570\u3088\u308A\u591A\u304F\u306A\u3051\u308C\u3070\u306A\u3089\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002positive\u3068negative\u306E\u6570\u304C\u540C\u3058\u5834\u5408\u306F\u3001\u6700\u7D42\u7684\u306A\u5224\u5B9A\u306Fnegative\u306B\u306A\u308A\u307E\u3059\u3002
resetActions=\u30EA\u30BB\u30C3\u30C8\u30FB\u30A2\u30AF\u30B7\u30E7\u30F3
batchSize=\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA
usermodel.prop.tooltip=UserModel\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30A4\u30B9\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30FB\u30E1\u30BD\u30C3\u30C9\u306E\u540D\u524D\u3067\u3059\u3002\u4F8B\u3048\u3070\u3001\u300Cemail\u300D\u306E\u5024\u306FUserModel.getEmail()\u30E1\u30BD\u30C3\u30C9\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002
user=\u30E6\u30FC\u30B6\u30FC
otpTypeHelp=\u300Ctotp\u300D\u306F\u30BF\u30A4\u30E0\u30D9\u30FC\u30B9\u306E\u30EF\u30F3\u30BF\u30A4\u30E0\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u3067\u3059\u3002\u300Chotp\u300D\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u3067\u30CF\u30C3\u30B7\u30E5\u306B\u5BFE\u3057\u3066\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u4FDD\u6301\u3059\u308B\u30AB\u30A6\u30F3\u30BF\u30FC\u30D9\u30FC\u30B9\u306E\u30EF\u30F3\u30BF\u30A4\u30E0\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u3067\u3059\u3002
duplicateEmails=\u30E1\u30FC\u30EB\u306E\u91CD\u8907
keyForCodeExchange=Proof Key for Code Exchange\u306E\u30B3\u30FC\u30C9\u30C1\u30E3\u30EC\u30F3\u30B8\u65B9\u5F0F
endpointsHelp=\u30D7\u30ED\u30C8\u30B3\u30EB\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A2D\u5B9A\u3092\u8868\u793A\u3057\u307E\u3059\u3002
useKerberosForPasswordAuthentication=\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u306BKerberos\u3092\u4F7F\u7528
xXSSProtection=X-XSS-Protection
debugHelp=Krb5LoginModule\u306E\u6A19\u6E96\u51FA\u529B\u3078\u306E\u30C7\u30D0\u30C3\u30B0\u30ED\u30AE\u30F3\u30B0\u306E\u6709\u52B9/\u7121\u52B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
validatorColNames.colConfig=\u8A2D\u5B9A
nodeHost=\u30CE\u30FC\u30C9\u30DB\u30B9\u30C8
quickLoginCheckMilliSeconds=\u30AF\u30A4\u30C3\u30AF\u30ED\u30B0\u30A4\u30F3\u5931\u6557\u304C\u3042\u307E\u308A\u306B\u3082\u983B\u7E41\u306B\u767A\u751F\u3057\u305F\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u3092\u30ED\u30C3\u30AF\u30A2\u30A6\u30C8\u3057\u307E\u3059\u3002
unspecified=\u672A\u5B9A\u7FA9
profile=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB
active=\u30A2\u30AF\u30C6\u30A3\u30D6
forcePostBindingHelp=\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u5E38\u306BPOST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
roleName=\u30ED\u30FC\u30EB\u540D
addOrigins=\u30AA\u30EA\u30B8\u30F3\u3092\u8FFD\u52A0
requiredUserActionsHelp=\u30E6\u30FC\u30B6\u30FC\u304C\u30ED\u30B0\u30A4\u30F3\u3059\u308B\u3068\u304D\u306B\u5FC5\u8981\u306A\u30A2\u30AF\u30B7\u30E7\u30F3\u3067\u3059\u3002\u300CVerify email\u300D\u306F\u3001E\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306EE\u30E1\u30FC\u30EB\u3092\u30E6\u30FC\u30B6\u30FC\u306B\u9001\u4FE1\u3057\u307E\u3059\u3002\u300CUpdate profile\u300D\u306F\u3001\u65B0\u3057\u3044\u500B\u4EBA\u60C5\u5831\u3092\u5165\u529B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u300CUpdate password\u300D\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u65B0\u3057\u3044\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u300CConfigure OTP\u300D\u306F\u3001\u30E2\u30D0\u30A4\u30EB\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30B8\u30A7\u30CD\u30EC\u30FC\u30BF\u30FC\u306E\u8A2D\u5B9A\u304C\u5FC5\u8981\u3067\u3059\u3002
requestObjectSignatureAlgorithmHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u300Crequest\u300D\u307E\u305F\u306F\u300Crequest_uri\u300D\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3067\u6307\u5B9A\u3055\u308C\u305FOIDC\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u9001\u4FE1\u3059\u308B\u969B\u306B\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u3001JWA\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u300Cany\u300D\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u4EFB\u610F\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\uFF08\u300Cnone\u300D\u3092\u542B\u3080\uFF09\u3067\u7F72\u540D\u3055\u308C\u307E\u3059\u3002
deleteEvents=\u30A4\u30D9\u30F3\u30C8\u306E\u30AF\u30EA\u30A2
includeOneTimeUseConditionHelp=OneTimeUse\u6761\u4EF6\u3092\u30ED\u30B0\u30A4\u30F3\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u542B\u3081\u308B\u3079\u304D\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
accessTokenLifespanHelp=\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u304C\u6709\u52B9\u671F\u9650\u5207\u308C\u3068\u306A\u308B\u6700\u5927\u6642\u9593\u3067\u3059\u3002\u3053\u306E\u5024\u306FSSO\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3068\u6BD4\u3079\u3066\u77ED\u304F\u3059\u308B\u3053\u3068\u3092\u304A\u52E7\u3081\u3057\u307E\u3059\u3002
redirectURIHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u8A2D\u5B9A\u3067\u4F7F\u7528\u3059\u308B\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8URI\u3067\u3059\u3002
resourcePath=\u30EA\u30BD\u30FC\u30B9\u30D1\u30B9
permissionsEnabled=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u6709\u52B9
attestationPreference.none=none
useJwksUrlHelp=\u6709\u52B9\u3068\u3057\u305F\u5834\u5408\u306F\u3001\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u516C\u958B\u9375\u304C\u6307\u5B9A\u3055\u308C\u305FJWKS URL\u304B\u3089\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u307E\u3059\u3002\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u65B0\u3057\u3044\u9375\u30DA\u30A2\u3092\u751F\u6210\u3059\u308B\u969B\u306B\u3001\u65B0\u3057\u3044\u9375\u304C\u5E38\u306B\u518D\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u308B\u305F\u3081\u3001\u67D4\u8EDF\u6027\u304C\u5927\u5E45\u306B\u5411\u4E0A\u3057\u307E\u3059\u3002\u7121\u52B9\u3068\u3057\u305F\u5834\u5408\u306F\u3001Keycloak DB\u306E\u516C\u958B\u9375\uFF08\u307E\u305F\u306F\u8A3C\u660E\u66F8\uFF09\u304C\u4F7F\u7528\u3055\u308C\u308B\u305F\u3081\u3001\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u9375\u30DA\u30A2\u304C\u5909\u66F4\u3055\u308C\u305F\u969B\u306B\u306F\u3001\u5E38\u306BKeycloak DB\u306B\u65B0\u3057\u3044\u9375\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
pairwiseSubAlgorithmSalt.label=\u30BD\u30EB\u30C8
revocation=\u7121\u52B9\u5316
scopeTypeHelp=\u4F5C\u6210\u3055\u308C\u305F\u5404\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u3068\u3057\u3066\u8FFD\u52A0\u3055\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7
useEntityDescriptor=\u30EA\u30E2\u30FC\u30C8IDP\u306ESAML\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u30FC\u304B\u3089\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
loginActionTimeout=\u30ED\u30B0\u30A4\u30F3\u30FB\u30A2\u30AF\u30B7\u30E7\u30F3\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
cacheSettings=\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A
validRedirectURIs=\u30ED\u30B0\u30A4\u30F3\u307E\u305F\u306F\u30ED\u30B0\u30A4\u30F3\u306E\u6210\u529F\u5F8C\u306B\u30D6\u30E9\u30A6\u30B6\u30FC\u304C\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u53EF\u80FD\u3068\u3059\u308B\u3001\u6709\u52B9\u306AURI\u30D1\u30BF\u30FC\u30F3\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u300Chttp\://example.com/*\u300D\u306E\u3088\u3046\u306A\u5358\u7D14\u306A\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u304C\u4F7F\u7528\u53EF\u80FD\u3067\u3059\u3002\u76F8\u5BFE\u30D1\u30B9\u3001\u3064\u307E\u308A\u300C/my/relative/path/*\u300D\u3082\u6307\u5B9A\u53EF\u80FD\u3067\u3059\u3002\u76F8\u5BFE\u30D1\u30B9\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30EB\u30FC\u30C8URL\u3092\u57FA\u6E96\u3068\u3057\u307E\u3059\u3002\u307E\u305F\u306F\u3001\u672A\u6307\u5B9A\u306E\u5834\u5408\u306F\u8A8D\u8A3C\u30B5\u30FC\u30D0\u30FC\u306E\u30EB\u30FC\u30C8URL\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002SAML\u3067\u306F\u3001\u30ED\u30B0\u30A4\u30F3\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u57CB\u3081\u8FBC\u307E\u308C\u305F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u306EURL\u306B\u4F9D\u5B58\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u6709\u52B9\u306AURI\u30D1\u30BF\u30FC\u30F3\u3092\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
removeImported=\u30A4\u30F3\u30DD\u30FC\u30C8\u3092\u524A\u9664
assertionConsumerServicePostBindingURL=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u306EPOST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL
endpoints=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8
validatingX509CertsHelp=\u7F72\u540D\u306E\u78BA\u8A8D\u306B\u4F7F\u7528\u3059\u308BPEM\u5F62\u5F0F\u306E\u8A3C\u660E\u66F8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
importFile=\u30D5\u30A1\u30A4\u30EB\u3092\u30A4\u30F3\u30DD\u30FC\u30C8
protocolHelp=\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u3066\u3044\u308BSSO\u30D7\u30ED\u30C8\u30B3\u30EB\u8A2D\u5B9A\u304C\u3069\u308C\u304B
accessTokenSignatureAlgorithmHelp=\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306E\u7F72\u540D\u306B\u4F7F\u7528\u3055\u308C\u308BJWA\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
requestObjectRequired=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u5FC5\u8981
prompts.none=none
resourcesHelp=\u3053\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u9069\u7528\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
passwordConfirmation=\u65B0\u3057\u3044\u30D1\u30B9\u30EF\u30FC\u30C9\uFF08\u78BA\u8A8D\uFF09
emailVerified=E\u30E1\u30FC\u30EB\u304C\u78BA\u8A8D\u6E08\u307F
aggregate.attrs.tooltip=\u5C5E\u6027\u5024\u3092\u30B0\u30EB\u30FC\u30D7\u5C5E\u6027\u3068\u96C6\u7D04\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002OpenID Connect\u30DE\u30C3\u30D1\u30FC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3059\u3079\u3066\u306E\u5024\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u30DE\u30EB\u30C1\u30D0\u30EA\u30E5\u30FC\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3082\u6709\u52B9\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u91CD\u8907\u3057\u305F\u5024\u306F\u7834\u68C4\u3055\u308C\u3001\u5024\u306E\u9806\u5E8F\u306F\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u306F\u4FDD\u8A3C\u3055\u308C\u307E\u305B\u3093\u3002
Thursday=\u6728
requestObjectRequiredHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u8A8D\u53EF\u30EA\u30AF\u30A8\u30B9\u30C8\u3068\u3068\u3082\u306B\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u63D0\u4F9B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3001\u304A\u3088\u3073\u305D\u306E\u305F\u3081\u306B\u3069\u306E\u65B9\u6CD5\u3092\u4F7F\u7528\u3067\u304D\u308B\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u300Cnot required\u300D\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u63D0\u4F9B\u306F\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u3059\u3002\u305D\u308C\u4EE5\u5916\u306E\u30B1\u30FC\u30B9\u3067\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u63D0\u4F9B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u300Crequest\u300D\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u5024\u3067\u63D0\u4F9B\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u300Crequest_uri\u300D\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u53C2\u7167\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u300Crequest\u307E\u305F\u306Frequest_uri\u300D\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u3044\u305A\u308C\u306E\u65B9\u6CD5\u3082\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
discoveryEndpoint=\u30EA\u30E2\u30FC\u30C8IDP\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u30FC\u3088\u308A\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3057\u307E\u3059\u3002
countHelp=\u3053\u306E\u30C8\u30FC\u30AF\u30F3\u3092\u5229\u7528\u3057\u3066\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u3044\u304F\u3064\u4F5C\u6210\u53EF\u80FD\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002
otpPolicyPeriod=OTP\u30C8\u30FC\u30AF\u30F3\u306E\u671F\u9593
Monday=\u6708
frontendUrlHelp=\u30EC\u30EB\u30E0\u306E\u30D5\u30ED\u30F3\u30C8\u30A8\u30F3\u30C9URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30DB\u30B9\u30C8\u540D\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3068\u7D44\u307F\u5408\u308F\u305B\u3066\u4F7F\u7528\u3057\u3001\u7279\u5B9A\u306E\u30EC\u30EB\u30E0\u306E\u30D5\u30ED\u30F3\u30C8\u30A8\u30F3\u30C9\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u30D9\u30FC\u30B9URL\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002
cachePolicy=\u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30DD\u30EA\u30B7\u30FC
consentRequired=\u6709\u52B9\u306E\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30A2\u30AF\u30BB\u30B9\u306B\u540C\u610F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
selectMethodType.import=\u30A4\u30F3\u30DD\u30FC\u30C8
standardFlow=OpenID Connect\u306E\u6A19\u6E96\u7684\u306A\u3001\u8A8D\u53EF\u30B3\u30FC\u30C9\u306B\u3088\u308B\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u30FB\u30D9\u30FC\u30B9\u306E\u8A8D\u8A3C\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002OpenID Connect\u307E\u305F\u306FOAuth2\u306E\u4ED5\u69D8\u306B\u304A\u3051\u308B\u300C\u8A8D\u53EF\u30B3\u30FC\u30C9\u30D5\u30ED\u30FC\u300D\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
eventListeners=\u30A4\u30D9\u30F3\u30C8\u30EA\u30B9\u30CA\u30FC
clientScopeType.default=DEFAULT
bindDn=\u30D0\u30A4\u30F3\u30C9DN
Friday=\u91D1
wantAuthnRequestsSigned=AuthnRequest\u306E\u7F72\u540D\u304C\u5FC5\u8981
usermodel.attr.tooltip=\u683C\u7D0D\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D\u3001UserMode.attribute\u30DE\u30C3\u30D7\u5185\u306E\u5C5E\u6027\u540D\u3067\u3059\u3002
fineGrainOpenIdConnectConfiguration=OpenID Connect\u306E\u8A73\u7D30\u8A2D\u5B9A
count=\u30AB\u30A6\u30F3\u30C8
testAuthentication=\u8A8D\u8A3C\u30C6\u30B9\u30C8
month=\u6708
addressClaim.region.tooltip=\u300Caddress\u300D\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u5185\u306E\u300Cregion\u300D\u30B5\u30D6\u30AF\u30EC\u30FC\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Cregion\u300D\u3067\u3059\u3002
expiration=\u6709\u52B9\u671F\u9650
logoutServicePostBindingURL=\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306EPOST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL
assertionConsumerServicePostBindingURLHelp=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\uFF08\u30ED\u30B0\u30A4\u30F3\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9\uFF09\u306ESAML POST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u306EBinding\u306E\u305F\u3081\u306EURL\u304C\u306A\u3044\u5834\u5408\u306F\u7A7A\u3067\u3088\u3044\u3067\u3059\u3002
resourceTypes=\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7
includeInUserInfo.label=UserInfo\u306B\u8FFD\u52A0
back=\u623B\u308B
validateSignatureHelp=\u5916\u90E8IDP\u306E\u7F72\u540D\u691C\u8A3C\u306E\u6709\u52B9/\u7121\u52B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
title=\u8A8D\u8A3C
verifyEmail=E\u30E1\u30FC\u30EB\u306E\u78BA\u8A8D
addressClaim.locality.label=\u5E02\u533A\u753A\u6751\u306E\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D
formatOption=\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3
nodeReRegistrationTimeout=\u30CE\u30FC\u30C9\u518D\u767B\u9332\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
client=client
connectionURL=\u63A5\u7D9AURL
accessTokenLifespan=\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u751F\u5B58\u671F\u9593
loginWithEmailHelpText=\u30E6\u30FC\u30B6\u30FC\u304CE\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u3067\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
setToNow=\u73FE\u5728\u65E5\u6642\u3092\u8A2D\u5B9A
firstBrokerLoginFlowAliasHelp=\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3067\u306E\u521D\u56DE\u30ED\u30B0\u30A4\u30F3\u5F8C\u306B\u8D77\u52D5\u3055\u305B\u308B\u8A8D\u8A3C\u30D5\u30ED\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3067\u3059\u3002\u300C\u521D\u56DE\u30ED\u30B0\u30A4\u30F3\u300D\u3068\u3044\u3046\u7528\u8A9E\u306F\u3001\u8A8D\u8A3C\u3057\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30FB\u30A2\u30AB\u30A6\u30F3\u30C8\u306B\u73FE\u5728\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308BKeycloak\u30A2\u30AB\u30A6\u30F3\u30C8\u304C\u306A\u3044\u72B6\u614B\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
owner=\u30AA\u30FC\u30CA\u30FC
implicitFlow=OpenID Connect\u306E\u8A8D\u53EF\u30B3\u30FC\u30C9\u306A\u3057\u306E\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u30FB\u30D9\u30FC\u30B9\u8A8D\u8A3C\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002OpenID Connect\u307E\u305F\u306FOAuth2\u306E\u4ED5\u69D8\u306B\u304A\u3051\u308B\u300C\u30A4\u30F3\u30D7\u30EA\u30B7\u30C3\u30C8\u30FB\u30D5\u30ED\u30FC\u300D\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
encryptAssertions=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u6697\u53F7\u5316\u3059\u308B
keyAliasHelp=\u79D8\u5BC6\u9375\u3068\u8A3C\u660E\u66F8\u306E\u30A2\u30FC\u30AB\u30A4\u30D6\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u3067\u3059\u3002
tokenClaimName.tooltip=\u30C8\u30FC\u30AF\u30F3\u5185\u306B\u633F\u5165\u3059\u308B\u30AF\u30EC\u30FC\u30E0\u306E\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u300Caddress.street\u300D\u306E\u3088\u3046\u306B\u5B8C\u5168\u4FEE\u98FE\u540D\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u30CD\u30B9\u30C8\u3055\u308C\u305FJSON\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30CD\u30B9\u30C6\u30A3\u30F3\u30B0\u3092\u9632\u304E\u3001\u30C9\u30C3\u30C8\u3092\u6587\u5B57\u901A\u308A\u306B\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001\u30C9\u30C3\u30C8\u3092\u30D0\u30C3\u30AF\u30B9\u30E9\u30C3\u30B7\u30E5\uFF08\\.\uFF09\u3067\u30A8\u30B9\u30B1\u30FC\u30D7\u3057\u307E\u3059\u3002
userName=\u30E6\u30FC\u30B6\u30FC\u540D
clientProfileDescription=\u8AAC\u660E
clientScope.default=DEFAULT
ssoSessionMax=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u307E\u3067\u306E\u6700\u5927\u6642\u9593\u3067\u3059\u3002\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u3068\u3001\u30C8\u30FC\u30AF\u30F3\u3068\u30D6\u30E9\u30A6\u30B6\u30FC\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u306F\u7121\u52B9\u5316\u3055\u308C\u307E\u3059\u3002
optimizeLookup=REDIRECT\u7F72\u540D\u9375\u691C\u7D22\u306E\u6700\u9069\u5316
browserFlowHelp=\u30D6\u30E9\u30A6\u30B6\u30FC\u8A8D\u8A3C\u3067\u4F7F\u7528\u3057\u305F\u3044\u30D5\u30ED\u30FC\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
temporaryLocked=\u30E6\u30FC\u30B6\u30FC\u306F\u3001\u30ED\u30B0\u30A4\u30F3\u306B\u8907\u6570\u56DE\u5931\u6557\u3057\u305F\u305F\u3081\u3001\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
setup=\u30BB\u30C3\u30C8\u30A2\u30C3\u30D7
realm=\u30EC\u30EB\u30E0
prompt=\u30D7\u30ED\u30F3\u30D7\u30C8\uFF08prompt\uFF09
showAuthData=\u8A8D\u53EF\u30C7\u30FC\u30BF\u3092\u8868\u793A
includeInUserInfo.tooltip=\u30AF\u30EC\u30FC\u30E0\u3092UserInfo\u306B\u8FFD\u52A0\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
unlinkUsers=\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30F3\u30AF\u3092\u89E3\u9664\u3059\u308B
initialCounter=\u521D\u671F\u30AB\u30A6\u30F3\u30BF\u30FC
revokeRefreshTokenHelp=\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u306F\u300C\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u306E\u6700\u5927\u518D\u5229\u7528\u56DE\u6570\u300D\u307E\u3067\u3057\u304B\u4F7F\u7528\u3067\u304D\u305A\u3001\u5225\u306E\u30C8\u30FC\u30AF\u30F3\u304C\u4F7F\u7528\u3055\u308C\u308B\u3068\u7121\u52B9\u5316\u3055\u308C\u307E\u3059\u3002\u7121\u52B9\u306B\u3059\u308B\u3068\u3001\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u306F\u4F7F\u7528\u5F8C\u306B\u7121\u52B9\u5316\u3055\u308C\u305A\u3001\u8907\u6570\u56DE\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
ownerManagedAccessHelp=\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u30EA\u30BD\u30FC\u30B9\u30AA\u30FC\u30CA\u30FC\u304C\u7BA1\u7406\u3067\u304D\u307E\u3059\u3002
authorization=\u304D\u3081\u7D30\u304B\u3044\u8A8D\u53EF\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9/\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
scopePermissions.users.map-roles-description=\u7BA1\u7406\u8005\u304C\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u306E\u30ED\u30FC\u30EB\u3092\u30DE\u30C3\u30D7\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
bindCredentialsHelp=LDAP\u7BA1\u7406\u8005\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3001\u30DC\u30FC\u30EB\u30C8\u304B\u3089\u5024\u3092\u53D6\u5F97\u3067\u304D\u307E\u3059\u3002${vault.ID}\u5F62\u5F0F\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
webAuthnPolicySignatureAlgorithms=\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
action=\u30A2\u30AF\u30B7\u30E7\u30F3
id=ID
join=\u53C2\u52A0
idTokenEncryptionContentEncryptionAlgorithmHelp=ID\u30C8\u30FC\u30AF\u30F3\u306E\u6697\u53F7\u5316\u306E\u969B\u306B\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308BJWA\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u3001\u6697\u53F7\u5316\u3055\u308C\u305FID\u30C8\u30FC\u30AF\u30F3\u304C\u5FC5\u8981\u306A\u5834\u5408\u306B\u306E\u307F\u5FC5\u9808\u3067\u3059\u3002\u7A7A\u306E\u307E\u307E\u306B\u3059\u308B\u3068\u3001ID\u30C8\u30FC\u30AF\u30F3\u306F\u7F72\u540D\u3055\u308C\u307E\u3059\u304C\u3001\u6697\u53F7\u5316\u3055\u308C\u307E\u305B\u3093\u3002
scopesHelp=\u8A8D\u53EF\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u969B\u306B\u9001\u4FE1\u3055\u308C\u308B\u30B9\u30B3\u30FC\u30D7\u3067\u3059\u3002\u30B9\u30DA\u30FC\u30B9\u533A\u5207\u308A\u3067\u30B9\u30B3\u30FC\u30D7\u306E\u30EA\u30B9\u30C8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Copenid\u300D\u3067\u3059\u3002
includeAuthnStatement=AuthnStatement\u3092\u542B\u3081\u308B
multivalued.tooltip=\u5C5E\u6027\u304C\u30DE\u30EB\u30C1\u30D0\u30EA\u30E5\u30FC\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u5C5E\u6027\u306E\u3059\u3079\u3066\u306E\u5024\u30EA\u30B9\u30C8\u304C\u30AF\u30EC\u30FC\u30E0\u3068\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u6700\u521D\u306E\u5024\u3060\u3051\u304C\u30AF\u30EC\u30FC\u30E0\u3068\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
addIdPMapper=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30FB\u30DE\u30C3\u30D1\u30FC\u3092\u8FFD\u52A0
enableStartTls=StartTLS\u306E\u6709\u52B9
usersPermissionsHint=\u30EC\u30EB\u30E0\u5185\u306E\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u7BA1\u7406\u3059\u308B\u304D\u3081\u7D30\u304B\u3044\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3002\u30EC\u30EB\u30E0\u5185\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u7BA1\u7406\u3067\u304D\u308B\u30E6\u30FC\u30B6\u30FC\u306B\u306F\u3001\u3055\u307E\u3056\u307E\u306A\u30DD\u30EA\u30B7\u30FC\u3092\u5B9A\u7FA9\u3067\u304D\u307E\u3059\u3002
homeURL=\u8A8D\u8A3C\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3078\u306E\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u307E\u305F\u306F\u623B\u308B\u30EA\u30F3\u30AF\u3092\u5FC5\u8981\u3068\u3059\u308B\u969B\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
contentSecurityPolicyReportOnly=Content-Security-Policy-Report-Only
firstBrokerLoginFlowAlias=\u521D\u56DE\u30ED\u30B0\u30A4\u30F3\u30D5\u30ED\u30FC
clientScopeList=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7
usernameLdapAttribute=\u30E6\u30FC\u30B6\u30FC\u540D\u306ELDAP\u5C5E\u6027
evaluate=\u8A55\u4FA1
status=\u30B9\u30C6\u30FC\u30BF\u30B9
clients=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8
clientName=\u540D\u524D
syncModes.force=\u5F37\u5236
maxDeltaTimeSeconds=\u30ED\u30B0\u30A4\u30F3\u5931\u6557\u56DE\u6570\u306E\u30EA\u30BB\u30C3\u30C8\u6642\u9593
backchannelLogoutHelp=\u5916\u90E8IDP\u304C\u30D0\u30C3\u30AF\u30C1\u30E3\u30F3\u30CD\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
usermodel.realmRoleMapping.rolePrefix.tooltip=\u5404\u30EC\u30EB\u30E0\u30ED\u30FC\u30EB\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\uFF08\u30AA\u30D7\u30B7\u30E7\u30F3\uFF09\u3002
fromDisplayName=\u5DEE\u51FA\u4EBA\u306E\u8868\u793A\u540D
affirmative=Affirmative
maxFailureWaitSecondsHelp=\u30E6\u30FC\u30B6\u30FC\u304C\u30ED\u30C3\u30AF\u30A2\u30A6\u30C8\u3055\u308C\u308B\u6700\u5927\u5F85\u6A5F\u6642\u9593\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
userInfoSignedResponseAlgorithm=\u7F72\u540D\u4ED8\u304DUserInfo\u30EC\u30B9\u30DD\u30F3\u30B9\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
maxDeltaTimeSecondsHelp=\u3044\u3064\u5931\u6557\u56DE\u6570\u304C\u30EA\u30BB\u30C3\u30C8\u3055\u308C\u308B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
contentSecurityPolicy=Content-Security-Policy
off=\u30AA\u30D5
frontchannelLogoutHelp=\u6709\u52B9\u306E\u5834\u5408\u306F\u3001\u30ED\u30B0\u30A2\u30A6\u30C8\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3078\u306E\u30D6\u30E9\u30A6\u30B6\u30FC\u30FB\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u304C\u5FC5\u8981\u306B\u306A\u308A\u307E\u3059\u3002\u7121\u52B9\u306E\u5834\u5408\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u30ED\u30B0\u30A2\u30A6\u30C8\u306E\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u547C\u3073\u51FA\u3057\u3092\u884C\u3044\u307E\u3059\u3002
forwardParameters=\u8EE2\u9001\u3055\u308C\u308B\u30AF\u30A8\u30EA\u30FC\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
oAuthMutualHelp=\u3053\u308C\u306B\u3088\u308A\u3001OAuth 2.0\u76F8\u4E92TLS\u8A3C\u660E\u66F8\u30D0\u30A4\u30F3\u30C9\u30FB\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002\u3064\u307E\u308A\u3001Keycloak\u306F\u3001Keycloak\u306E\u30C8\u30FC\u30AF\u30F3\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3068\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u9593\u3067\u76F8\u4E92TLS\u306B\u3088\u308A\u4EA4\u63DB\u3055\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306EX.509\u8A3C\u660E\u66F8\u3068\u3001\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u304A\u3088\u3073\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u30FB\u30C8\u30FC\u30AF\u30F3\u3092\u30D0\u30A4\u30F3\u30C9\u3057\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30C8\u30FC\u30AF\u30F3\u306F\u3001\u30D9\u30A2\u30E9\u30FC\u30C8\u30FC\u30AF\u30F3\u306E\u4EE3\u308F\u308A\u306BHolder-of-Key\u30C8\u30FC\u30AF\u30F3\u3068\u3057\u3066\u6271\u3046\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
scopes=\u30B9\u30B3\u30FC\u30D7
principalType=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30FB\u30BF\u30A4\u30D7
flowType=\u30D5\u30ED\u30FC\u30BF\u30A4\u30D7
policyEnforcementModes.PERMISSIVE=\u8A31\u5BB9
auth=\u8A8D\u8A3C
accessTokenLifespanImplicitFlow=\u30A4\u30F3\u30D7\u30EA\u30B7\u30C3\u30C8\u30FB\u30D5\u30ED\u30FC\u306B\u304A\u3051\u308B\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u751F\u5B58\u671F\u9593
subject=\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8DN
defaultAdminInitiated=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u7BA1\u7406\u8005\u8D77\u52D5\u30A2\u30AF\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9593
remainingCount=\u6B8B\u308A\u306E\u30AB\u30A6\u30F3\u30C8
download=\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9
authScopes=\u8A8D\u53EF\u30B9\u30B3\u30FC\u30D7
host=\u30DB\u30B9\u30C8
optimizeLookupHelp=Keycloak\u30A2\u30C0\u30D7\u30BF\u30FC\u306B\u3088\u3063\u3066\u4FDD\u8B77\u3055\u308C\u305FSP\u306EREDIRECT\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3067SAML\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306B\u7F72\u540D\u3059\u308B\u969B\u3001\u7F72\u540D\u9375\u306EID\u3092<Extensions>\u8981\u7D20\u306ESAML\u30D7\u30ED\u30C8\u30B3\u30EB\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u542B\u3081\u308B\u5FC5\u8981\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u691C\u8A3C\u306E\u305F\u3081\u306B\u65E2\u77E5\u306E\u3059\u3079\u3066\u306E\u30AD\u30FC\u3092\u8A66\u884C\u3059\u308B\u4EE3\u308F\u308A\u306B\u5358\u4E00\u306E\u30AD\u30FC\u3092\u4F7F\u7528\u3059\u308B\u305F\u3081\u3001\u7F72\u540D\u306E\u691C\u8A3C\u304C\u6700\u9069\u5316\u3055\u308C\u307E\u3059\u3002
supportedApplications=\u73FE\u5728\u306EOTP\u30DD\u30EA\u30B7\u30FC\u3067\u52D5\u4F5C\u3059\u308B\u3053\u3068\u304C\u5206\u304B\u3063\u3066\u3044\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
resourceAttribute=\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u5C5E\u6027\u3002
addressClaim.region.label=\u90FD\u9053\u5E9C\u770C\u306E\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D
ipAddress=IP\u30A2\u30C9\u30EC\u30B9
included.custom.audience.tooltip=\u3053\u308C\u306F\u300C\u542B\u307E\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u300D\u304C\u5165\u529B\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306B\u306E\u307F\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u6307\u5B9A\u3055\u308C\u305F\u5024\u304C\u3001\u30C8\u30FC\u30AF\u30F3\u306E\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\uFF08aud\uFF09\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u542B\u307E\u308C\u307E\u3059\u3002\u30C8\u30FC\u30AF\u30F3\u306B\u65E2\u5B58\u306E\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u304C\u5B58\u5728\u3059\u308B\u5834\u5408\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F\u5024\u304C\u5358\u306B\u305D\u308C\u3089\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002\u65E2\u5B58\u306E\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u3092\u4E0A\u66F8\u304D\u3059\u308B\u3053\u3068\u306F\u3042\u308A\u307E\u305B\u3093\u3002
includeInIdToken.label=ID\u30C8\u30FC\u30AF\u30F3\u306B\u8FFD\u52A0
browserFlow=\u30D6\u30E9\u30A6\u30B6\u30FC\u30D5\u30ED\u30FC
anyScope=\u4EFB\u610F\u306E\u30B9\u30B3\u30FC\u30D7
serverInfo=\u30B5\u30FC\u30D0\u30FC\u60C5\u5831
emailThemeHelp=\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u9001\u4FE1\u3055\u308C\u308BE\u30E1\u30FC\u30EB\u306E\u30C6\u30FC\u30DE\u3092\u9078\u629E\u3057\u307E\u3059\u3002
principalTypeHelp=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u304B\u3089\u5916\u90E8\u30E6\u30FC\u30B6\u30FC\u3092\u8B58\u5225\u3057\u3001\u8FFD\u8DE1\u3059\u308B\u65B9\u6CD5\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306FSubject NameID\u3092\u4F7F\u7528\u3057\u307E\u3059\u304C\u3001\u8B58\u5225\u5C5E\u6027\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002
Wednesday=\u6C34
consents=\u540C\u610F
canonicalization=\u6B63\u898F\u5316\u65B9\u5F0F
SSOSessionMax=SSO\u30BB\u30C3\u30B7\u30E7\u30F3\u6700\u5927
minimumQuickLoginWaitSecondsHelp=\u30AF\u30A4\u30C3\u30AF\u30ED\u30B0\u30A4\u30F3\u5931\u6557\u5F8C\u306B\u3069\u308C\u304F\u3089\u3044\u306E\u6642\u9593\u5F85\u6A5F\u3059\u308B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
policyEnforcementModes.DISABLED=\u7121\u52B9
code=\u30B3\u30FC\u30C9
allowedClockSkewHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30C8\u30FC\u30AF\u30F3\u306E\u691C\u8A3C\u6642\u306B\u8A31\u5BB9\u3055\u308C\u308B\u30AF\u30ED\u30C3\u30AF\u30B9\u30AD\u30E5\u30FC\uFF08\u79D2\u5358\u4F4D\uFF09\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F0\u3067\u3059\u3002
keys=\u9375
defaultSigAlg=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
signatureKeyName=SAML\u7F72\u540D\u9375\u540D
certificate=\u8A3C\u660E\u66F8
selectRole.label=\u30ED\u30FC\u30EB\u306E\u9078\u629E
prompts.consent=consent
webAuthnPolicyRpEntityName=\u30EA\u30E9\u30A4\u30F3\u30B0\u30FB\u30D1\u30FC\u30C6\u30A3\u30FC\u30FB\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u540D
hour=\u6642
connectionTimeoutHelp=LDAP\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\uFF08\u30DF\u30EA\u79D2\u5358\u4F4D\uFF09
defaultSigAlgHelp=\u3053\u306E\u30EC\u30EB\u30E0\u3067\u30C8\u30FC\u30AF\u30F3\u306E\u7F72\u540D\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
save-admin-events=\u6709\u52B9\u306E\u5834\u5408\u306F\u3001\u7BA1\u7406\u30A4\u30D9\u30F3\u30C8\u304C\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u4FDD\u5B58\u3055\u308C\u3001\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3067\u4F7F\u7528\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002
policyGroups=\u3069\u306E\u30E6\u30FC\u30B6\u30FC\u304C\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u3067\u8A31\u53EF\u3055\u308C\u308B\u304B\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
forwardParametersHelp=\u6700\u521D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3078\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u304B\u3089\u53D6\u5F97\u3057\u3001\u5916\u90E8IDP\u306E\u8A8D\u53EF\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3078\u8EE2\u9001\u3055\u308C\u308BOpenID Connect/OAuth\u6A19\u6E96\u4EE5\u5916\u306E\u30AF\u30A8\u30EA\u30FC\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3002\u8907\u6570\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u30AB\u30F3\u30DE\uFF08,\uFF09\u3067\u533A\u5207\u3063\u3066\u5165\u529B\u3067\u304D\u307E\u3059\u3002
on=\u30AA\u30F3
webAuthnPolicyRpId=\u30EA\u30E9\u30A4\u30F3\u30B0\u30FB\u30D1\u30FC\u30C6\u30A3\u30FC\u30FB\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30FCID
serviceAccount=\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092Keycloak\u3067\u8A8D\u8A3C\u3057\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5C02\u7528\u306E\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306E\u53D6\u5F97\u304C\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002OAuth2\u306E\u4ED5\u69D8\u306B\u304A\u3051\u308B\u300C\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30FB\u30B0\u30E9\u30F3\u30C8\u300D\u306E\u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
assertionConsumerServiceRedirectBindingURL=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u306ERedirect\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL
acceptsPromptNone=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304B\u3089\u8EE2\u9001\u3055\u308C\u308Bprompt\=none\u3092\u53D7\u3051\u5165\u308C\u308B
loginThemeHelp=\u30ED\u30B0\u30A4\u30F3\u3001OTP\u3001\u30B0\u30E9\u30F3\u30C8\u3001\u767B\u9332\u3001\u304A\u3088\u3073\u30D1\u30B9\u30EF\u30FC\u30C9\u5FD8\u308C\u306B\u4F7F\u7528\u3059\u308B\u30DA\u30FC\u30B8\u306E\u30C6\u30FC\u30DE\u3092\u9078\u629E\u3057\u307E\u3059\u3002
userManagedAccess=User-Managed Access
excludeSessionStateFromAuthenticationResponseHelp=\u3053\u308C\u304C\u30AA\u30F3\u306E\u5834\u5408\u3001\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u300Csession_state\u300D\u306FOpenID Connect\u8A8D\u8A3C\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u542B\u307E\u308C\u307E\u305B\u3093\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u300Csession_state\u300D\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u306A\u3044\u53E4\u3044OIDC / OAuth2\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306B\u4FBF\u5229\u3067\u3059\u3002
initialAccessToken=\u521D\u671F\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3
evictionDay=\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u306E\u65E5
vendorHelp=LDAP\u30D9\u30F3\u30C0\u30FC\uFF08\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\uFF09
addressClaim.country.label=\u56FD\u306E\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u540D
clustering=\u30AF\u30E9\u30B9\u30BF\u30EA\u30F3\u30B0
applyToResourceType=\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7\u306B\u9069\u7528
selectRole.tooltip=\u5DE6\u5074\u306B\u3042\u308B\u30C6\u30AD\u30B9\u30C8\u30DC\u30C3\u30AF\u30B9\u306B\u30ED\u30FC\u30EB\u3092\u5165\u529B\u3059\u308B\u304B\u3001\u30D6\u30E9\u30A6\u30BA\u3057\u3066\u5FC5\u8981\u306A\u30ED\u30FC\u30EB\u3092\u9078\u629E\u3059\u308B\u305F\u3081\u306B\u3053\u306E\u30DC\u30BF\u30F3\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
setPassword=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u8A2D\u5B9A
editModeLdapHelp=READ_ONLY\u306E\u5834\u5408\u3001LDAP\u30B9\u30C8\u30A2\u306B\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u30A2\u30AF\u30BB\u30B9\u3057\u307E\u3059\u3002WRITABLE\u306F\u3001\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u30C7\u30FC\u30BF\u3092LDAP\u306B\u540C\u671F\u3055\u305B\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002UNSYNCED\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u30C7\u30FC\u30BF\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u304C\u3001LDAP\u306B\u540C\u671F\u3057\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
SSOSessionMaxRememberMe=SSO\u30BB\u30C3\u30B7\u30E7\u30F3\u6700\u5927\u30EA\u30E1\u30F3\u30D0\u30FC\u30DF\u30FC
Saturday=\u571F
save-user-events=\u6709\u52B9\u306E\u5834\u5408\u306F\u3001\u30ED\u30B0\u30A4\u30F3\u30A4\u30D9\u30F3\u30C8\u304C\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u4FDD\u5B58\u3055\u308C\u3001\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3068\u30A2\u30AB\u30A6\u30F3\u30C8\u7BA1\u7406\u3067\u4F7F\u7528\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
composite=\u8907\u5408
hourHelp=\u30DD\u30EA\u30B7\u30FC\u304C\u8A31\u53EF\u3055\u308C\u308B\u6642\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u30022\u756A\u76EE\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u5024\u3092\u5165\u529B\u3057\u3066\u7BC4\u56F2\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u73FE\u5728\u306E\u6642\u304C\u6307\u5B9A\u3057\u305F2\u3064\u306E\u5024\u306E\u9593\u306B\u3042\u308B\u304B\u3001\u7B49\u3057\u3044\u5834\u5408\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
generatedAccessToken=\u751F\u6210\u3055\u308C\u305F\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3
executeActions=\u30A2\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C
edit=\u7DE8\u96C6
testConnection=\u63A5\u7D9A\u30C6\u30B9\u30C8
archiveFormat=\u30A2\u30FC\u30AB\u30A4\u30D6\u5F62\u5F0F
associatedRolesText=\u95A2\u9023\u30ED\u30FC\u30EB
defaultLocale=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30ED\u30B1\u30FC\u30EB
clientIdHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3067\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8B58\u5225\u5B50\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
aggregate.attrs.label=\u5C5E\u6027\u5024\u306E\u96C6\u7D04
flow-type.basic-flow=generic
webauthnPasswordlessPolicy=WebAuthn\u30D1\u30B9\u30EF\u30FC\u30C9\u30EC\u30B9\u30FB\u30DD\u30EA\u30B7\u30FC
allowPasswordAuthenticationHelp=Kerberos\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u540D/\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u306E\u6709\u52B9/\u7121\u52B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
includeInAccessToken.tooltip=\u30AF\u30EC\u30FC\u30E0\u3092\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u306B\u8FFD\u52A0\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
includeOneTimeUseCondition=OneTimeUse\u6761\u4EF6\u3092\u542B\u3081\u308B
clientsClientScopesHelp=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u30B9\u30B3\u30FC\u30D7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
envelopeFromHelp=\u30D0\u30A6\u30F3\u30B9\u306B\u4F7F\u7528\u3055\u308C\u308BE\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\uFF08\u30AA\u30D7\u30B7\u30E7\u30F3\uFF09\u3002
masterSamlProcessingUrl=SAML\u3092\u51E6\u7406\u3059\u308B\u30DE\u30B9\u30BF\u30FCURL
samlIdentityProviderMetadata=SAML 2.0\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF
key=\u30AD\u30FC
email=E\u30E1\u30FC\u30EB
identityProviders=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
importUsers=\u30E6\u30FC\u30B6\u30FC\u306E\u30A4\u30F3\u30DD\u30FC\u30C8
scopeParameterHelp=\u3053\u306E\u30B9\u30B3\u30FC\u30D7\u30FB\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u5024\u3092\u30B3\u30D4\u30FC/\u30DA\u30FC\u30B9\u30C8\u3057\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30A2\u30C0\u30D7\u30BF\u30FC\u304B\u3089\u9001\u4FE1\u3055\u308C\u305F\u6700\u521D\u306EOpenID Connect\u8A8D\u8A3C\u30EA\u30AF\u30A8\u30B9\u30C8\u3067\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u767A\u884C\u3055\u308C\u305F\u30C8\u30FC\u30AF\u30F3\u3092\u751F\u6210\u3059\u308B\u3068\u304D\u306F\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u3068\u9078\u629E\u3055\u308C\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059
idTokenEncryptionKeyManagementAlgorithm=ID\u30C8\u30FC\u30AF\u30F3\u6697\u53F7\u5316\u9375\u7BA1\u7406\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
clientAuthentications.client_secret_basic=\u57FA\u672C\u8A8D\u8A3C\u3067\u9001\u4FE1\u3055\u308C\u305F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8
ssoSessionIdle=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u307E\u3067\u306E\u30A2\u30A4\u30C9\u30EB\u6642\u9593\u3067\u3059\u3002\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u308B\u3068\u3001\u30C8\u30FC\u30AF\u30F3\u3068\u30D6\u30E9\u30A6\u30B6\u30FC\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u306F\u7121\u52B9\u5316\u3055\u308C\u307E\u3059\u3002
userManagedAccessHelp=\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u30A2\u30AB\u30A6\u30F3\u30C8\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u4F7F\u7528\u3057\u3066\u30EA\u30BD\u30FC\u30B9\u3068\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u7BA1\u7406\u3067\u304D\u307E\u3059\u3002
policyType.totp=\u30BF\u30A4\u30E0\u30D9\u30FC\u30B9
emailTheme=E\u30E1\u30FC\u30EB\u30C6\u30FC\u30DE
scopePermissions.users.impersonate-description=\u7BA1\u7406\u8005\u304C\u4ED6\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u507D\u88C5\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
registerNodeManually=\u30CE\u30FC\u30C9\u3092\u624B\u52D5\u3067\u767B\u9332
redirectURI=\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8URI
publicKeys=\u516C\u958B\u9375
periodicFullSync=\u5B9A\u671F\u7684\u306A\u30D5\u30EB\u540C\u671F
assertionLifespanHelp=SAML\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u6761\u4EF6\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u6709\u52B9\u671F\u9650\u3002\u305D\u306E\u5F8C\u3001\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u300CSessionNotOnOrAfter\u300D\u5C5E\u6027\u306F\u5909\u66F4\u3055\u308C\u305A\u3001\u30EC\u30EB\u30E0\u30EC\u30D9\u30EB\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u300CSSO\u30BB\u30C3\u30B7\u30E7\u30F3\u6700\u5927\u300D\u6642\u9593\u3092\u5F15\u304D\u7D9A\u304D\u4F7F\u7528\u3057\u307E\u3059\u3002
createdAt=\u4F5C\u6210\u65E5
editUsername=\u30E6\u30FC\u30B6\u30FC\u540D\u306E\u7DE8\u96C6
lastRegistration=\u6700\u7D42\u767B\u9332
rolesHelp=\u9078\u629E\u3055\u308C\u305F\u30E6\u30FC\u30B6\u30FC\u306B\u95A2\u9023\u4ED8\u3051\u305F\u3044\u30ED\u30FC\u30EB\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
requireSsl=SSL\u306E\u8981\u6C42
samlEntityDescriptor=\u5916\u90E8IDP\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u3088\u308A\u30ED\u30FC\u30C9\u3001\u307E\u305F\u306FURL\u3088\u308A\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3057\u3066\u8A2D\u5B9A\u3057\u307E\u3059\u3002
reevaluate=\u518D\u8A55\u4FA1
syncMode=\u540C\u671F\u30E2\u30FC\u30C9
details=\u8A73\u7D30
strictTransportSecurity=HTTP Strict Transport Security\uFF08HSTS\uFF09
offlineSessionMaxLimited=\u30AA\u30D5\u30E9\u30A4\u30F3\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u6700\u5927\u5236\u9650
periodicChangedUsersSync=\u5B9A\u671F\u7684\u306A\u5909\u66F4\u30E6\u30FC\u30B6\u30FC\u306E\u540C\u671F
principalAttribute=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u5C5E\u6027
searchScope=\u691C\u7D22\u30B9\u30B3\u30FC\u30D7
userRegistrationHelpText=\u767B\u9332\u30DA\u30FC\u30B8\u306E\u6709\u52B9/\u7121\u52B9\u3002\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u306B\u767B\u9332\u306E\u30EA\u30F3\u30AF\u3082\u8868\u793A\u3055\u308C\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
realmRoles=\u30EC\u30EB\u30E0\u30ED\u30FC\u30EB
firstName=\u540D
expirationHelp=\u30A4\u30D9\u30F3\u30C8\u306E\u6709\u52B9\u671F\u9650\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u671F\u9650\u5207\u308C\u306E\u30A4\u30D9\u30F3\u30C8\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304B\u3089\u5B9A\u671F\u7684\u306B\u524A\u9664\u3055\u308C\u307E\u3059\u3002
webAuthnPolicySignatureAlgorithmsHelp=\u8A8D\u8A3C\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u306B\u4F7F\u7528\u3059\u308B\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
nameIdFormat=Name ID\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
validRedirectUri=\u6709\u52B9\u306A\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8URI
wantAssertionsEncryptedHelp=\u3053\u306E\u30B5\u30FC\u30D3\u30B9\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u6697\u53F7\u5316\u3055\u308C\u305F\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u671F\u5F85\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
permissionName=\u3053\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
expires=\u6709\u52B9\u671F\u9650
userAttribute=\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027
kid=Kid
revoke=\u7121\u52B9\u5316
webAuthnPolicyAcceptableAaguidsHelp=\u767B\u9332\u53EF\u80FD\u306A\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306EAAGUID\u306E\u30EA\u30B9\u30C8\u3002
clientSignatureHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304CSAML\u30EA\u30AF\u30A8\u30B9\u30C8\u3068\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u7F72\u540D\u3059\u308B\u304B\u3001\u305D\u3057\u3066\u305D\u308C\u3089\u3092\u691C\u8A3C\u3059\u3079\u304D\u3069\u3046\u304B\u304B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
keyPasswordHelp=\u30A2\u30FC\u30AB\u30A4\u30D6\u5185\u306E\u79D8\u5BC6\u9375\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u305F\u3081\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
frontchannelLogout=\u30D5\u30ED\u30F3\u30C8\u30C1\u30E3\u30F3\u30CD\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8
policyClient=\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u3067\u8A31\u53EF\u3055\u308C\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
titleRoles=\u30EC\u30EB\u30E0\u30ED\u30FC\u30EB
frontendUrl=\u30D5\u30ED\u30F3\u30C8\u30A8\u30F3\u30C9URL
sectorIdentifierUri.tooltip=pairwise sub\u5024\u3092\u4F7F\u7528\u3057\u3001\u304B\u3064\u52D5\u7684\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u767B\u9332\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u3001sector_identifier_uri\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u4F7F\u7528\u3059\u3079\u304D\u3067\u3059\uFF08SHOULD\uFF09\u3002\u3053\u308C\u306F\u3001\u5171\u901A\u306E\u7BA1\u7406\u4E0B\u306B\u3042\u308BWeb\u30B5\u30A4\u30C8\u7FA4\u306B\u5BFE\u3057\u3001\u500B\u3005\u306E\u30C9\u30E1\u30A4\u30F3\u540D\u3068\u306F\u72EC\u7ACB\u3057\u3066parwise sub\u5024\u306E\u4E00\u8CAB\u6027\u3092\u4FDD\u6301\u3059\u308B\u65B9\u6CD5\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002\u307E\u305F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u5BFE\u3057\u3001\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u518D\u767B\u9332\u3055\u305B\u308B\u3053\u3068\u306A\u3057\u306Bredirect_uri\u3092\u5909\u66F4\u3059\u308B\u65B9\u6CD5\u3082\u63D0\u4F9B\u3057\u307E\u3059\u3002
rdnLdapAttribute=RDN LDAP\u5C5E\u6027
replyToDisplayName=\u8FD4\u4FE1\u5148\u306E\u8868\u793A\u540D
xRobotsTag=X-Robots-Tag
bindType=\u30D0\u30A4\u30F3\u30C9\u30BF\u30A4\u30D7
aliasHelp=\u30A8\u30A4\u30EA\u30A2\u30B9\u306F\u4E00\u610F\u306B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8B58\u5225\u3059\u308B\u3082\u306E\u3067\u3001\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8URI\u306E\u69CB\u7BC9\u306B\u3082\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
contextualInfo=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u60C5\u5831
syncModeHelp=\u3059\u3079\u3066\u306E\u30DE\u30C3\u30D1\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u540C\u671F\u30E2\u30FC\u30C9\u3002\u540C\u671F\u30E2\u30FC\u30C9\u306F\u3001\u30DE\u30C3\u30D1\u30FC\u3092\u4F7F\u7528\u3057\u3066\u30E6\u30FC\u30B6\u30FC\u30C7\u30FC\u30BF\u3092\u540C\u671F\u3059\u308B\u30BF\u30A4\u30DF\u30F3\u30B0\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u53EF\u80FD\u306A\u5024\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u5C0E\u5165\u3055\u308C\u308B\u524D\u306E\u52D5\u4F5C\u3092\u7DAD\u6301\u3059\u308B\u300C\u30EC\u30AC\u30B7\u30FC\u300D\u3001\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u4F7F\u7528\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u306E\u521D\u56DE\u30ED\u30B0\u30A4\u30F3\u6642\u306B\u4E00\u5EA6\u3060\u3051\u30E6\u30FC\u30B6\u30FC\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u300C\u30A4\u30F3\u30DD\u30FC\u30C8\u300D\u3001\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3067\u30ED\u30B0\u30A4\u30F3\u3059\u308B\u305F\u3073\u306B\u30E6\u30FC\u30B6\u30FC\u3092\u5E38\u306B\u66F4\u65B0\u3059\u308B\u300C\u5F37\u5236\u300D\u3002
applyPolicyHelp=\u3053\u306E\u30DD\u30EA\u30B7\u30FC\u3084\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u30B9\u30B3\u30FC\u30D7\u306B\u9069\u7528\u3059\u308B\u3059\u3079\u3066\u306E\u30DD\u30EA\u30B7\u30FC\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
temporaryPassword=\u4E00\u6642\u7684
sslType.none=none
clientsPermissionsHint=\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u7BA1\u7406\u3057\u305F\u308A\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u305F\u30ED\u30FC\u30EB\u3092\u9069\u7528\u3057\u305F\u308A\u3059\u308B\u7BA1\u7406\u8005\u306E\u304D\u3081\u7D30\u304B\u3044\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3067\u3059\u3002
consentScreenText=\u540C\u610F\u753B\u9762\u306E\u30C6\u30AD\u30B9\u30C8
bruteForceDetection=\u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u306E\u691C\u51FA
archiveFormatHelp=Java\u30AD\u30FC\u30B9\u30C8\u30A2\u307E\u305F\u306FPKCS12\u30A2\u30FC\u30AB\u30A4\u30D6\u5F62\u5F0F
xContentTypeOptions=X-Content-Type-Options
keyAlias=\u30AD\u30FC\u30A8\u30A4\u30EA\u30A2\u30B9
prefix=\u5404\u30EC\u30EB\u30E0\u30ED\u30FC\u30EB\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\uFF08\u30AA\u30D7\u30B7\u30E7\u30F3\uFF09\u3002
none=none
type=\u30BF\u30A4\u30D7
seconds=\u79D2
otpPolicyDigits=\u6841\u6570
ownerManagedAccess=User-Managed Access\u306E\u6709\u52B9
permissions=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3
accountThemeHelp=\u30E6\u30FC\u30B6\u30FC\u30FB\u30A2\u30AB\u30A6\u30F3\u30C8\u7BA1\u7406\u753B\u9762\u306E\u30C6\u30FC\u30DE\u3092\u9078\u629E\u3057\u307E\u3059\u3002
displayOnConsentScreenHelp=\u30AA\u30F3\u3067\u3001\u540C\u610F\u304C\u5FC5\u8981\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u304C\u8FFD\u52A0\u3055\u308C\u305F\u5834\u5408\u3001\u300C\u540C\u610F\u753B\u9762\u306E\u30C6\u30AD\u30B9\u30C8\u300D\u3067\u6307\u5B9A\u3055\u308C\u305F\u30C6\u30AD\u30B9\u30C8\u304C\u540C\u610F\u753B\u9762\u306B\u8868\u793A\u3055\u308C\u307E\u3059\u3002\u30AA\u30D5\u306E\u5834\u5408\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306F\u540C\u610F\u753B\u9762\u306B\u8868\u793A\u3055\u308C\u307E\u305B\u3093
requirements.DISABLED=\u7121\u52B9
clientSessionIdle=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30A2\u30A4\u30C9\u30EB
push=\u30D7\u30C3\u30B7\u30E5
titleUsers=\u30E6\u30FC\u30B6\u30FC
scopePermissions.users.user-impersonated-description=\u3069\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u507D\u88C5\u3059\u308B\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u3002\u3053\u308C\u3089\u306E\u30DD\u30EA\u30B7\u30FC\u306F\u3001\u507D\u88C5\u3055\u308C\u3066\u3044\u308B\u30E6\u30FC\u30B6\u30FC\u306B\u9069\u7528\u3055\u308C\u307E\u3059\u3002
forceAuthenticationHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u4EE5\u524D\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30FB\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u983C\u308B\u306E\u3067\u306F\u306A\u304F\u3001\u30D7\u30EC\u30BC\u30F3\u30BF\u30FC\u3092\u76F4\u63A5\u8A8D\u8A3C\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
testClusterAvailability=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u53EF\u7528\u6027\u3092\u30C6\u30B9\u30C8
forceNameIdFormat=Name ID\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3092\u5F37\u5236
scopePermissions.users.manage-description=\u7BA1\u7406\u8005\u304C\u30EC\u30EB\u30E0\u5185\u306E\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u7BA1\u7406\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u30DD\u30EA\u30B7\u30FC
included.client.audience.tooltip=\u6307\u5B9A\u3055\u308C\u305F\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u30FB\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID\u304C\u3001\u30C8\u30FC\u30AF\u30F3\u306E\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\uFF08aud\uFF09\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u542B\u307E\u308C\u307E\u3059\u3002\u30C8\u30FC\u30AF\u30F3\u306B\u65E2\u5B58\u306E\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u304C\u5B58\u5728\u3059\u308B\u5834\u5408\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F\u5024\u304C\u5358\u306B\u305D\u308C\u3089\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002\u65E2\u5B58\u306E\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u3092\u4E0A\u66F8\u304D\u3059\u308B\u3053\u3068\u306F\u3042\u308A\u307E\u305B\u3093\u3002
addRole=\u30ED\u30FC\u30EB\u306E\u8FFD\u52A0
addressClaim.locality.tooltip=\u300Caddress\u300D\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u5185\u306E\u300Clocality\u300D\u30B5\u30D6\u30AF\u30EC\u30FC\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Clocality\u300D\u3067\u3059\u3002
keyForCodeExchangeHelp=PKCE\u306E\u3069\u306E\u30B3\u30FC\u30C9\u30C1\u30E3\u30EC\u30F3\u30B8\u65B9\u5F0F\u3092\u4F7F\u7528\u3059\u308B\u304B\u3092\u9078\u629E\u3057\u307E\u3059\u3002\u6307\u5B9A\u3057\u306A\u3044\u5834\u5408\u3001Keycloak\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u9069\u5207\u306A\u30B3\u30FC\u30C9\u30C1\u30E3\u30EC\u30F3\u30B8\u3068\u30B3\u30FC\u30C9\u4EA4\u63DB\u306E\u65B9\u5F0F\u3067\u8A8D\u53EF\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u9001\u4FE1\u3057\u306A\u3044\u9650\u308A\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306BPKCE\u3092\u9069\u7528\u3057\u307E\u305B\u3093\u3002
userInfoSignedResponseAlgorithmHelp=\u7F72\u540D\u4ED8\u304DUserInfo\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u4F7F\u7528\u3059\u308BJWA\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u300Cunsigned\u300D\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u3001UserInfo\u30EC\u30B9\u30DD\u30F3\u30B9\u306F\u7F72\u540D\u3055\u308C\u305A\u3001application/json\u5F62\u5F0F\u3067\u8FD4\u3055\u308C\u307E\u3059\u3002
lastName=\u59D3
otpPolicyDigitsHelp=OTP\u306E\u6841\u6570\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
clientAuthentications.client_secret_post=POST\u3067\u9001\u4FE1\u3055\u308C\u305F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8
authenticationAliasHelp=\u3053\u306E\u8A2D\u5B9A\u306E\u540D\u524D\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
SSOSessionIdle=SSO\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30A2\u30A4\u30C9\u30EB
ssoServiceUrlHelp=\u8A8D\u8A3C\u30EA\u30AF\u30A8\u30B9\u30C8\uFF08SAML AuthnRequest\uFF09\u306E\u9001\u4FE1\u306B\u4F7F\u7528\u3059\u308BURL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
copy=\u30B3\u30D4\u30FC
credentialData=\u30C7\u30FC\u30BF
connectionTimeout=\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
passLoginHintHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306Blogin_hint\u3092\u6E21\u3057\u307E\u3059\u3002
monthHelp=\u30DD\u30EA\u30B7\u30FC\u304C\u8A31\u53EF\u3055\u308C\u308B\u6708\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u30022\u756A\u76EE\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u5024\u3092\u5165\u529B\u3057\u3066\u7BC4\u56F2\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u73FE\u5728\u306E\u6708\u304C\u6307\u5B9A\u3057\u305F2\u3064\u306E\u5024\u306E\u9593\u306B\u3042\u308B\u304B\u3001\u7B49\u3057\u3044\u5834\u5408\u306E\u307F\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
webAuthnPolicyAvoidSameAuthenticatorRegisterHelp=\u3059\u3067\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306E\u767B\u9332\u3092\u907F\u3051\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
registrationAccessToken=\u767B\u9332\u7528\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3
supportedLocales=\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30ED\u30B1\u30FC\u30EB
showPasswordDataValue=\u5024
issuerHelp=\u30EC\u30B9\u30DD\u30F3\u30B9\u5185\u306E\u767A\u884C\u8005\u306E\u8B58\u5225\u5B50\uFF08Issuer Identifier\uFF09\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u672A\u8A2D\u5B9A\u306E\u5834\u5408\u306F\u3001\u691C\u8A3C\u306F\u5B9F\u884C\u3055\u308C\u307E\u305B\u3093\u3002
webAuthnPolicyAttestationConveyancePreference=\u671F\u5F85\u3059\u308B\u69CB\u6210\u8A3C\u660E\u4F1D\u9054
titleSessions=\u30BB\u30C3\u30B7\u30E7\u30F3
rootURL=\u76F8\u5BFEURL\u306B\u8FFD\u52A0\u3059\u308B\u30EB\u30FC\u30C8URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
evictionMinute=\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u306E\u5206
nodeReRegistrationTimeoutHelp=\u767B\u9332\u3055\u308C\u305F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u30AF\u30E9\u30B9\u30BF\u30FC\u30CE\u30FC\u30C9\u3078\u518D\u767B\u9332\u3059\u308B\u969B\u306E\u6700\u5927\u6642\u9593\u9593\u9694\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30AF\u30E9\u30B9\u30BF\u30FC\u30CE\u30FC\u30C9\u304C\u3053\u306E\u6642\u9593\u5185\u306BKeycloak\u306B\u518D\u767B\u9332\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u9001\u4FE1\u3057\u306A\u3044\u5834\u5408\u306F\u3001Keycloak\u304B\u3089\u767B\u9332\u89E3\u9664\u3055\u308C\u307E\u3059\u3002
logoutServicePostBindingURLHelp=\u30B7\u30F3\u30B0\u30EB\u30FB\u30ED\u30B0\u30A2\u30A6\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306ESAMLPOST\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u7570\u306A\u308BBinding\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u7A7A\u3067\u3088\u3044\u3067\u3059\u3002
clientAuthentication=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C
validatePasswordPolicy=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30DD\u30EA\u30B7\u30FC\u306E\u691C\u8A3C
registrationEmailAsUsername=E\u30E1\u30FC\u30EB\u3092\u30E6\u30FC\u30B6\u30FC\u540D\u3068\u3059\u308B
passCurrentLocale=\u73FE\u5728\u306E\u30ED\u30B1\u30FC\u30EB\u3092\u6E21\u3059
webAuthnPolicyFormHelp=WebAuthn\u8A8D\u8A3C\u306E\u30DD\u30EA\u30B7\u30FC\u3002\u3053\u308C\u306F\u3001\u300CWebAuthn Register\u300D\u5FC5\u9808\u30A2\u30AF\u30B7\u30E7\u30F3\u3068\u300CWebAuthn Authenticator\u300D\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u3067\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u4E00\u822C\u7684\u306A\u7528\u9014\u306F\u30012\u8981\u7D20\u8A8D\u8A3C\u306BWebAuthn\u3092\u4F7F\u7528\u3059\u308B\u5834\u5408\u3067\u3059\u3002
identityInformation=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u60C5\u5831
usermodel.clientRoleMapping.rolePrefix.label=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30ED\u30FC\u30EB\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9
syncModeOverrideHelp=\u3053\u306E\u30DE\u30C3\u30D1\u30FC\u306EIDP\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u540C\u671F\u30E2\u30FC\u30C9\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002\u5024\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u5C0E\u5165\u3055\u308C\u308B\u524D\u306E\u52D5\u4F5C\u3092\u7DAD\u6301\u3059\u308B\u300C\u30EC\u30AC\u30B7\u30FC\u300D\u3001\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u4F7F\u7528\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u306E\u521D\u56DE\u30ED\u30B0\u30A4\u30F3\u6642\u306B\u4E00\u5EA6\u3060\u3051\u30E6\u30FC\u30B6\u30FC\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u300C\u30A4\u30F3\u30DD\u30FC\u30C8\u300D\u3001\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3067\u30ED\u30B0\u30A4\u30F3\u3059\u308B\u305F\u3073\u306B\u30E6\u30FC\u30B6\u30FC\u3092\u5E38\u306B\u66F4\u65B0\u3059\u308B\u300C\u5F37\u5236\u300D\u3001\u3053\u306E\u30DE\u30C3\u30D1\u30FC\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u540C\u671F\u30E2\u30FC\u30C9\u3092\u4F7F\u7528\u3059\u308B\u300C\u7D99\u627F\u300D\u3002
partialImport=\u90E8\u5206\u30A4\u30F3\u30DD\u30FC\u30C8
includeInTokenScopeHelp=\u30AA\u30F3\u306E\u5834\u5408\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306E\u540D\u524D\u304C\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u300Cscope\u300D\u3068\u540C\u69D8\u306B\u30C8\u30FC\u30AF\u30F3\u30FB\u30A4\u30F3\u30C8\u30ED\u30B9\u30DA\u30AF\u30B7\u30E7\u30F3\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002\u30AA\u30D5\u306E\u5834\u5408\u3001\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30B3\u30FC\u30D7\u306F\u30C8\u30FC\u30AF\u30F3\u3068\u30C8\u30FC\u30AF\u30F3\u30FB\u30A4\u30F3\u30C8\u30ED\u30B9\u30DA\u30AF\u30B7\u30E7\u30F3\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u30EC\u30B9\u30DD\u30F3\u30B9\u304B\u3089\u9664\u5916\u3055\u308C\u307E\u3059\u3002
client-authenticator-type=Keycloak\u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8A8D\u8A3C\u306B\u4F7F\u7528\u3059\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C\u65B9\u5F0F\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
signatureKeyNameHelp=\u7F72\u540D\u3055\u308C\u305FSAML\u6587\u66F8\u306B\u306F\u3001KeyName\u8981\u7D20\u306E\u7F72\u540D\u9375\u306E\u8B58\u5225\u60C5\u5831\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002Keycloak / RH-SSO\u30AB\u30A6\u30F3\u30BF\u30FC\u30FB\u30D1\u30FC\u30C6\u30A3\u30FC\u306E\u5834\u5408\u306F\u3001KEY_ID\u3092\u4F7F\u7528\u3057\u3001MS AD FS\u306E\u5834\u5408\u306FCERT_SUBJECT\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u4ED6\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u52D5\u4F5C\u3057\u306A\u3044\u5834\u5408\u306FNONE\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u4F7F\u7528\u3057\u307E\u3059\u3002
clientAssertionSigningAlgHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C\u3067JWT\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u5229\u7528\u3059\u308B\u3068\u304D\u306E\u7F72\u540D\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C\u304C \u79D8\u5BC6\u9375\u3067\u7F72\u540D\u3055\u308C\u305FJWT \u3082\u3057\u304F\u306F JWT\u3067\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8 \u306E\u5834\u5408\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306E\u6307\u5B9A\u3092\u3057\u306A\u304B\u3063\u305F\u5834\u5408\u3001 \u79D8\u5BC6\u9375\u3067\u7F72\u540D\u3055\u308C\u305FJWT \u3067\u306FRS256 JWT\u3067\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8 \u3067\u306FHS256\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
loginWithEmail=E\u30E1\u30FC\u30EB\u3067\u30ED\u30B0\u30A4\u30F3
tokenClaimName.label=\u30C8\u30FC\u30AF\u30F3\u30AF\u30EC\u30FC\u30E0\u540D
create=\u4F5C\u6210
from=\u5DEE\u51FA\u4EBA
decisionStrategyHelp=\u6C7A\u5B9A\u6226\u7565\u306F\u3001\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u8A55\u4FA1\u65B9\u6CD5\u3068\u6700\u7D42\u7684\u306A\u5224\u5B9A\u306E\u53D6\u5F97\u65B9\u6CD5\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u300CAffirmative\u300D\u3068\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u304A\u3088\u3073\u305D\u306E\u30B9\u30B3\u30FC\u30D7\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u8A31\u53EF\u3059\u308B\u305F\u3081\u306B\u3001\u5C11\u306A\u304F\u3068\u30821\u3064\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u80AF\u5B9A\u7684\u306A\u5224\u5B9A\u306B\u8A55\u4FA1\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u300CUnanimous\u300D\u3068\u306F\u3001\u6700\u7D42\u7684\u306A\u5224\u5B9A\u3082\u80AF\u5B9A\u7684\u3067\u3042\u308B\u305F\u3081\u306B\u3001\u3059\u3079\u3066\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u304C\u80AF\u5B9A\u7684\u306A\u5224\u5B9A\u306B\u8A55\u4FA1\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
hideOnLoginPage=\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u3067\u975E\u8868\u793A
resource=\u30EA\u30BD\u30FC\u30B9
userSession.modelNote.tooltip=UserSessionModel.note\u30DE\u30C3\u30D7\u5185\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30CE\u30FC\u30C8\u540D\u3067\u3059\u3002
maxLifespan=\u6700\u5927\u751F\u5B58\u671F\u9593
clientsClientTypeHelp=\u300COpenID Connect\u300D\u306B\u3088\u308A\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u8A8D\u53EF\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u308B\u8A8D\u8A3C\u306B\u57FA\u3065\u3044\u3066\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u691C\u8A3C\u3067\u304D\u307E\u3059\u3002\u300CSAML\u300D\u306F\u3001\u30AF\u30ED\u30B9\u30C9\u30E1\u30A4\u30F3\u306E\u30B7\u30F3\u30B0\u30EB\u30FB\u30B5\u30A4\u30F3\u30AA\u30F3\uFF08SSO\uFF09\u3092\u542B\u3080Web\u30D9\u30FC\u30B9\u306E\u8A8D\u8A3C\u304A\u3088\u3073\u8A8D\u53EF\u306E\u30B7\u30CA\u30EA\u30AA\u3092\u53EF\u80FD\u306B\u3057\u3001\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u3092\u542B\u3080\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30FB\u30C8\u30FC\u30AF\u30F3\u3092\u4F7F\u7528\u3057\u3066\u60C5\u5831\u3092\u6E21\u3057\u307E\u3059\u3002
webOriginsHelp=\u8A31\u53EF\u3055\u308C\u308BCORS\u30AA\u30EA\u30B8\u30F3\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u6709\u52B9\u306A\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8URI\u306E\u3059\u3079\u3066\u306E\u30AA\u30EA\u30B8\u30F3\u3092\u8A31\u53EF\u3059\u308B\u306B\u306F\u300C+\u300D\u3092\u8FFD\u52A0\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u305F\u3060\u3057\u3001\u3053\u308C\u306B\u306F\u300C*\u300D\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u306F\u542B\u307E\u308C\u307E\u305B\u3093\u3002\u3059\u3079\u3066\u306E\u30AA\u30EA\u30B8\u30F3\u3092\u8A31\u53EF\u3059\u308B\u306B\u306F\u3001\u660E\u793A\u7684\u306B\u300C*\u300D\u3092\u8FFD\u52A0\u3057\u3066\u304F\u3060\u3055\u3044\u3002
logoutUrl=\u30ED\u30B0\u30A2\u30A6\u30C8URL
webAuthnPolicyPasswordlessFormHelp=\u30D1\u30B9\u30EF\u30FC\u30C9\u30EC\u30B9WebAuthn\u8A8D\u8A3C\u306E\u30DD\u30EA\u30B7\u30FC\u3002\u3053\u308C\u306F\u3001\u300CWebauthn Register Passwordless\u300D\u5FC5\u9808\u30A2\u30AF\u30B7\u30E7\u30F3\u304A\u3088\u3073\u300CWebAuthn Passwordless Authenticator\u300D\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u4E00\u822C\u7684\u306A\u4F7F\u7528\u6CD5\u306F\u3001WebAuthn\u304C\u4E00\u8981\u7D20\u8A8D\u8A3C\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u308B\u5834\u5408\u3067\u3059\u3002\u300CWebAuthn\u30DD\u30EA\u30B7\u30FC\u300D\u3068\u300CWebAuthn\u30D1\u30B9\u30EF\u30FC\u30C9\u30EC\u30B9\u30FB\u30DD\u30EA\u30B7\u30FC\u300D\u306E\u4E21\u65B9\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001WebAuthn\u3092\u540C\u3058\u30EC\u30EB\u30E0\u306E\u7B2C1\u8981\u7D20\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u3068\u7B2C2\u8981\u7D20\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306E\u4E21\u65B9\u3068\u3057\u3066\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
storedTokensReadable=\u8AAD\u307F\u53D6\u308A\u53EF\u80FD\u306A\u30C8\u30FC\u30AF\u30F3\u3092\u683C\u7D0D
admin-clearEvents=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5185\u306E\u3059\u3079\u3066\u306E\u7BA1\u7406\u30A4\u30D9\u30F3\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
usermodel.prop.label=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC
authenticationOverrides=\u8A8D\u8A3C\u30D5\u30ED\u30FC\u306E\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9
clientSessionIdleHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u308B\u307E\u3067\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306B\u3067\u304D\u308B\u6642\u9593\u3002\u30C8\u30FC\u30AF\u30F3\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u308B\u3068\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u8A2D\u5B9A\u3057\u306A\u3044\u5834\u5408\u3001\u6A19\u6E96\u306ESSO\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30A2\u30A4\u30C9\u30EB\u306E\u5024\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
scopesSelect=\u3053\u306E\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306F1\u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30B9\u30B3\u30FC\u30D7\u306B\u9069\u7528\u3055\u308C\u308B\u3088\u3046\u306B\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
clientAuthenticationHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C\u65B9\u6CD5\uFF08\u53C2\u7167\uFF1Ahttps\://openid.net/specs/openid-connect-core-1_0.html\#ClientAuthentication\uFF09\u3002\u79D8\u5BC6\u9375\u3067\u7F72\u540D\u3055\u308C\u305FJWT\u306E\u5834\u5408\u3001\u30EC\u30EB\u30E0\u79D8\u5BC6\u9375\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
clientSecretHelp=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3067\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3001\u30DC\u30FC\u30EB\u30C8\u304B\u3089\u5024\u3092\u53D6\u5F97\u3067\u304D\u307E\u3059\u3002${vault.ID}\u5F62\u5F0F\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
value=\u5024
offlineSessionMax=\u30AA\u30D5\u30E9\u30A4\u30F3\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u6700\u5927
times.seconds=\u79D2
webAuthnPolicyExtraOriginsHelp=\u975E Web \u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8FFD\u52A0\u30AA\u30EA\u30B8\u30F3\u306E\u30EA\u30B9\u30C8\u3002
resources=\u30EA\u30BD\u30FC\u30B9
groups=\u30E1\u30F3\u30D0\u30FC\u3067\u3042\u308B\u30B0\u30EB\u30FC\u30D7\u3067\u3059\u3002\u30B0\u30EB\u30FC\u30D7\u304B\u3089\u5916\u3059\u306B\u306F\u3001\u30B0\u30EB\u30FC\u30D7\u3092\u9078\u629E\u3057\u3066\u300C\u5916\u3059\u300D\u30DC\u30BF\u30F3\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
permanentLockoutHelp=\u6700\u5927\u30ED\u30B0\u30A4\u30F3\u5931\u6557\u56DE\u6570\u3092\u8D85\u3048\u305F\u3068\u304D\u306B\u3001\u30E6\u30FC\u30B6\u30FC\u3092\u6C38\u4E45\u306B\u30ED\u30C3\u30AF\u3057\u307E\u3059\u3002
logicType.positive=Positive
accountTheme=\u30A2\u30AB\u30A6\u30F3\u30C8\u30C6\u30FC\u30DE
forceAuthentication=\u8A8D\u8A3C\u3092\u5F37\u5236
webAuthnPolicyAvoidSameAuthenticatorRegister=\u30AA\u30FC\u30BB\u30F3\u30C6\u30A3\u30B1\u30FC\u30BF\u30FC\u306E\u91CD\u8907\u767B\u9332\u56DE\u907F
assertionConsumerServiceRedirectBindingURLHelp=\u30A2\u30B5\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\uFF08\u30ED\u30B0\u30A4\u30F3\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9\uFF09\u306ESAML Redirect\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0URL\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u306EBinding\u306E\u305F\u3081\u306EURL\u304C\u306A\u3044\u5834\u5408\u306F\u7A7A\u3067\u3088\u3044\u3067\u3059\u3002
selectARole=\u30ED\u30FC\u30EB\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044
titleAuthentication=\u8A8D\u8A3C
category=\u30AB\u30C6\u30B4\u30EA\u30FC
times.days=\u65E5
providers=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
