storePassword=Contrasenya del magatzem
logoutServiceRedirectBindingURLHelp=URL d''enlla\u00E7 SAML de redirecci\u00F3 per a la desconnexi\u00F3 \u00FAnica del client. Pots deixar-ho en blanc si est\u00E0s fent servir un enlla\u00E7 diferent.
themes=Temes
password=Contrasenya
clientType=''OpenID connect'' permet als clients verificar la identitat de l''usuari final basat en l''autenticaci\u00F3 realitzada per un servidor d''autoritzaci\u00F3. ''SAML'' habilita l''autenticaci\u00F3 i autoritzaci\u00F3 d''escenaris basats en web incloent cross-domain i single sign-on (SSO) i utilitza tokens de seguretat que contenen afirmacions per passar informaci\u00F3.
composite=Compost
clientSignature=Signatura de Client requerida
waitIncrementSecondsHelp=Quan s''ha arribat al llindar d''error, quant de temps ha d''estar un usuari bloquejat?
nodeHost=Host del node
mapperType=Tipus d''assignador
quickLoginCheckMilliSeconds=Si ocorren errors de forma concurrent i molt r\u00E0pida, bloquejar a l''usuari.
edit=Edita
unspecified=no especificat
archiveFormat=Format d''Arxiu
validatorDialogColNames.colName=Nom de rol
associatedRolesText=Rols Associats
certificateHelp=Certificat de client per validar els JWT emesos per aquest client i signats amb la clau privada del client del teu magatzem de claus.
credentialType=Tipus
defaultLocale=Idioma per defecte
clientIdHelp=L''identificador del client registrat amb el prove\u00EFdor d''identitat.
forcePostBindingHelp=Fer servir sempre POST per a les respostes
authorizationUrl=URL d''autoritzaci\u00F3
roleName=Nom de rol
httpPostBindingAuthnRequestHelp=Indica si AuthnRequest ha de ser enviat usant HTTP-POST. Si no est\u00E0 activat es fa HTTP-REDIRECT.
securityDefences=Defenses de seguretat
accessTokenLifespanHelp=Temps m\u00E0xim abans que un token d''acc\u00E9s expiri. Es recomana que aquest valor sigui curt en relaci\u00F3 al temps m\u00E0xim de SSO
includeInAccessToken.tooltip=S''hauria d'afegir la identitat reclamada al token d''acc\u00E9s?
redirectURIHelp=L''URI de redirecci\u00F3 usada per configurar el prove\u00EFdor d''identitat.
idpInitiatedSsoRelayStateHelp=Estat de retransmissi\u00F3 que vols enviar amb una petici\u00F3 SAML quan s''inicia un SSO iniciat per l''IDP
attestationPreference.none=cap
revocation=Revocaci\u00F3
clientDescriptionHelp=Indica la descripci\u00F3 del client. Per exemple ''My Client for TimeSheets''. Tamb\u00E9 suporta claus per a valors localitzats. Per exemple\: ${my_client_description}
clientAuthenticator=Client autenticador
useEntityDescriptor=Importar metadades des d''un descriptor d'entitat remot d''un IDP de SAML
logoutServiceRedirectBindingURL=URL d''enlla\u00E7 SAML de redirecci\u00F3 per a la desconnexi\u00F3
loginActionTimeout=Temps m\u00E0xim d''acci\u00F3 en l''inici de sessi\u00F3
idpInitiatedSsoRelayState=Estat de retransmissi\u00F3 d''un SSO iniciat per l''IDP
validatingX509Certs=Validant certificat X509
masterSamlProcessingUrl=URL principal de processament SAML
key=Clau
validRedirectURIs=Patr\u00F3 d''URI v\u00E0lida per a la qual un navegador pot sol\u00B7licitar la redirecci\u00F3 despr\u00E9s d''un inici o tancament de sessi\u00F3 completat. Es permeten comodins simples p.ex. ''http\://example.com/*''. Tamb\u00E9 es poden indicar rutes relatives p.ex. ''/my/relative/path/*''. Les rutes relatives generaran un URI de redirecci\u00F3 fent servir el host i port de la petici\u00F3. Per SAML, s''han de fixar patrons d''URI v\u00E0lids si vols confiar en l''URL del servei del consumidor indicada en la petici\u00F3 d''inici de sessi\u00F3.
userInfoUrl=URL d''informaci\u00F3 d''usuari
assertionConsumerServicePostBindingURL=Assertion Consumer Service POST Binding URL
usermodel.clientRoleMapping.clientId.label=ID Client
identityProviders=Prove\u00EFdors d''identitat
clientId=ID Client
nameIdPolicyFormat=Format de pol\u00EDtica NameID
idpInitiatedSsoUrlName=Nom del fragment de l''URL per referenciar al client quan vols un SSO iniciat per l''IDP. Deixant aix\u00F2 buit desactiva els SSO iniciats per l''IDP. L''URL referenciada des del navegador ser\u00E0\: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}
validatingX509CertsHelp=El certificat en format PEM que ha de fer-se servir per comprovar les signatures.
importFile=Arxiu d''Importaci\u00F3
clientLoginTimeoutHelp=Temps m\u00E0xim que un client t\u00E9 per finalitzar el protocol d''obtenci\u00F3 del token d''acc\u00E9s. Hauria de ser normalment de l''ordre d''1 minut.
lastAccess=\u00DAltim Acc\u00E9s
ssoSessionIdle=Temps m\u00E0xim que una sessi\u00F3 pot estar inactiva abans que expiri. Els tokens i sessions de navegador s\u00F3n invalidades quan la sessi\u00F3 expira.
xFrameOptions=X-Frame-Options
prompts.none=cap
emailTheme=Tema d''email
times.minutes=Minuts
nameIdFormatHelp=El format de NameID que es far\u00E0 servir per al t\u00EDtol
forcePostBinding=For\u00E7ar enlla\u00E7os POST
discoveryEndpoint=Importa metadades des d''un descriptor d''un prove\u00EFdor d''identitat (IDP) remot.
registerNodeManually=Registrar node manualment
redirectURI=URI de redirecci\u00F3
signDocuments=Signar documents
tokenUrl=Token URL
consentRequired=Si est\u00E0 habilitat, els usuaris han de consentir l''acc\u00E9s del client.
notBefore=No abans de
editUsername=Edita el nom d''usuari
lastRegistration=\u00DAltim registre
requireSsl=Sol\u00B7licitar SSL
samlEntityDescriptor=Et permet carregar metadades d''un prove\u00EFdor d''identitat (IDP) extern d''un arxiu de coniguraci\u00F3n o descarregar des d''una URL.
addIdpMapperName=Nom de l''assignador.
wantAuthnRequestsSigned=Signar AuthnRequests
usermodel.attr.tooltip=Nom de l''atribut d''usuari emmagatzemat que \u00E9s el nom de l''atribut dins el map UserModel.attribute.
export=Exporta
generateNewKeys=Generar noves claus
offlineSessionIdle=Inactivitat de sessi\u00F3 sense connexi\u00F3
backchannelLogout=Backchannel Logout
userRegistrationHelpText=Habilitar/deshabilitar la p\u00E0gina de registre. Un enlla\u00E7 per al registre es mostrar\u00E0 tamb\u00E9 a la p\u00E0gina d''inici de sessi\u00F3.
revokeRefreshToken=Revocar el token d''actualitzaci\u00F3
minimumQuickLoginWaitSeconds=Temps m\u00EDnim entre errors de connexi\u00F3 r\u00E0pids
prompts.login=login
offlineSessionIdleHelp=Temps m\u00E0xim inactiu d''una sessi\u00F3 sense connexi\u00F3 abans que expiri. Necessites fer servi un token sense connexi\u00F3 per refrescar almenys una vegada dins d'aquest per\u00EDode, en un altre cas la sessi\u00F3 sense connexi\u00F3 expirar\u00E0.
forceNameIdFormatHelp=Ignorar la petici\u00F3 de subjecte NameID i fer servir la configurada a la consola d''administraci\u00F3.
realmRoles=Rols de domini
port=Port
adminThemeHelp=Selecciona el tema per a la consola d''administraci\u00F3.
nameIdFormat=Format de NameID
validRedirectUri=URIs de redirecci\u00F3 v\u00E0lides
clientList=Clients
userSession.modelNote.label=Nota sessi\u00F3 usuari
logoutServicePostBindingURL=URL d''enlla\u00E7 SAML POST per a la desconnexi\u00F3
assertionConsumerServicePostBindingURLHelp=SAML POST Binding URL for the client''s assertion consumer service (login responses).  You can leave this blank if you do not have a URL for this binding.
singleLogoutServiceUrl=URL de servei de desconnexi\u00F3 \u00FAnic
userAttribute=Atribut d''usuari
roles=Rols
description=Descripci\u00F3
validateSignatureHelp=Habilitar/deshabilitar la validaci\u00F3 de signatures de prove\u00EFdors d''identitat (IDP) externs
clientSignatureHelp=Signar\u00E0 el client les seves peticions i respostes SAML? I haurien de ser validades?
title=Sessions
keyPasswordHelp=Contrasenya per accedir a la clau privada continguda en l''arxiu
verifyEmail=Verificar email
frontchannelLogout=Desconnexi\u00F3 en primer pla (Front Channel)
formatOption=Format
loginTheme=Tema d''inici de sessi\u00F3
provider=Prove\u00EFdor
providerId=ID
titleRoles=Rols de domini
nodeReRegistrationTimeout=Temps d''espera de re-registre de node
loginTimeout=Temps m\u00E0xim de desconnexi\u00F3
accessTokenLifespan=Durada del token d''acc\u00E9s
setToNow=Fixar a ara
signAssertionsHelp=Haurien de signar-se les assercions en documents SAML? Aquest ajust no \u00E9s necessari si el document ja s''est\u00E0 signant.
validateSignature=Validar signatures
headers=Cap\u00E7aleres
fineGrainSamlEndpointConfig=Fine Grain SAML Endpoint Configuration
hours=Hores
encryptAssertions=Xifrar afirmacions
keyAliasHelp=\u00C0lies de l''arxiu de la teva clau privada i certificat.
aliasHelp=L''\u00E0lies que identifica de forma \u00FAnica un prove\u00EFdor d''identitat, es far servir tamb\u00E9 per construir la URI de redirecci\u00F3.
tokenClaimName.tooltip=Nom del reclam a inserir en el testimoni. Pot ser un nom complet com ''address.street''. En aquest cas, es crear\u00E0 un objecte JSON niat.
maxFailureWaitSeconds=Espera m\u00E0xima
userName=Usuari
clientProfileDescription=Descripci\u00F3
ssoSessionMax=Temps m\u00E0xim abans que una sessi\u00F3 expiri. Els tokens i sessions de navegador s\u00F3n invalidats quan una sessi\u00F3 expira.
protocolMapper=Protocol.
times.hours=Hores
sslType.none=cap
webOrigins=Or\u00EDgens web
realm=Domini
prompt=Prompt
username=Usuari
importConfig=Importa metadades des d''un descriptor d''un prove\u00EFdor d''identitat (IDP) descarregat.
bruteForceDetection=Detecci\u00F3 d''atacs per for\u00E7a bruta
archiveFormatHelp=Format d''arxiu Java keystore o PKCS12
keyAlias=\u00C0lies de clau
revokeRefreshTokenHelp=Si est\u00E0 activat els tokens d''actualitzaci\u00F3 nom\u00E9s poden usar-se una vegada. En un altre cas els tokens d''actualitzaci\u00F3 no es revoquen quan s''utilitzen i poden ser usat m\u00FAltiples vegades.
storedTokensReadableHelp=Habilitar/deshabilitar si els nous usuaris poden llegir els tokens emmagatzemats. Aix\u00F2 assigna el rol ''broker.read-token''.
none=cap
sslType.all=totes les peticions
type=Tipus
httpPostBindingResponse=HTTP-POST enlla\u00E7 de resposta
issuer=Emissor
seconds=Segons
editUsernameHelp=Si est\u00E0 habilitat, el nom d''usuari \u00E9s editable, altrament \u00E9s de nom\u00E9s lectura.
id=ID
accountThemeHelp=Selecciona el tema per a les p\u00E0gines de gesti\u00F3 del compte d''usuari.
fullScopeAllowedHelp=Permet deshabilitar totes les restriccions.
canonicalizationHelp=M\u00E8tode de canonicalitzaci\u00F3 per a les signatures XML
sessions=Sessions
includeAuthnStatement=Incloure AuthnStatement
jsonType.tooltip=El tipus de JSON que hauria de fer-se servir per omplir la petici\u00F3 de JSON en el token. long, int, boolean i String s\u00F3n valors v\u00E0lids
multivalued.tooltip=Indica si l''atribut suporta m\u00FAltiples valors. Si est\u00E0 habilitat, la llista de tots els valors d''aquest atribut es fixar\u00E0 com a reclamaci\u00F3. Si est\u00E0 deshabilitat, nom\u00E9s el primer valor ser\u00E0 fixat com a reclamaci\u00F3.
enableStartTLS=Habilitar StartTLS
enableStartTls=Habilitar StartTLS
addIdPMapper=Afegeix assignador de prove\u00EFdor d''identitat
trustEmail=Confiar en l''email
jsonType.label=Tipus JSON de reclamaci\u00F3
fullScopeAllowed=Permet tots els \u00E0mbits
push=Push
homeURL=URL per defecte per utilitzar quan el servidor d''autoritzaci\u00F3 necessita redirigir o enviar de tornada al client.
masterSamlProcessingUrlHelp=Si est\u00E0 configurada, aquesta URL es fara servir per a cada enlla\u00E7 al prove\u00EFdor del servei del consumidor d''assercions i serveis de desconnexi\u00F3 \u00FAnics. Pot ser sobreescrit de forma individual per a cada enlla\u00E7 i servei en el punt final de configuraci\u00F3 fina de SAML.
usermodel.attr.label=Atribut d''usuari
claimJsonType=El tipus de JSON que hauria de fer-se servir per omplir la petici\u00F3 de JSON en el token. long, int, boolean i String s\u00F3n valors v\u00E0lids
forceAuthenticationHelp=Indica si el prove\u00EFdor d''identitat ha d'autenticar en presentar directament les credencials en lloc de dependre d''un context de seguretat previ.
testClusterAvailability=Provar disponibilitat del cl\u00FAster
forceNameIdFormat=For\u00E7ar format NameID
rememberMeHelpText=Mostra la casella de selecci\u00F3 en la p\u00E0gina d''inici de sessi\u00F3 per a permetre a l''usuari estar connectat entre reinicis del navegador fins que la sessi\u00F3 expiri.
sslType.external=peticions externes
multiValued=Indica si l''atribut suporta m\u00FAltiples valors. Si est\u00E0 habilitat, la llista de tots els valors d''aquest atribut es fixar\u00E0 com a reclamaci\u00F3. Si est\u00E0 deshabilitat, nom\u00E9s el primer valor ser\u00E0 fixat com a reclamaci\u00F3.
addRole=Afegir rol
ssoServiceUrl=URL de servei de connexi\u00F3 \u00FAnic (SSO)
clients=Clients
clientName=Nom
userRegistration=Registre d''usuari
save=Desar
wantAuthnRequestsSignedHelp=Indica si el prove\u00EFdor d''identitat espera rebre signades les AuthnRequest.
login=login
enabled=Habilitat
maxDeltaTimeSeconds=Reinici del comptador d''errors
keyPassword=Contrasenya de la clau
backchannelLogoutHelp=Does the external IDP support backchannel logout?
SSOSessionIdle=Sessions SSO inactives
ssoServiceUrlHelp=L''URL que s''ha de fer servir per enviar peticions d''autenticaci\u00F3 (SAML AuthnRequest).
trustEmailHelp=Si est\u00E0 habilitat, l''email rebut d''aquest prove\u00EFdor no es verificar\u00E0 encara que la verificaci\u00F3 estigui habilitada per al domini.
supportedLocales=Idiomes suportats
maxFailureWaitSecondsHelp=Temps m\u00E0xim que un usuari queda bloquejat.
issuerHelp=L''identificador de l''emissor per a l''emissor de la resposta. Si no s''indica, no es realitzar\u00E0 cap validaci\u00F3.
titleSessions=Sessions
clientNameHelp=Indica el nom visible del client. Per exemple ''My Client''. Tamb\u00E9 suporta claus per valors localitzats. Per exemple\: ${my_client}
maxDeltaTimeSecondsHelp=Quan s''ha de reiniciar el comptador d''errors?
adminURLHelp=URL a la interf\u00EDcie d''administraci\u00F3 del client. Fixa aquest valor si el client suporta l''adaptador de REST. Aquesta API REST permet al servidor d''autenticaci\u00F3 enviar al client pol\u00EDtiques de revocaci\u00F3 i altres tasques administratives. Normalment es fixa a l''URL base del client.
contentSecurityPolicy=Content-Security-Policy
rootUrl=URL arrel
rootURL=URL arrel afegida a les URL relatives
storePasswordHelp=Contrasenya per accedir a l''arxiu
frontchannelLogoutHelp=Quan est\u00E0 activat, la desconnexi\u00F3 requereix una redirecci\u00F3 del navegador cap al client. Quan no est\u00E0 activat, el servidor realitza una invovaci\u00F3n de desconnexi\u00F3 en segon pla.
clientLoginTimeout=Temps m\u00E0xim d''autenticaci\u00F3
nodeReRegistrationTimeoutHelp=Indica el m\u00E0xim interval de temps perqu\u00E8 els nodes del cl\u00FAster registrats es tornin a registrar. Si el node del cl\u00FAster no envia una petici\u00F3 de re-registre a Keycloak dins d''aquest interval, ser\u00E0 desregistrat de Keycloak
logoutServicePostBindingURLHelp=URL d''enlla\u00E7 SAML POST per a la desconnexi\u00F3 \u00FAnica del client. Pots deixar-ho en blanc si est\u00E0s fent servir un enlla\u00E7 diferent.
registrationEmailAsUsername=Email com a nom d''usuari
scopes=Els \u00E0mbits que s''enviaran quan es sol\u00B7liciti autoritzaci\u00F3. Pot ser una llista d''\u00E0mbits separats per espais. El valor per defecte \u00E9s ''openid''.
signDocumentsHelp=Hauria el domini de signar els documents SAML?
requireSslHelp=\u00C9s HTTP obligatori? ''cap'' significa que HTTPS no \u00E9s obligatori per cap direcic\u00F3n IP de client, ''peticions externes'' indica que localhost i les adreces IP privades poden accedir sense HTTPS, ''totes les peticions'' vol dir que HTTPS \u00E9s obligatori per a totes les adreces IP.
userInfoUrlHelp=L''URL d''informaci\u00F3 d''usuari. Opcional.
includeAuthnStatementHelp=Hauria d''incloure''s una declaraci\u00F3 especificant el m\u00E8tode i la marca de temps en la resposta d''inici de sessi\u00F3?
client-authenticator-type=Client autenticador usat per autenticar aquest client contra el servidor Keycloak
kc.realm.name=Domini
download=Descarrega
protocol=Protocol
tokenClaimName.label=Nom de reclam del token
host=Host
create=Crea
clientSecret=Secret de Client
from=Des de
httpPostBindingAuthnRequest=HTTP-POST per AuthnRequest
includeInAccessToken.label=Afegir al token d''acc\u00E9s
adminURL=URL d''administraci\u00F3
settings=Ajustos
failureFactorHelp=Indica quants errors es permeten abans que es dispari una espera.
minutes=Minuts
storeTokensHelp=Habilitar/deshabilitar si els tokens han de ser emmagatzemats despr\u00E9s d''autenticar als usuaris.
singleLogoutServiceUrlHelp=L''URL que ha de fer-se servir per enviar peticions de desconnexi\u00F3.
userSession.modelNote.tooltip=Nom de la nota emmagatzemada en la sessi\u00F3 d''usuari dins del mapa UserSessionModel.note
clientsClientTypeHelp=''OpenID connect'' permet als clients verificar la identitat de l''usuari final basat en l''autenticaci\u00F3 realitzada per un servidor d''autoritzaci\u00F3. ''SAML'' habilita l''autenticaci\u00F3 i autoritzaci\u00F3 d''escenaris basats en web incloent cross-domain i single sign-on (SSO) i utilitza tokens de seguretat que contenen afirmacions per passar informaci\u00F3.
storeTokens=Emmagatzemar tokens
includeInIdToken.label=Afegir al token d''ID
webOriginsHelp=Or\u00EDgens CORS permesos. Per permetre tots els or\u00EDgens d''URIs de redirecci\u00F3 v\u00E0lides afegeix ''+''. Per permetre tots els or\u00EDgens afegeix ''*''.
emailThemeHelp=Selecciona el tema per als correus electr\u00F2nics que s\u00F3n enviats pel servidor.
logoutUrl=URL de desconnexi\u00F3
canonicalization=M\u00E8tode de canonicalitzaci\u00F3
storedTokensReadable=Tokens emmagatzemats llegibles
SSOSessionMax=Temps m\u00E0xim sessi\u00F3 SSO
minimumQuickLoginWaitSecondsHelp=Quant de temps s''ha d''esperar despr\u00E9s d''un error en un intent r\u00E0pid d''identificaci\u00F3
mappers=Assignadors
waitIncrementSeconds=Increment d''espera
usermodel.prop.label=Propietat
name-id-format=Format de NameID
addNode=Afegir Node
credentials=Credencials
certificate=Certificat
importClient=Importar Client
selectRole.label=Selecciona rol
prompts.consent=consentiment
enableSSL=Habilitar SSL
general=General
failureFactor=Nombre m\u00E0xim d''errors d''inici de sessi\u00F3
signAssertions=Signar assercions
adminTheme=Tema de consola d''administraci\u00F3
alias=\u00C0lies
tokens=Tokens
encryptAssertionsHelp=Haurien de xifrar-se les afirmacions SAML amb la clau p\u00FAblica del client fent servir AES?
clientSecretHelp=El secret del client registrat amb el prove\u00EFdor d''identitat.
validateSignatures=Habilitar/deshabilitar la validaci\u00F3 de signatura en respostes SAML.
on=Activat
descriptionHelp=Indica la descripci\u00F3 del client. Per exemple ''My Client for TimeSheets''. Tamb\u00E9 suporta claus per a valors localitzats. Per exemple\: ${my_client_description}
logoutUrlHelp=Punt de tancament de sessi\u00F3 per utilitzar en la desconnexi\u00F3 d''usuaris des d''un prove\u00EFdor d''identitat (IDP) extern.
times.seconds=Segons
clear=Neteja
serviceAccount=Permetre autenticar aquest client contra Keycloak i rebre un token d''acc\u00E9s dedicat per a aquest client.
assertionConsumerServiceRedirectBindingURL=Assertion Consumer Service Redirect Binding URL
loginThemeHelp=Selecciona el tema per a les p\u00E0gines d''inici de sessi\u00F3, OTP, permisos, registre i recordatori de contrasenya.
signatureAlgorithm=L''algorisme de signatura usat per signar els documents.
multivalued.label=Valors m\u00FAltiples
accountTheme=Tema de compte
forceAuthentication=For\u00E7ar autenticaci\u00F3
clustering=Clustering
rememberMe=Mantenir connectat
category=Categoria
usermodel.prop.tooltip=Nom del m\u00E8tode de propietat en la interf\u00EDcie UserModel. Per exemple, un valor de ''email'' faria refer\u00E8ncia al m\u00E8tode UserModel.getEmail().
times.days=Dies
user=Usuari
registeredClusterNodes=Registrar nodes de cl\u00FAster
selectRole.tooltip=Introdueix el rol a la caixa de text de l''esquerra, o fes clic a aquest bot\u00F3 per navegar i buscar el rol que vols.
