#converted from translation.json
#Thu Oct 26 10:21:09 CEST 2023
otpTypeHelp='totp' paremtas ribot\u0105 laik\u0105 galiojan\u010Diu vienkartiniu slapta\u017Eod\u017Eiu. 'hotp' - ribot\u0105 kart\u0173 galiojan\u010Diu vienkartiniu slapta\u017Eod\u017Eiu.
useKerberosForPasswordAuthentication=Naudoti Kerberos autentifikacijai su slapta\u017Eod\u017Eiu
anyResource=Bet kuris resursas
themes=Temos
addClientScope=Kliento \u0161ablono k\u016Brimas
clientType='OpenID connect' leid\u017Eia klientams tikrinti galutinio naudotojo tapatyb\u0119 remiantis autorizacijos serverio atlikta autentifikacija. 'SAML' \u012Fgalina \u017Einiatinklio, \u012Fskaitant skirting\u0173 domen\u0173 atvejus, vieningos autentifikacijos ir autorizacijos scenarijus perduodant informacij\u0105 saugiose \u017Einut\u0117se.
clientSignature=Privalomas kliento para\u0161as
unanimous=Vienbals\u0117
policy-name=\u0160ios taisykl\u0117s pavadinimas.
clientHelp=Nurodykite klient\u0105, kuris atlieka autorizacijos u\u017Eklausas. Nei nenurodyta, tuomet autorizacijos u\u017Eklausa bus vertinama naudojant dabartin\u012F klient\u0105.
debugHelp=Ar \u012Fgalinti Krb5LoginModule veikimo prane\u0161im\u0173 ra\u0161ym\u0105 \u012F standarin\u0119 i\u0161vest\u012F derinimo r\u0117\u017Eimu?
validatorColNames.colConfig=Konfig\u016Bruoti
nodeHost=Mazgo serveris
quickLoginCheckMilliSeconds=Jei n\u0117s\u0117kmingi bandymai prisijungti seka vienas kit\u0105 per greitai, tuomet naudotojo paskyra yra u\u017Erakinama.
unspecified=nenurodyta
signOut=Atsijungti
active=Aktyvus
validatorDialogColNames.colName=Rol\u0117s pavadinimas
credentialType=Tipas
certificateHelp=Kliento sertifikatas naudojamas kliento i\u0161duot\u0173 ir priva\u010Diu raktu pasira\u0161yt\u0173 JWT prieigos rakt\u0173 tikrinimui.
forcePostBindingHelp=Visuomet naudoti POST s\u0105ry\u0161\u012F siun\u010Diant atsakymus.
roleName=Rol\u0117s pavadinimas
operationType=Veiksmo tipas
httpPostBindingAuthnRequestHelp=Jei \u012Fgalinta, tuomet AuthnRequest siun\u010Diami HTTP-POST saistymu. Kitu atveju bus naudojamas HTTP-REDIRECT.
policyEnforcementMode=Taisykli\u0173 vykdymo r\u0117\u017Eimas
decisionStrategy=Sprendimo strategija
requestObjectSignatureAlgorithmHelp=JWA algoritmas, kur\u012F klientas naudoja siun\u010Diant OIDC u\u017Eklausos objekt\u0105, nusakyt\u0105 'request' arba 'request_uri' parameterais. Jei nustatyta 'any', tuomet u\u017Eklausos objektas gali b\u016Bti nepasira\u0161ytas arba pasira\u0161ytas bet kuriuo algoritmu.
requiredUserActionsHelp=Nurodykite kuriuos veiksmus po prisijungimo naudotojas privalo atlikti. 'Patvirtinti el. pa\u0161to adres\u0105' \u012F naudotojo el. pa\u0161to adres\u0105 siun\u010Dia patvirtinimo nuorod\u0105. 'Atnaujinti profilio informacij\u0105' reikalauja naudotojo per\u017Ei\u016Br\u0117ti ir atnaujinti profilio informacij\u0105. 'Atnaujinti slapta\u017Eod\u012F' reikalauja naudotojo pasikeisti slapta\u017Eod\u012F. 'Konfig\u016Bruoti OTP' reikalauja atnaujinti mobilaus slapta\u017Eod\u017Ei\u0173 generatoriaus konfig\u016Bracij\u0105.
securityDefences=Saugos priemon\u0117s
realmSettings=Srities nustatymai
deleteEvents=I\u0161valyti \u012Fvykius
accessTokenLifespanHelp=Laikas, po kurio prisijungimui naudojamas raktas (Access Token) nustoja galioti. Rekomenduojama, kad \u0161ios reik\u0161m\u0117s galiojimas b\u016Bt\u0173 reliatyviai trumpas palyginus su SSO galiojimo laiku.
redirectURIHelp=Tapatyb\u0117s teik\u0117jo konfig\u016Bravimo nuoroda.
displayName=\u017Dmogui suprantamas, draugi\u0161kas tapatyb\u0117s teik\u0117jo pavadinimas.
resourcePath=Resurso kelias
applyToResourceTypeHelp=Nurodykite ar \u0161is leidimas turi b\u016Bti pritaikomas visiems \u0161io tipo resursams. Jei \u012Fgalinta, tuomet leidimo tikrinimas bus atliekamas visiems nurodyto tipo resursams.
attestationPreference.none=jokio
useJwksUrlHelp=Jei \u012Fgalinta, tuomet tapatyb\u0117s teik\u0117jo vie\u0161asis raktas atsiun\u010Diamas i\u0161 pateiktos JWKS URL. \u012Egalinimas suteikia lankstumo, nes tapatyb\u0117s teik\u0117jui pergeneravus raktus jie automati\u0161kai atsiun\u010Diami. Jei \u0161i nuostata i\u0161jungta, tuomet naudojamas Keycloak DB saugomas vie\u0161asis raktas (arba sertifikatas) ir klientui sugeneravus naujus raktus juos rankiniu b\u016Bdu reik\u0117s importuoti \u012F Keycloak DB.
pairwiseSubAlgorithmSalt.label=Druska
revocation=At\u0161aukimai
clientDescriptionHelp=Nurodomas kliento apra\u0161as. Pavyzd\u017Eiui 'Mano laiko lenteli\u0173 klientas'. Palaikomos lokalizuotos reik\u0161m\u0117s. Pavyzd\u017Eiui\: ${my_client_description}
clientAuthenticator=Kliento autentifikavimo priemon\u0117s
useEntityDescriptor=Importuoti metaduomenis i\u0161 nutolusio IDP SAML subjekto apra\u0161o.
loginActionTimeout=Naudotojo prisijungimo veiksmui skirtas laikas
updateFirstLoginHelp=Pirmojo prisijungimo metu atnaujinti naudotojo profilio duomenis
validRedirectURIs=Nukreipimo URI \u0161ablonas, kuomet nar\u0161yklei leid\u017Eiama nukreipti naudotoj\u0105 po s\u0117kmingos autentifikacijos ar atsijungimo metu. Leid\u017Eiami pakaitos simboliai, pvz. 'http\://pavyzdys.lt/*'. Leid\u017Eiami reliatyv\u016Bs keliai pvz. /mano/reliatyvus/kelias/*. Reliatyvumas skai\u010Diuojamas nuo kliento \u0161akninio URL (jei nurodyta) arba nuo autentifikacijos serverio \u0161akninio adreso. SAML atveju, kuomet tikimasi gav\u0117jo paslaugos URL \u012Ftraukimo \u012F prisijungimo u\u017Eklaus\u0105, privaloma nurodyti teisingus URI \u0161ablonus.
assertionConsumerServicePostBindingURL=Sprendini\u0173 naudotojo paslaugos POST jungties URL
usermodel.clientRoleMapping.clientId.label=Kliento ID
endpoints=Prieigos adresai
clientId=Kliento ID
validatingX509CertsHelp=PEM formato sertifikatai, kurie turi b\u016Bti naudojami para\u0161\u0173 tikrinimui. Reik\u0161m\u0117s skiriamos kableliais (,).
contextualAttributesHelp=Galite pateikti vykdymo aplinkos arba vykdymo konteksto atributus.
importFile=Importuoti rinkmen\u0105
clientLoginTimeoutHelp=Laikas, per kur\u012F klientas turi u\u017Ebaigti prisijungimo proces\u0105. Normaliu atveju reik\u0161m\u0117 tur\u0117t\u0173 b\u016Bti 1 minut\u0117.
protocolHelp=Kurio SSO protokolo konfig\u016Bracija teikia \u0161is \u0161ablonas
lastAccess=V\u0117liausios prieigos laikas
uiDisplayName=Konsol\u0117je rodomas pavadinimas
prompts.none=jokio
resourcesHelp=Nurodykite, kad \u0161is leidimas turi b\u016Bti taikomas tik tam tikriems resursams.
adminEventsSettings=Administravimo veiksm\u0173 nustatymai
passwordConfirmation=Pakartotas slapta\u017Eodis
emailVerified=El. pa\u0161tas patvirtintas
Thursday=Ketvirtadienis
times.minutes=Minut\u0117s
disableUserInfo=U\u017Edrausti naudotojo informacijos prieig\u0105
forcePostBinding=Priverstinai naudoti POST s\u0105ry\u0161\u012F
defaultRoles=Numatytosios rol\u0117s
discoveryEndpoint=Importuoti metaduomenis i\u0161 nutolusio IDP aptikimo apra\u0161o (IDP discovery descriptor).
countHelp=Nurodykite kiek klient\u0173 gali b\u016Bti sukurti naudojant prieigos rakt\u0105
otpPolicyPeriod=OTP rakto galiojimo intervalas
uuidLdapAttribute=UUID LDAP atributas
topLevelFlowType=Kokio tipo \u0161i auk\u0161\u010Diausio lygio sritis? 'client' tipas naudojamas klient\u0173 (program\u0173) autentifikacijai. 'generic' naudojamas visais kitais atvejais.
scopeNameHelp=Kliento \u0161ablono pavadinimas. Privalo b\u016Bti unikalus \u0161ioje srityje
Monday=Pirmadienis
requiredUserActions=Privalomi veiksmai naudotojui
flowTypeHelp=Kokios r\u016B\u0161ies \u0161i forma?
consentRequired=Jei \u012Fgalinta, tuomet naudotojai privalo patvirtinti, kad pageidauja prisijungti prie kliento (programos).
allowRemoteResourceManagement=Nuotolinis resurs\u0173 valdymas
standardFlow=\u012Egalina standartin\u012F OpenID Connect nukreipim\u0105, kuomet autentifikacijos metu yra perduodamas autorizacijos kodas. OpenID Connect arba OAuth2 specifikacijos terminais tai rei\u0161kia 'Authorization Code Flow' \u012Fgalinim\u0105 \u0161iam klientui.
identityProvider=Tapatyb\u0117s teik\u0117jas
eventListeners=\u012Evyki\u0173 gav\u0117jai
bindDn=Prisijungimo DN
Friday=Penktadienis
identityProviderLinks=S\u0105sajos su tapatyb\u0117s teik\u0117jais
leave=Palikti
eventTypes.IMPERSONATE.name=\u012Ek\u016Bnyti
wantAuthnRequestsSigned=Reikalaujami pasira\u0161yt\u0173 AuthnRequests
usermodel.attr.tooltip=I\u0161saugoto naudotojo atributo pavadinimas kuris naudojamas UserModel.attribute rinkinyje.
export=Eksportuoti
fineGrainOpenIdConnectConfiguration=Detalioji OpenID prisijungimo konfig\u016Bracija
add=Prid\u0117ti
passwordPolicy=Slapta\u017Eod\u017Ei\u0173 taisykl\u0117s
backchannelLogout=Foninis atjungimas
count=Kiekis
testAuthentication=Tikrinti autentifikacij\u0105
prompts.login=prisijungimas
users=Naudotojai
offlineSessionIdleHelp=Darbo neprisijungus sesijos neveikimo laikas, po kurio neaktyvi sesija bus u\u017Ebaigta. Darbo neprisijungus metu, prisijungimo raktai turi b\u016Bti atnaujinami bent kart\u0105 per nurodyt\u0105 period\u0105. Kitu atveju sesijos galiojmas bus sustabdytas.
uris=URI kuris taip pat gali b\u016Bti naudojamas vienareik\u0161mi\u0161kam resurso identifikavimui.
forceNameIdFormatHelp=Ignoruoti NameID tapatyb\u0117s identifikatoriaus format\u0105, naudojant administratoriaus konsol\u0117je nurodyt\u0105 format\u0105.
month=M\u0117nesis
port=Prievadas
expiration=Galiojimas
realmRolePrefix=Srities rol\u0117s prefiksas
jwksUrlHelp=URL, kuriuo pasiekiami kliento JWK formatu saugomi raktai. \u017Di\u016Br\u0117kite JWK specifikacij\u0105 detalesnei informacijai. Jei naudojamas kliento adapteris su "jwt" kredencialais, tuomet galite naudoti j\u016Bs\u0173 programos URL su '/k_jwks' sufiksu. Pavyzd\u017Eiui 'http\://www.myhost.com/myapp/k_jwks' .
includeRepresentation=I\u0161saugoti reprezentacij\u0105
assertionConsumerServicePostBindingURLHelp=Kliento sprendini\u0173 pri\u0117mimo paslaugos (prisijungimo rezultat\u0173) SAML POST jungties URL. Jei toki\u0173 jung\u010Di\u0173 neturite, tuomet palikite tu\u0161\u010Dias reik\u0161mes.
resourceTypes=Resurso tipas
singleLogoutServiceUrl=Vieningo atsijungimo paslaugos URL
roles=Rol\u0117s
includeInUserInfo.label=Prid\u0117ti prie naudotojo informacijos
back=Atgal
validateSignatureHelp=\u012Egalinamas i\u0161orini\u0173 IDP para\u0161\u0173 tikrinimas.
policyCode=JavaScript kodas kuriame apra\u0161ytos \u0161ios taisykl\u0117s s\u0105lygos.
title=Autentifikavimas
verifyEmail=El. pa\u0161to patvirtinimas
representation=Reprezentacija
remove=\u0160alinti
formatOption=Formato pasirinkimas
loginTheme=Prisijungimo lango tema
provider=Teik\u0117jas
flows=Sekos
scope=Taikymo sritis
nodeReRegistrationTimeout=Mazgo persiregistravimui skirtas laikas
client=client
includeRepresentationHelp=I\u0161saugoti kur\u016Bmo ir redagavimo u\u017Eklaus\u0173 JSON reprezentacij\u0105.
connectionURL=Jungties URL
accessTokenLifespan=Prisijungimo rakto galiojimo laikas
setToNow=Parinkti dabartin\u0119 dat\u0105
signAssertionsHelp=Ar SAML sprendiniai SAML dokumentuose turi b\u016Bti pasira\u0161omi? \u0160is nustatymas neb\u016Btinas, kuomet naudojamas viso dokumento pasira\u0161ymas.
firstBrokerLoginFlowAliasHelp=Autentifikacijos eigos pseudonimas, kuris bus su\u017Eadintas \u0161io tapatyb\u0117s teik\u0117jo naudotojui prisijungus pirm\u0105 kart\u0105. Terminas 'pirmas kartas' rei\u0161kia, kad Keycloak sistemoje nebuvo saugomas naudotojo profilis susietas su autentifikuotu \u0161io tapatyb\u0117s teik\u0117jo naudotoju.
owner=Savininkas
validateSignature=Para\u0161o tikrinimas
implicitFlow=\u012Egalina OpenID Connect nukreipim\u0105, kuomet autentifikacijos metu n\u0117ra perduodamas autorizacijos kodas. OpenID Connect arba OAuth2 specifikacijos terminais tai rei\u0161kia  'Implicit Flow' \u012Fgalinim\u0105 \u0161iam klientui.
headers=Antra\u0161t\u0117s
encryptAssertions=U\u017Ekoduoti sprendinius
keyAliasHelp=Privataus rakto ir sertifikato rinkmenos pseudonimas.
tokenClaimName.tooltip=\u012E rakt\u0105 \u012Fterpiamas privalomas atributas. Galite nurodyte piln\u0105 keli\u0105 iki atributo, pavyzd\u017Eiui 'address.street'. Pateiktu atveju bus sukuriamas sud\u0117tinis (nested) JSON objektas.
userName=Naudotojo vardas
clientProfileDescription=Apra\u0161ymas
userObjectClasses=Naudotoj\u0173 objekt\u0173 klas\u0117s
ssoSessionMax=Laikas, po kurio prisijungimo sesija yra sunaikinama. Sesijos pasibaigimo metu visi raktai (Tokens) ir nar\u0161ykli\u0173 sesijos sunaikinamos.
policyRoles=Nurodo *kliento* rol\u0117(\u012Fs) kurios tenkina \u0161i\u0105 taisykl\u0119.
optimizeLookup=Optimizuoti REDIRECT pasira\u0161ymo rakto paie\u0161k\u0105
times.hours=Valandos
browserFlowHelp=Pasirinkite autentifikacijos nar\u0161ykl\u0117je sek\u0105
temporaryLocked=Naudotojas laikintai u\u017Erakintas, nes per daug klydo prisijungiant prie sistemos.
webOrigins=\u0160aknin\u0117s nuorodos
realm=Sritis
prompt=Raginimas
username=Naudotojo vardas
showAuthData=Rodyti autorizacijos duomenis
importConfig=Importuoti metaduomenis i\u0161 rinkmenos, kuri\u0105 atsisiunt\u0117te i\u0161 IDP aptikimo apra\u0161o (IDP discovery descriptor).
includeInUserInfo.tooltip=Ar privaloma informacija turi b\u016Bti pridedama prie naudotojo informacijos?
initialCounter=Pradin\u0117 skaitliuko reik\u0161m\u0117
revokeRefreshTokenHelp=Jei \u012Fgalintas, tuomet atnaujinimo raktai (Refresh Token) gali b\u016Bti naudojami tik vien\u0105 kart\u0105. Kitu atveju - atnaujinimo raktai gali b\u016Bti pernaudojami daugel\u012F kart\u0173. 
storedTokensReadableHelp=Jei \u012Fgalinta, tuomet naudotojai gali per\u017Ei\u016Br\u0117ti i\u0161saugotus prieigos raktus. \u012Egalinama broker.read-token rol\u0117.
authenticationFlowTypeHelp=Kokios r\u016B\u0161ies \u0161i forma?
authorization=\u012Egalinti detal\u0173 kliento autorizacijos palaikym\u0105
editUsernameHelp=Jei \u012Fgalintas, tuomet naudotojas gali keisti savo naudotojo vard\u0105.
consoleDisplayConnectionUrlHelp=Jungties \u012F LDAP server\u012F URL
bindCredentialsHelp=LDAP administratoriaus slapta\u017Eodis
action=Veiksmas
id=ID
join=Prijungti
fullScopeAllowedHelp=\u012Egalinimo atveju visi apribojimai i\u0161jungiami
applyPolicy=Pritaikyti taisykl\u0119
otpType=OTP tipas
directGrantHelp=Pasirinkite tiesiogini\u0173 teisi\u0173 sek\u0105 (direct grant authentication).
scopesHelp=Taikymos sritys, kurios siun\u010Diamos autorizavimo u\u017Eklausoje. Reik\u0161m\u0117s turi b\u016Bti atskirtos tarpo simboliu. Numatyta reik\u0161m\u0117 - 'openid'.
includeAuthnStatement=\u012Etraukti AuthnStatement
jsonType.tooltip=Naudojamas JSON lauko tipas, kuris turi b\u016Bti u\u017Epildomas rakto privalomoje JSON informacijoje. Galimi tipai\: long, int, boolean ir String.
multivalued.tooltip=Nurodo, kad atributas gali tur\u0117ti daugiau nei vien\u0105 reik\u0161m\u0119. Jei pa\u017Eym\u0117tas, tuomet visos reik\u0161m\u0117s nustatomos kaip privalomos. Kitu atveju privaloma tik pirmoji reik\u0161m\u0117.
enableStartTLS=\u012Egalinti StartTLS
enableStartTls=\u012Egalinti StartTLS
addIdPMapper=Prid\u0117ti tapatyb\u0117s teik\u0117jo atitikmens susiejim\u0105
eventType=\u012Evykio tipas
sectorIdentifierUri.label=Sektoriaus identifikatoriaus URI
homeURL=Numatytas URL, kuris turi b\u016Bti naudojamas naudotojo nukreipimui atgal \u012F klient\u0105.
firstBrokerLoginFlowAlias=Pirmojo prisijungimo eiga
usermodel.attr.label=Naudotojo atributas
eventTypes.REGISTER.name=Registracijos
rememberMeHelpText=Prisijungimo lange rodyti pasirinkim\u0105 leid\u017Eiant\u012F naudotojui likti prisijungus netgi tuomet, kai nar\u0161ykl\u0117 yra i\u0161jungiama/\u012Fjungiama tol, kol nepasibaigia prisijungimo sesija.
usernameLdapAttribute=Prisijungimo vardo LDAP atributas
evaluate=Vertinti
status=B\u016Bsena
ssoServiceUrl=Vieningo prisijungimo paslaugos URL
allowRemoteResourceManagementHelp=Ar leid\u017Eiama nuotoliniu b\u016Bdu resurs\u0173 serveriui valdyti resursus? Jei ne\u012Fgalinta, tuomet resursai gali b\u016Bti valdomi tik per \u0161i\u0105 administravimo konsol\u0119.
clients=Klientai
changedUsersSyncPeriod=Periodinis sinchronizavimo intervalas
clientName=Vardas
userRegistration=Naudotoj\u0173 registracija
save=Saugoti
login=prisijungimas
maxDeltaTimeSeconds=Pamir\u0161ti nepavykusius prisijungimus po
backchannelLogoutHelp=Ar i\u0161orinis tapatyb\u0117s teik\u0117jas palaiko serveris-serveris naudotojo atjungimo b\u016Bd\u0105?
usermodel.realmRoleMapping.rolePrefix.tooltip=Prefiksas, pridedamas prie\u0161 kiekvien\u0105 srities rol\u0119 (neprivalomas)
affirmative=Pozityvi
changedUsersSyncHelp=Intervalas sekund\u0117mis, kas kur\u012F atliekamas periodinis naujai registruot\u0173 arba su pakeistais duomenimis LDAP naudotoj\u0173 sinchronizavimas \u012F Keycloak
trustEmailHelp=Jei \u012Fgalintas, tuomet \u0161io tapatyb\u0117s teik\u0117jo pateiktas el. pa\u0161to adresas laikomas patikimu ir, nepaisant bendr\u0173j\u0173 srities nustatym\u0173, n\u0117ra papildomai tikrinamas.
maxFailureWaitSecondsHelp=Maksimalus laikas, kuomet naudotojo paskyra yra u\u017Erakinama po nes\u0117kming\u0173 bandym\u0173 prisijungti.
userInfoSignedResponseAlgorithm=Naudotojo informacijos pasira\u0161yto atsako algoritmas
maxDeltaTimeSecondsHelp=Laikas, po kurio nepavyk\u0119 prisijungimai bus pamir\u0161ti
adminURLHelp=Kliento administravimo tinklin\u0117s s\u0105sajos URL. \u012Era\u0161yti tuomet, kai klientas palaiko adapterio REST API. \u0160is REST API leid\u017Eia autentifikacijos serveriui perduoti at\u0161aukimo ir kitas su administravimu susijusias taisykles. Da\u017Eniausiai \u0161is URL sutampa su kliento pagrindiniu URL.
otpPolicyPeriodHelp=Kiek sekund\u017Eiu galios OTP prieigos raktas? Numatyta reik\u0161m\u0117 30 sekund\u017Ei\u0173.
contentSecurityPolicy=Content-Security-Policy
storePasswordHelp=Slapta\u017Eodis, reikalingas norint atidaryti slapta\u017Eod\u017Ei\u0173 saugykl\u0105
frontchannelLogoutHelp=Jei \u012Fgalinta, tuomet atsijungimas atliekamas nar\u0161ykl\u0117s nukreipimu \u012F kliento puslap\u012F. Kitu atveju, atsijungimas atliekamas perduodant serveris-serveris u\u017Eklaus\u0105.
userFederation=Naudotoj\u0173 federavimas
directAccess=\u012Egalina tiesiogin\u012F prieigos suteikim\u0105, kuomet klientas turi prieig\u0105 prie naudotojo vardo ir slapta\u017Eod\u017Eio ir prieigos rakt\u0173 gavimui \u0161iais duomenimis gali tiesiogiai apsikeisti su Keycloak serveriu. OAuth2 specifikacijos terminais, \u0161iam klientui \u012Fgalinimas 'Resource Owner Password Credentials Grant'.
disable=I\u0161jungti
attributes=Atributai
logic=Logika
scopes=Taikymo sritys
resourceType=Resurso tipas
flowType=Sekos tipas
minuteHelp=Nurodykite minut\u0119 iki kurios \u0161i taisykl\u0117 TENKINAMA. U\u017Epild\u017Eius antr\u0105j\u012F laukel\u012F, taisykl\u0117 bus TENKINAMA jei minut\u0117 patenka \u012F nurodyt\u0105 interval\u0105. Reik\u0161m\u0117s nurodomos imtinai.
policyEnforcementModes.PERMISSIVE=Liberalus
auth=Autentifikacijos informacija
accessTokenLifespanImplicitFlow=Prisijungimo rakto galiojimo laikas (Implicit Flow)
scopeName=Unikalus taikymo srities pavadinimas. \u0160is pavadinimas gali vienareik\u0161mi\u0161kai identifikuoti taikymo srit\u012F. Naudingas kuomet ie\u0161koma \u0161ios tam tikros srities. 
userInfoUrlHelp=Naudotojo informacijos URL. Neprivalomas.
remainingCount=Lik\u0119s kiekis
kc.realm.name=Sritis
download=Atsisi\u0173sti
authScopes=Autorizacijos taikymo sritys
impersonate=\u012Ek\u016Bnyti
members=Nariai
host=Serveris
optimizeLookupHelp=Ar privalo b\u016Bti itrauktas pasira\u0161ymo rakto ID \u012F SAML protokolo \u017Einut\u0117s <Extensions> element\u0105 kuomet pasira\u0161omi Keycloak REDIRECT SP s\u0105sajos dokumentai? Tokiu b\u016Bdu tikrinan\u010Dioji pus\u0117 optimizuoja tikrinimo proce\u0105 naudodama tik vien\u0105 rakt\u0105 vietoj to, kad bandyt\u0173 vis\u0173 rakt\u0173 kombinacijas.
registration-access-token=Registracijos prieigos raktas klientams suteikia prieig\u0105 prie klient\u0173 registracijos paslaugos 
adminURL=Administravimo URL
settings=Nustatymai
failureFactorHelp=Pasiekus maksimal\u0173 nes\u0117kming\u0173 bandym\u0173 prisijungti skai\u010Di\u0173 \u012Fjungiamas specialus r\u0117\u017Eimas, kuomet laukimo intervalas yra didinamas po kiekvieno sekan\u010Dio neteisingo bandymo.
storeTokensHelp=Jei \u012Fgalinta, tuomet po naudotoj\u0173 prisijungimo, prieigos raktai bus i\u0161saugoti.
singleLogoutServiceUrlHelp=Adresas, kuriuo turi b\u016Bti siun\u010Diamos naudotojo atjungimo u\u017Eklausos.
ipAddress=IP adresas
useTruststoreSpi=Naudoti rakt\u0173 saugyklos SPI
storeTokens=Saugoti raktus
usermodel.clientRoleMapping.rolePrefix.tooltip=Prefiksas, pridedamas prie\u0161 kiekvien\u0105 kliento rol\u0119 (neprivalomas)
includeInIdToken.label=Prid\u0117ti prie ID rakto
browserFlow=Autentifikacijos seka
anyScope=Bet kuri taikymo sritis
serverInfo=Serverio informacija
Sunday=Sekmadienis
emailThemeHelp=Pasirinkite kaip atrodys siun\u010Diami el. pa\u0161to lai\u0161kai.
Wednesday=Tre\u010Diadienis
emailVerifiedHelp=Ar naudotojo el. pa\u0161to adresas yra patvirtintas?
addExecution=Prid\u0117ti i\u0161imt\u012F
editMode=Pakeitim\u0173 r\u0117\u017Eimas
consents=Sutikimai
canonicalization=Standartizavimo metodas
SSOSessionMax=SSO sesijos maksimalus laikas
groupMembership=Naryst\u0117 grup\u0117se
minimumQuickLoginWaitSecondsHelp=Laikas, kur\u012F naudotojo prisijungimai yra draud\u017Eiami, kai n\u0117s\u0117kmingi bandymai prisijungti seka vienas kit\u0105 per greitai.
code=Programinis kodas
fullSyncPeriod=Pilno sinchronizavimo intervalas
addNode=Prid\u0117ti mazg\u0105
jwksUrl=JWKS URL
policy-description=\u0160ios taisykl\u0117s apra\u0161ymas.
keys=Raktai
policies=Taisykl\u0117s
certificate=Sertifikatas
importClient=\u012Ediegti programos nustatymus
selectRole.label=Parinkite rol\u0119
allTypes=Visi tipai
prompts.consent=sutikimo tekstas
ldapFilter=LDAP filtras
hour=Valanda
postBrokerLoginFlowAlias=Sekan\u010Di\u0173 prisijungim\u0173 eiga
tokens=Raktai
save-admin-events=Jei \u012Fgalinta, tuomet administravimo veiksmai saugomi duomen\u0173 baz\u0117je ir tampa prieinami per administravimo valdymo skyd\u0105.
encryptAssertionsHelp=Ar SAML sprendiniai turi b\u016Bti u\u017Ekoduojami kliento vie\u0161uoju raktu naudojant AES?
policyGroups=Nurodo kurie naudotojai tenkina \u0161i\u0105 taisykl\u0119.
on=On
serviceAccount=\u012Egalina klient\u0105 autentifikuotis su Keycloak serveriu ir gauti dedikuot\u0105 prieigos rakt\u0105 skirt\u0105 \u0161iam klientui. OAuth2 specifikacijos terminais, tai rei\u0161kia 'Client Credentials Grant' teis\u0119 \u0161iam klientui.
requirement=Privalomumas
assertionConsumerServiceRedirectBindingURL=Sprendini\u0173 pri\u0117mimo paslaugos nukreipimo jungties URL
loginThemeHelp=Pasirinkite kaip atrodys J\u016Bs\u0173 prisijungimo, OTP, teisi\u0173 suteikimo, naudotoj\u0173 registracijos ir slapta\u017Eod\u017Ei\u0173 priminimo langai.
permissionDescription=\u0160io leidimo apra\u0161ymas.
multivalued.label=Daugiareik\u0161mis
minute=Minut\u0117
useJwksUrl=Naudoti JWKS URL
initialAccessToken=Pradinis prieigos raktas
vendorHelp=LDAP gamintojas (teik\u0117jas)
clustering=Klasteriai
applyToResourceType=Pritaikyti resurso tipui
rememberMe=Prisiminti mane
flow.registration=Registracijos seka
registeredClusterNodes=Registruoti klasterio mazgus
selectRole.tooltip=Kair\u0117je pus\u0117je esan\u010Diame laukelyje \u012Fveskite rol\u0117s pavadinim\u0105 arba paspauskite Rinktis nor\u0117dami nurodyti pageidaujam\u0105 rol\u0119.
storePassword=Saugyklos slapta\u017Eodis
logoutServiceRedirectBindingURLHelp=Kliento vieningo atsijungimo paslaugos SAML nukreipimo jungties. Jei naudojate kitas jungtis, tuomet \u0161ias reik\u0161mes galite palikti neu\u017Epildytas.
defaultGroups=Numatytos grup\u0117s
flow.browser=Autentifikacijos seka
editModeLdapHelp=READ_ONLY rei\u0161kia, kad LDAP saugykla bus naudojama vien tik skaitymo r\u0117\u017Eimu. WRITABLE rei\u0161kia, kad duomenys sinchronizuojami atgal \u012F LDAP pagal poreik\u012F. UNSYNCED rei\u0161kia, kad naudotoj\u0173 duomenys bus importuoti, ta\u010Diau niekuomet nesinchronizuojami atgal \u012F LDAP.
Saturday=\u0160e\u0161tadienis
includeInIdToken.tooltip=Ar privaloma informacija turi b\u016Bti pridedama prie ID rakto?
save-user-events=Jei \u012Fgalinta, tuomet su prisijungimu susij\u0119 veiksmai saugomi duomen\u0173 baz\u0117je ir tampa prieinami per administravimo bei naudotojo paskyros valdymo skydus. 
password=Slapta\u017Eodis
allowPasswordAuthentication=Leisti autentifikacij\u0105 naudojant slapta\u017Eod\u012F
composite=Sud\u0117tinis
hourHelp=Nurodykite valand\u0105 iki kurios \u0161i taisykl\u0117 TENKINAMA. U\u017Epild\u017Eius antr\u0105j\u012F laukel\u012F, taisykl\u0117 bus TENKINAMA jei valanda patenka \u012F nurodyt\u0105 interval\u0105. Reik\u0161m\u0117s nurodomos imtinai.
pairwiseSubAlgorithmSalt.tooltip=Druska naudojama porinio objekto identifikatoriaus skai\u010Diavimo metu. Jei paliekama tu\u0161\u010Dia reik\u0161m\u0117, tuomet druskos reik\u0161m\u0117 bus automatik\u0161ai sugeneruota.
clientAuthorization=Autorizacija
waitIncrementSecondsHelp=Laikas, kur\u012F naudotojo prisijungimai yra draud\u017Eiami, kai n\u0117s\u0117kming\u0173 bandym\u0173 skai\u010Dius pasiekia nustatyt\u0105 rib\u0105
allowKerberosAuthentication=Leisti Kerberos autentifikacij\u0105
events=\u012Evykiai
createPermission=Sukurti leidim\u0105
mapperType=Atitikmens tipas
edit=Redaguoti
testConnection=Tikrinti jungt\u012F
archiveFormat=Archyvo formatas
credentialResetConfirm=Si\u0173sti el. pa\u0161to lai\u0161k\u0105
kerberosRealm=Kerberos sritis
flow.direct\ grant=Tiesiogini\u0173 teisi\u0173 seka
associatedRolesText=Priskirtos rol\u0117s
defaultLocale=Numatyta kalba
clientIdHelp=Kliento identifikatorius u\u017Eregistruotas tapatyb\u0117s teik\u0117jo sistemoje.
typeHelp=\u0160io resurso tipas. Reik\u0161m\u0117 leid\u017Eia sugrupuoti skirtingus resursus turin\u010Dius t\u0105 pat\u012F tip\u0105.
htmlDisplayName=Rodomas pavadinimas HTML formatu
authorizationUrl=Autorizacijos URL
contextualAttributes=Kontekstiniai atributai
allowPasswordAuthenticationHelp=Ar suteikti galimyb\u0119 naudotojui prisijungti prie Kerberos naudojant naudotojo vard\u0105 ir slapta\u017Eod\u012F?
includeInAccessToken.tooltip=Ar privaloma informacija turi b\u016Bti pridedama prie prieigos rakto?
idpInitiatedSsoRelayStateHelp=SSO b\u016Bsenos parametro (RelayState) perdavimas kartu su IDP inicijuota SSO SAML u\u017Eklausa.
otpHashAlgorithmHelp=Kuris mai\u0161os algoritmas turi b\u016Bti naudojamas OTP generavimui.
usermodel.clientRoleMapping.clientId.tooltip=Kliento ID naudojamas roli\u0173 atribut\u0173 susiejime
clientsClientScopesHelp=Su \u0161iuo resursu susietos taikymo sritys.
vendor=Gamintojas
logoutServiceRedirectBindingURL=Atsijungimo paslaugos nukreipimo jungties URL
dayMonth=Nurodykite m\u0117nesio dien\u0105 iki kurios \u0161i taisykl\u0117 TENKINAMA. U\u017Epild\u017Eius antr\u0105j\u012F laukel\u012F, taisykl\u0117 bus TENKINAMA jei diena patenka \u012F nurodyt\u0105 interval\u0105. Reik\u0161m\u0117s nurodomos imtinai.
idpInitiatedSsoRelayState=IDP inicijuotos SSO b\u016Bsenos perdavimas
validatingX509Certs=X509 sertifikatai tikrinimui
masterSamlProcessingUrl=\u0160akninis SAML apdorojimo URL
key=Raktas
email=El. pa\u0161tas
userInfoUrl=Naudotojo informacijos URL
identityProviders=Tapatyb\u0117s teik\u0117jai
nameIdPolicyFormat=NameID taisykli\u0173 formatas
idpInitiatedSsoUrlName=Pavadinimas, kuris IDP inicijuoto SSO prisijungimo metu, perduodamas klientui per URL fragment\u0105. Palikus tu\u0161\u010Di\u0105 reik\u0161m\u0119 IDP inicjuojam\u0105 SSO prisijungimo funkcionalumas i\u0161jungiamas. \u0160is fragmentas buv naudojamas formuojant \u0161i\u0105 nuorod\u0105\: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}
ssoSessionIdle=Laikas, po kurio neaktyvi sesija bus u\u017Ebaigta. Sesijos pasibaigimo metu visi raktai (Tokens) ir nar\u0161ykli\u0173 sesijos sunaikinamos.
xFrameOptions=X-Frame-Options
scopeDescriptionHelp=Kliento \u0161ablono apra\u0161ymas
directGrant=Tiesiogini\u0173 teisi\u0173 seka
consensus=Daugumos
policyType.totp=Paremtas laiku
emailTheme=El. pa\u0161to tema
nameIdFormatHelp=Koks tapatyb\u0117s identifikatoriaus formatas turi b\u016Bti naudojamas.
adminEvents=Administravimo \u012Fvykiai
registerNodeManually=Registruoti mazg\u0105 rankiniu b\u016Bdu
serverPrincipal=Pagrindinis serveris
redirectURI=Nukreipimo URI
signDocuments=Pasira\u0161yti dokumentus
periodicFullSync=Pilnas periodinis sinchronizavimas
tokenUrl=Prieigos rakt\u0173 URL
notBefore=Ne anks\u010Diau
ldapMappersList=LDAP atitikmen\u0173 parink\u0117jai
createdAt=Suk\u016Brimo data
editUsername=Naudotojo vardo redagavimas
titleEvents=\u012Evykiai
lastRegistration=V\u0117liausia registracija
rolesHelp=Nurodykite pasirinkto naudotojo roles.
requireSsl=Reikalauti SSL
samlEntityDescriptor=Leid\u017Eia \u012Fkelti konfig\u016Bracin\u0119 rinkmen\u0105 arba nurodyti atsisiuntimo URL su i\u0161orinio IDP metaduomenimis.
reevaluate=Vertinti pakartotinai
addIdpMapperName=Atitikmens susiejimo vardas.
continue=T\u0119sti
details=Detaliau
selectScope=Parinkite taikymo srit\u012F
generateNewKeys=Generuoti naujus raktus
offlineSessionIdle=Neprisijungusios sesijos neveikimo laikas
periodicChangedUsersSync=Periodinis pakeitim\u0173 sinchronizavimas
searchScope=Paie\u0161kos apimtis
userRegistrationHelpText=\u012Egalina naudotoj\u0173 registravimosi s\u0105saj\u0105. Prisijungimo lange rodoma nuoroda \u012F registravimosi puslap\u012F.
revokeRefreshToken=Prieigos rakt\u0105 naudoti tik kart\u0105
resourceName=Unikalus resurso vardas. Vardas turi unikaliai identifikuoti resurs\u0105. Naudingas, kuomet ie\u0161koma specifini\u0173 resurs\u0173.
minimumQuickLoginWaitSeconds=Per greito bandymo prisijungti u\u017Erakinimo laikas
operationTypes=Veiksmas
realmRoles=Srities rol\u0117s
firstName=Vardas
expireTime=Nurodykite laik\u0105 po kurio \u0161i taisykl\u0117 NETENKINAMA. Teigiamas rezultatas duodamas tik tuo atveju, kuomet dabartin\u0117 data ir laikas yra ankstesni arba lygi \u0161iai reik\u0161mei.
expirationHelp=Nustato \u012Fvyki\u0173 galiojimo laik\u0105. Nebegaliojantys \u012Fvykiai periodi\u0161kai i\u0161trinami i\u0161 duomen\u0173 baz\u0117s.
nameIdFormat=NameID formatas
adminThemeHelp=Pasirinkite kaip atrodys administravimo konsol\u0117s langai.
name=Kliento \u0161ablono pavadinimas. Privalo b\u016Bti unikalus \u0161ioje srityje
validRedirectUri=Leid\u017Eiamos nukreipimo nuorodos
clientList=Klientai
userSession.modelNote.label=Naudotojo sesijos pastaba
permissionName=\u0160io leidimo pavadinimas.
expires=Galioja iki
pagination=Puslapiavimas
import=Importuoti \u0161io resurs\u0173 serverio autorizacijos nustatym\u0173 JSON rinkmen\u0105.
otpHashAlgorithm=OTP mai\u0161os algoritmas
userAttribute=Naudotojo atributas
kid=KID
description=Apra\u0161ymas
revoke=At\u0161aukti
eventListenersHelpText=Nurodykite srities \u012Fvyki\u0173 gav\u0117jus.
clientSignatureHelp=Ar kliento siun\u010Diamos SAML u\u017Eklausos ir atsakymai bus pasira\u0161yti? Jei taip, tuomet ar juos privaloma tikrinti?
keyPasswordHelp=Slapta\u017Eod\u017Ei\u0173 saugykloje esan\u010Dio privataus rakto slapta\u017Eodis
frontchannelLogout=I\u0161registravimas per nar\u0161ykl\u0119
providerId=ID
titleRoles=Srities rol\u0117s
sectorIdentifierUri.tooltip=Paslaug\u0173 teik\u0117jai, kurie naudoja porines subreik\u0161mes ir palaiko dinamin\u0119 klient\u0173 registracij\u0105 (Dynamic Client Registration) tur\u0117t\u0173 naudoti sector_identifier_uri parametr\u0105. Teikiamas funkcionalumas leid\u017Eia svetaini\u0173 grup\u0117ms, valdomoms centralizuotos administravimo panel\u0117s, tur\u0117ti pastovias porines subreik\u0161mes nepriklausomas nuo domeno vard\u0173. Tokiu b\u016Bdu klientai gali keisti domen\u0173 redirect_uri neperregistruojant vis\u0173 naudotoj\u0173.
Tuesday=Antradienis
loginTimeout=Naudotojo prisijungimui skirtas laikas
rdnLdapAttribute=RDN LDAP atributas
fineGrainSamlEndpointConfig=Detalioji SAML prieigos ta\u0161k\u0173 konfig\u016Bracija
hours=Valandos
bindType=Autentifikacijos tipas
aliasHelp=Pseudonimas, kuris vienareik\u0161mi\u0161kai identifikuoja tapatyb\u0117s teik\u0117j\u0105 ir yra naudojamas konstruojant nukreipimo nuorod\u0105.
maxFailureWaitSeconds=Maksimalus u\u017Erakinimo laikas
configure=Konfig\u016Bruoti
contextualInfo=Kontekstin\u0117 informacija
manage=Valdyti
temporaryPassword=Laikinas
applyPolicyHelp=Nurodo visas taisykles, kurios turi b\u016Bti \u012Fvertintos \u0161ios taisykl\u0117s ar leidimo taikymo sri\u010Diai.
kerberosIntegration=Kerberos intergacija
protocolMapper=Protokolas...
requiredSettings=Privalomi nustatymai
sslType.none=jokio
time=Laikas
bruteForceDetection=Grubios j\u0117gos ataka
archiveFormatHelp=Java rakt\u0173 saugykla (keystore) arba PKCS12 formato rinkmena.
xContentTypeOptions=X-Content-Type-Options
keyAlias=Rakto pseudonimas
prefix=Prefiksas, pridedamas prie\u0161 kiekvien\u0105 srities rol\u0119 (neprivalomas)
none=jokio
sslType.all=visoms u\u017Eklausoms
type=Tipas
httpPostBindingResponse=Si\u0173sti atsakymus HTTP-POST
saveEvents=Saugoti \u012Fvykius
issuer=I\u0161dav\u0117jas
policyEnforcementModeHelp=Taisykli\u0173 vykdymo r\u0117\u017Eimas nusako kaip turi b\u016Bti tenkinamos autorizacijos u\u017Eklaus\u0173 taisykl\u0117s. 'Taikyti' rei\u0161kia, kad tuo atveju kai n\u0117ra sukonfig\u016Bruota nei viena su resursu susijusi taisykl\u0117, prieiga draud\u017Eiama. 'Liberalus' rei\u0161kia, kad tuo atveju kai n\u0117ra sukonfig\u016Bruota nei viena su resursu susijusi taisykl\u0117, prieiga leid\u017Eiama. 'I\u0161jungta' rei\u0161kia, kad neatliekamas taisykli\u0173 tikrinimas ir prieiga leid\u017Eiama prie vis\u0173 resurs\u0173.
lastUpdated=Pask. kart\u0105 atnaujinta
credentialResetBtn=Prisijungimo duomen\u0173 atk\u016Brimas
selectAUser=Parinkite naudotoj\u0105
seconds=Sekund\u0117s
eventTypes.RESET_PASSWORD.name=Pakeisti slapta\u017Eod\u012F
otpPolicyDigits=Skaitmen\u0173 skai\u010Dius
permissions=Leidimai
keystore=Rakt\u0173 saugykla
accountThemeHelp=Pasirinkite kaip atrodys naudotojo profilio valdymo langai.
canonicalizationHelp=XML para\u0161o metodas.
sessions=Sesijos
fullSyncPeriodHelp=Laikas sekund\u0117mis, kas kur\u012F atliekamas pilnas naudotoj\u0173 sinchronizavimas \u012F Keycloak sistem\u0105
priority=Prioritetas
trustEmail=El. pa\u0161tas patikimas
jsonType.label=Privalomo atributo JSON tipas
fullScopeAllowed=Taikymas pilna apimtimi
push=Informuoti apie at\u0161aukim\u0105
titleUsers=Naudotojai
masterSamlProcessingUrlHelp=Kuomet sukonfig\u016Bruotas, \u0161is URL bus naudojamas visoms, 'SP Assertion Consumer' ir 'Single Logout Services' u\u017Eklausoms. Detalioje SAML prieigos adres\u0173 konfig\u016Bravimo skyriuje \u0161ios reik\u0161m\u0117s gali b\u016Bti atskirai pakeistos.
claimJsonType=Naudojamas JSON lauko tipas, kuris turi b\u016Bti u\u017Epildomas rakto privalomoje JSON informacijoje. Galimi tipai\: long, int, boolean ir String.
forceAuthenticationHelp=Jei \u012Fgalinta, tuomet tapatyb\u0117s teik\u0117jas privalo autentifikuoti naudotoj\u0105 i\u0161 naujo nepasitikint ankstesniu prisijungimu.
testClusterAvailability=Tikrinti ar mazgas prieinamas
forceNameIdFormat=Priverstinai naudoti NameID format\u0105
sslType.external=i\u0161orin\u0117ms u\u017Eklausoms
multiValued=Nurodo, kad atributas gali tur\u0117ti daugiau nei vien\u0105 reik\u0161m\u0119. Jei pa\u017Eym\u0117tas, tuomet visos reik\u0161m\u0117s nustatomos kaip privalomos. Kitu atveju privaloma tik pirmoji reik\u0161m\u0117.
addRole=Prid\u0117ti rol\u0119
userInfoSignedResponseAlgorithmHelp=JWA algoritmas naudojamas pasira\u0161yti naudotojo informacijos prieigos ta\u0161ko atsak\u0105. Jei nustatyta 'unsigned', tuomet naudotojo informacijos atsakas nebus pasira\u0161ytas ir bus gr\u0105\u017Eintas application/json formatu.
lastName=Pavard\u0117
usermodel.realmRoleMapping.rolePrefix.label=Srities rol\u0117s prefiksas
temporaryPasswordHelpText=Jei \u012Fgalinta, tuomet naudotojas prival\u0117s pasikeisti slapta\u017Eod\u012F sekan\u010Dio prisijungimo metu
otpPolicyDigitsHelp=Kiek OTP tur\u0117t\u0173 tur\u0117ti skaitmen\u0173?
connectionPooling=Jung\u010Di\u0173 buferizavimas
wantAuthnRequestsSignedHelp=Nurodykite, ar tapatyb\u0117s teik\u0117jas tikisi pasira\u0161yt\u0173 AuthnRequest u\u017Eklaus\u0173.
enabled=\u012Egalintas
authenticationAliasHelp=Konfig\u016Bracijos pavadinimas
keyPassword=Rakto slapta\u017Eodis
SSOSessionIdle=SSO sesijos neveikimo laikas
ssoServiceUrlHelp=Adresas, kuriuo turi b\u016Bti siun\u010Diamos autentifikacijos u\u017Eklausos (SAML AuthnRequest).
startTime=Nurodykite laik\u0105 iki kurio \u0161i taisykl\u0117 NETENKINAMA. Teigiamas rezultatas duodamas tik tuo atveju, kuomet dabartin\u0117 data ir laikas yra v\u0117lesn\u0117 arba lygi \u0161iai reik\u0161mei.
logicHelp=Logika nurodo kaip turi b\u016Bti tenkinama taisykl\u0117. Jei nurodyta 'Teigiama', tuomet \u0161ios taisykl\u0117s vykdymo metu gautas rezultatas (leisti arba drausti) bus naudojamas sprendinio pri\u0117mimui. Jei nurodyta 'Neigiama', tuomet \u0161ios taisykl\u0117s vykdymo rezultatas bus paneigtas, t.y. leid\u017Eiama taps draud\u017Eiama ir atvirk\u0161\u010Diai.
copy=Kopijuoti
monthHelp=Nurodykite m\u0117nes\u012F iki kurio \u0161i taisykl\u0117 TENKINAMA. U\u017Epild\u017Eius antr\u0105j\u012F laukel\u012F, taisykl\u0117 bus TENKINAMA jei m\u0117nesis patenka \u012F nurodyt\u0105 interval\u0105. Reik\u0161m\u0117s nurodomos imtinai.
registrationAccessToken=Registracijos prieigos raktas
supportedLocales=Palaikomos kalbos
showPasswordDataValue=Reik\u0161m\u0117
issuerHelp=I\u0161dav\u0117jo identifikatorius perduodamas i\u0161dav\u0117jo atsakyme. Tikrinimas nebus atliekamas jei reik\u0161m\u0117 tu\u0161\u010Dia.
titleSessions=Sesijos
clientNameHelp=Reik\u0161m\u0117, kuri rodoma naudotojams. Pavyzd\u017Eiui 'My Client'. Galimos lokalizuotos reik\u0161m\u0117s - pavyzd\u017Eiui\: ${my_client}
createPolicy=Sukurti taisykl\u0119
clearAdminEvents=I\u0161valyti administravimo \u012Fvykius
rootURL=Prie reliatyvi\u0173 nuorod\u0173 pridedamas \u0161akninis URL
rootUrl=\u0160akninis URL
clientLoginTimeout=Kliento prisijungimui skirtas laikas
nodeReRegistrationTimeoutHelp=Nurodykite maksimal\u0173 laiko interval\u0105, per kur\u012F mazgai privalo i\u0161 naujo prisiregistruoti. Jei mazgas neatsi\u0173s persiregistravimo u\u017Eklausos per nurodyt\u0105 laik\u0105, tuomet \u0161is mazgas bus i\u0161registruojamas i\u0161 Keycloak 
clientAuthentication=Klient\u0173 autentifikacijos seka
registrationEmailAsUsername=El. pa\u0161tas kaip naudojo vardas
logicType.negative=Neigiama
otpPolicy=OTP taisykl\u0117s
flow-type.form-flow=form
signDocumentsHelp=Ar SAML dokumentai turi b\u016Bt\u012F pasira\u0161omi \u0161ios srities?
resetPassword=Pakeisti slapta\u017Eod\u012F
requireSslHelp=Ar HTTPS privalomas? 'niekada' - HTTPS nereikalaujamas. 'i\u0161orin\u0117ms u\u017Eklausoms' - jungiantis i\u0161 localhost ar serverio IP adres\u0173 galima prieiti ir per HTTP. 'visoms u\u017Eklausoms' - HTTPS reikalaujamas jungiantis i\u0161 vis\u0173 IP adres\u0173.
identityInformation=Tapatyb\u0117s informacija
addUser=Prid\u0117ti naudotoj\u0105
usermodel.clientRoleMapping.rolePrefix.label=Kliento rol\u0117s prefiksas
partialImport=Dalinis duomen\u0173 importavimas
includeAuthnStatementHelp=Ar prisijungimo b\u016Bdas ir laikas \u0161ur\u0117t\u0173 b\u016Bti \u012Ftraukiami \u012F prisijungimo operacijos atsakym\u0105?
client-authenticator-type=Kliento autentifikavimo priemon\u0117s naudojamos kliento autentifikavimuisi \u012F Keycloak server\u012F
protocol=Protokolas
manageAccount=Valdyti paskyr\u0105
tokenClaimName.label=Reikalaujamo rakto pavadinimas
create=Sukurti
clientSecret=Kliento slaptas kodas
from=Nuo
httpPostBindingAuthnRequest=Si\u0173sti AuthnRequest HTTP-POST 
includeInAccessToken.label=Prid\u0117ti prie prieigos rakto
iconUri=Ikonos URI
createGroup=Sukurti grup\u0119
resource=Resursas
created=Sukurta
minutes=Minut\u0117s
userSession.modelNote.tooltip=I\u0161saugotos naudotojo sesijos pastaba, kuri saugoma UserSessionModel.note rinkinyje.
usersDN=Naudotoj\u0173 DN
clientsClientTypeHelp='OpenID connect' leid\u017Eia klientams tikrinti galutinio naudotojo tapatyb\u0119 remiantis autorizacijos serverio atlikta autentifikacija. 'SAML' \u012Fgalina \u017Einiatinklio, \u012Fskaitant skirting\u0173 domen\u0173 atvejus, vieningos autentifikacijos ir autorizacijos scenarijus perduodant informacij\u0105 saugiose \u017Einut\u0117se.
selectUser=Nurodykite naudotoj\u0105, kurio vardu atliekamas teisi\u0173 serveryje filtravimas.
webOriginsHelp=Leid\u017Eiamos CORS nuorodos. Nor\u0117dami leisti nukreipim\u0105 \u012F teisingas nuorodas, naudokite '+'. Nor\u0117dami leisti visas nuorodas, naudokite '*'.
requestObjectSignatureAlgorithm=U\u017Eklausos objekto para\u0161o algoritmas
logoutUrl=Atsijungimo URL
storedTokensReadable=Saugoti raktus skaitomame formate
admin-clearEvents=I\u0161trina visus su administravimu susijusius veiksmus i\u0161 duomen\u0173 baz\u0117s.
mappers=Atribut\u0173 atitikmenys
waitIncrementSeconds=Laukimo laiko didinimas po
usermodel.prop.label=Atributas
name-id-format=NameID formatas
credentials=Prisijungimo duomenys
policyType.hotp=Paremtas skaitliuku
enableSSL=\u012Egalinti SSL
general=Bendra informacija
failureFactor=Maksimalus bandym\u0173 prisijungim\u0173 skai\u010Dius
signAssertions=Pasira\u0161yti sprendinius
scopesSelect=Nurodo, kad \u0161is leidimas turi b\u016Bti pritaikytas vienai ar daugiau taikymo sri\u010Di\u0173.
disableUserInfoHelp=Ar u\u017Edrausti prieig\u0105 prie papildomos naudotojo profilio informacijos per User Info paslaug\u0105? Numatyta reik\u0161m\u0117 - naudoti \u0161i\u0105 OIDC paslaug\u0105.
adminTheme=Administravimo konsol\u0117s tema
alias=Pseudonimas
value=Reik\u0161m\u0117
clientSecretHelp=Kliento saugos kodas u\u017Eregistruotas tapatyb\u0117s teik\u0117jo sistemoje.
validateSignatures=\u012Ejungti/i\u0161jungti SAML atsakym\u0173 para\u0161o tikrinim\u0105.
authentication=Autentifikavimas
descriptionHelp=Kliento \u0161ablono apra\u0161ymas
logoutUrlHelp=Adresas, kuris turi b\u016Bti naudojamas norint atjungti naudotoj\u0105 nuo i\u0161orinio tapatyb\u0117s teik\u0117jo.
times.seconds=Sekund\u0117s
permissionType=Nurodykite, kad \u0161i taisykl\u0117 turi b\u016Bti taikoma visiems \u0161io tipo resursams.
policyEnforcementModes.ENFORCING=Taikyti
debug=Derinti
clear=I\u0161valyti
resources=Resursai
groups=Visos grup\u0117s, kuri\u0173 narys yra \u0161is naudotojas. Pa\u017Eym\u0117kite grup\u0119 ir paspauskite 'Palikti' nor\u0117dami pa\u0161alinti naudotoj\u0105 i\u0161 grup\u0117s.
logicType.positive=Teigiama
signatureAlgorithm=Para\u0161o algoritmas naudojamas dokument\u0173 pasira\u0161ymui.
eventTypes.LOGOUT.name=Seanso pabaiga
accountTheme=Naudotojo profilio tema
requiredActions=Privalomi veiksmai
forceAuthentication=Priverstin\u0117 autentifikacija
assertionConsumerServiceRedirectBindingURLHelp=Kliento sprendinio pri\u0117mimo paslaugos SAML nukreipimo jungties URL (prisijungimo atsakymams). Jei toki\u0173 jung\u010Di\u0173 neturite, tuomet palikite tu\u0161\u010Dias reik\u0161mes.
policyDecisionStagey=Sprendimo strategija nurodo kaip priimamas galutinis sprendimas, kuomet yra vykdomos visos \u0161io leidimo taisykl\u0117s. 'Pozityvi' rei\u0161kia, kad galutiniam teigiamam sprendimui turi b\u016Bti tenkinama bent viena taisykl\u0117. 'Vienbals\u0117' rei\u0161kia, kad galutiniam teigiamam sprendimui visos taisykl\u0117s turi b\u016Bti teigiamos. 'Daugumos' rei\u0161kia, kad galutinis teigiamas sprendimas bus priimtas tuomet, kai teigiam\u0173 taisykli\u0173 bus daugiau nei neigiam\u0173. Jei teigiam\u0173 ir neigiam\u0173 taisykli\u0173 skai\u010Dius yra vienodas, tuomet galutinis rezultatas bus neigiamas.
resetActions=Atkurti veiksmus
selectARole=Pasirinkti rol\u0119
titleAuthentication=Autentifikavimas
category=Kategorija
batchSize=Paketo dydis
usermodel.prop.tooltip=S\u0105sajos UserModel atributo metodo pavadinimas. Pavyzd\u017Eiui reik\u0161m\u0117 'email' atitinka UserMode.getEmail() metod\u0105.
user=Naudotojas
times.days=Dienos
providers=Teik\u0117jai
