#converted from translation.json
#Thu Oct 26 10:29:30 CEST 2023
otpTypeHelp=totp is Time-Based One Time Password. 'hotp' is a counter base one time password in which the server keeps a counter to hash against.
useKerberosForPasswordAuthentication=Utilizar Kerberos para autentica\u00E7\u00E3o via senha
anyResource=Qualquer recurso
themes=Temas
addClientScope=Adicionar modelo de cliente
clientType='OpenID connect' permite aos Clientes verificarem a identidade do usu\u00E1rio final baseado na autentica\u00E7\u00E3o realizada por um servidor de Autoriza\u00E7\u00E3o. 'SAML' permite cen\u00E1rios de autentica\u00E7\u00E3o e autoriza\u00E7\u00E3o web-based incluindo cross-domain single sign-on (SSO) e utiliza tokens de seguran\u00E7a contendo assertions para trafegar informa\u00E7\u00F5es.
clientSignature=Assinatura do cliente requerida
unanimous=Un\u00E2nime
policy-name=The name of this policy.
clientHelp=Select the client making this authorization request. If not provided, authorization requests would be done based on the client you are in.
debugHelp=Habilita/Desabilita log de n\u00EDvel debug para a sa\u00EDda padr\u00E3o para Krb5LoginModule.
validatorColNames.colConfig=Configura\u00E7\u00E3o
nodeHost=Host
quickLoginCheckMilliSeconds=Se uma falha ocorre concorrentemente neste per\u00EDodo, travar a conta do usu\u00E1rio.
unspecified=N\u00E3o especificado
signOut=Sign Out
validatorDialogColNames.colName=Nome do Role
credentialType=Tipo
certificateHelp=Certificado do cliente para validar JWT emitidos pelo cliente e assinados pela chave privada do cliente da sua keystore.
forcePostBindingHelp=Sempre utilizar POST para respostas.
roleName=Nome do Role
operationType=Tipo de opera\u00E7\u00E3o
httpPostBindingAuthnRequestHelp=Indica se o AuthnRequest deve ser enviado utilizando HTTP-POST. Se falso, HTTP-REDIRECT ser\u00E1 utilizado.
policyEnforcementMode=Modo de execu\u00E7\u00E3o da pol\u00EDtica
decisionStrategy=Estrat\u00E9gia de decis\u00E3o
requiredUserActionsHelp=Require an action when the user logs in. 'Verify email' sends an email to the user to verify their email address. 'Update profile' requires user to enter in new personal information. 'Update password' requires user to enter in a new password. 'Configure OTP' requires setup of a mobile password generator.
securityDefences=Defesas
realmSettings=Configura\u00E7\u00F5es do Realm
deleteEvents=Limpar eventos
accessTokenLifespanHelp=Tempo m\u00E1ximo antes que um token de acesso expire. Recomenda-se que este valor seja menor em rela\u00E7\u00E3o ao tempo de inativa\u00E7\u00E3o do inativa\u00E7\u00E3o do SSO.
redirectURIHelp=A url de redirecionamento para usar quando da configura\u00E7\u00E3o do provedor de identidade.
resourcePath=Path do recurso
applyToResourceTypeHelp=Specifies if this permission would be applied to all resources with a given type. In this case, this permission will be evaluated for all instances of a given resource type.
attestationPreference.none=Nenhum
revocation=Revoga\u00E7\u00E3o
clientDescriptionHelp=Especifica a descri\u00E7\u00E3o do cliente. Por exemplo 'Meu cliente para TimeSheets'. Tamb\u00E9m aceita chaves para valores localizados. Por exemplo\: ${meu_cliente_descricao}
clientAuthenticator=Autenticador do cliente
useEntityDescriptor=Importar metadata de um descritor de entidade IDP SAML remoto.
loginActionTimeout=Tempo limite da a\u00E7\u00E3o de Login
updateFirstLoginHelp=Atualizar o perfil no primeiro login
validRedirectURIs=Padr\u00E3o de URI v\u00E1lido para onde um navegador pode redirecionar depois de um login bem-sucedido ou sair. Wildcards simples s\u00E3o permitidos, por exemplo 'http\://example.com/*'. Caminhos relativos podem ser especificados tamb\u00E9m, ex\: /my/relative/path/*. Caminhos relativos s\u00E3o relativos \u00E0 URL raiz do cliente, ou se nenhum for especificado a URL raiz do servidor \u00E9 usado. Para SAML, \u00E9 necess\u00E1rio definir padr\u00F5es de URI v\u00E1lidos se voc\u00EA est\u00E1 contando com a URL do servi\u00E7o consumidor incorporada com a solicita\u00E7\u00E3o de login.
assertionConsumerServicePostBindingURL=URL para conex\u00E3o post para o servi\u00E7o consumidor de Assertions
usermodel.clientRoleMapping.clientId.label=ID do cliente
endpoints=Endpoints
clientId=ID do cliente
validatingX509CertsHelp=O certificado em formato PEM que deve ser usado para verificar assinaturas.
contextualAttributesHelp=Any attribute provided by a running environment or execution context.
importFile=Importar arquivo
clientLoginTimeoutHelp=Tempo m\u00E1ximo que um cliente tem para finalizar o procolo do token de acesso. Normalmente deve ser 1 minuto.
lastAccess=\u00DAltimo acesso
protocolHelp=Qual configura\u00E7\u00E3o de protocolo SSO ser\u00E1 provida por este modelo de cliente.
uiDisplayName=Nome de exibi\u00E7\u00E3o no UI
prompts.none=Nenhum
resourcesHelp=Specifies that this permission must be applied to a specific resource instance.
adminEventsSettings=Configura\u00E7\u00E3o de eventos de administra\u00E7\u00E3o
emailVerified=E-mail verificado
passwordConfirmation=Confirma\u00E7\u00E3o de senha
times.minutes=Minutos
forcePostBinding=For\u00E7ar Binding via POST
defaultRoles=Roles padr\u00E3o
discoveryEndpoint=Importar metadata de um descritor de descoberta remoto do IDP.
countHelp=Especifica quantos clientes podem ser criados usando o token
otpPolicyPeriod=Per\u00EDodo de token OTP 
uuidLdapAttribute=Atributo LDAP para UUID
topLevelFlowType=What kind of top level flow is it? Type 'client' is used for authentication of clients (applications) when generic is for users and everything else
scopeNameHelp=Nome do modelo de cliente. Deve ser \u00FAnico neste Realm.
requiredUserActions=A\u00E7\u00F5es necess\u00E1rias do usu\u00E1rio
flowTypeHelp=What kind of form is it
consentRequired=Se habilitado os usu\u00E1rios devem consentir com o acesso ao cliente.
allowRemoteResourceManagement=Administra\u00E7\u00E3o remota de recursos
standardFlow=Isto habilita a autentica\u00E7\u00E3o baseada em redirecionamento com c\u00F3digo de autoriza\u00E7\u00E3o padr\u00E3o do OpenID Connect. Em termos de especifica\u00E7\u00F5es OpenID Connect ou OAuth2, isto habilita suporte ao 'Fluxo de C\u00F3digo de Autoriza\u00E7\u00E3o' para este cliente.
identityProvider=Provedor de identifica\u00E7\u00E3o
eventListeners=Listeners de eventos
bindDn=Bind DN
identityProviderLinks=Links de provedores de identifica\u00E7\u00E3o.
leave=Sair
eventTypes.IMPERSONATE.name=Personificar
wantAuthnRequestsSigned=Esperar AuthnRequests assinados
usermodel.attr.tooltip=Nome do atributo do usu\u00E1rio que \u00E9 uma chave de atributo no mapa UserModel.attribute.
export=Exportar
add=Adicionar
passwordPolicy=Pol\u00EDtica de senha
backchannelLogout=Backchannel Logout
count=Quantidade
testAuthentication=Testar autentica\u00E7\u00E3o
prompts.login=Login
users=Usu\u00E1rios
offlineSessionIdleHelp=Tempo que uma sess\u00E3o offline pode ficar inativa antes de expirar. Voc\u00EA precisa utilizar um token de atualiza\u00E7\u00E3o offline pelo menos uma vez neste per\u00EDodo, caso contr\u00E1rio a sess\u00E3o offline ser\u00E1 expirada.
uris=An URI that can also be used to uniquely identify this resource.
forceNameIdFormatHelp=Ignora o NameID de assunto solicitado e utiliza o configurado no UI de administra\u00E7\u00E3o.
port=Porta
expiration=Dura\u00E7\u00E3o
realmRolePrefix=Prefixo do Realm Role
logoutServicePostBindingURL=URL de conex\u00E3o POST para o servi\u00E7o de logout
includeRepresentation=Incluir representa\u00E7\u00E3o
assertionConsumerServicePostBindingURLHelp=URL de liga\u00E7\u00E3o SAML via post para as asser\u00E7\u00F5es de consumidor de servi\u00E7os do cliente (respostas de login). Voc\u00EA pode deixar este campo em branco se voc\u00EA n\u00E3o tiver uma URL para esta liga\u00E7\u00E3o.
singleLogoutServiceUrl=URL de servi\u00E7o de Single Logout
roles=Roles
includeInUserInfo.label=Adicionar \u00E0 informa\u00E7\u00E3o do usu\u00E1rio
back=Voltar
validateSignatureHelp=Habilita/Desabilita a valida\u00E7\u00E3o de assinatura de IDP externo.
policyCode=The JavaScript code providing the conditions for this policy.
title=Autentica\u00E7\u00E3o
verifyEmail=Verificar e-mail
representation=Representa\u00E7\u00E3o
remove=Remover
formatOption=Formato
loginTheme=Tema de login
provider=Provedor
flows=Fluxos
scope=Escopo
nodeReRegistrationTimeout=Tempo limite para re-registro de n\u00F3
client=cliente
includeRepresentationHelp=Include JSON representation for create and update requests.
connectionURL=URL de conex\u00E3o
accessTokenLifespan=Dura\u00E7\u00E3o do Token de Acesso
setToNow=Definir como agora
signAssertionsHelp=Devem as asser\u00E7\u00F5es dentro dos documentos SAML serem assinadas? Esta configura\u00E7\u00E3o n\u00E3o \u00E9 necess\u00E1ria se o documento j\u00E1 est\u00E1 sendo assinado.
firstBrokerLoginFlowAliasHelp=Alias do fluxo de autentica\u00E7\u00E3o que ser\u00E1 invocado depois do primeiro login com este provedor de identifica\u00E7\u00E3o. O termo 'Primeiro Login' significa que ainda n\u00E3o existe uma conta no Keycloak ligada a esta conta autenticada neste provedor.
owner=Propriet\u00E1rio
validateSignature=Validar assinaturas
implicitFlow=Isto habilita suporte a autentica\u00E7\u00E3o baseada em redirecionamento sem c\u00F3digo de autoriza\u00E7\u00E3o. Em tempos de especifica\u00E7\u00F5es OpenID Connect ou OAuth2, isto habilita suporte do 'Fluxo Impl\u00EDcito' para este cliente.
headers=Cabe\u00E7alhos
encryptAssertions=Encriptar Assertions
keyAliasHelp=Alias do arquivo para sua chave privada e certificado.
tokenClaimName.tooltip=Nome do claim para inserir no token. Pode ser um nome completo (fully qualified) como 'address.street'. Neste caso, um objeto json aninhado ser\u00E1 criado.
userName=Usu\u00E1rio
clientProfileDescription=Descri\u00E7\u00E3o
userObjectClasses=Classes do objeto User
ssoSessionMax=Tempo m\u00E1ximo antes que uma sess\u00E3o seja expirada. Tokens e sess\u00F5es de navegador s\u00E3o invalidados quando uma sess\u00E3o \u00E9 expirada.
policyRoles=Especifica quais role(s) do *cliente* s\u00E3o permitidos por esta pol\u00EDtica.
times.hours=Horas
browserFlowHelp=Select the flow you want to use for browser authentication.
temporaryLocked=The user may have been locked due to failing to login too many times.
webOrigins=Permitir origens CORS. Para permitir todas as URIs de redirecionamento de origem v\u00E1lidas adicionar '+'. Para permitir todas as origens adicionar '*'.
realm=Realm
prompt=Prompt
username=Usu\u00E1rio
showAuthData=Exibir dados da autoriza\u00E7\u00E3o
importConfig=Importar metadata fr um descritor de descoberta baixado do IDP.
includeInUserInfo.tooltip=O claim deve ser adicionado \u00E0 informa\u00E7\u00E3o do usu\u00E1rio?
initialCounter=Contador inicial
revokeRefreshTokenHelp=Se habilitado os tokens de atualiza\u00E7\u00E3o podem ser utilizados somente uma vez. Caso contr\u00E1rio os tokens de atualiza\u00E7\u00E3o n\u00E3o s\u00E3o revogados quando utilizados e podem ser utilizados v\u00E1rias vezes.
storedTokensReadableHelp=Habilita/desabilita se novos usu\u00E1rios podem ler quaisquer tokens salvo. Isto ir\u00E1 adicionar o role broker.read-token.
authenticationFlowTypeHelp=What kind of form is it
authorization=Enable/Disable fine-grained authorization support for a client
editUsernameHelp=Se habilitado, o campo nome de usu\u00E1rio \u00E9 edit\u00E1vel, sen\u00E3o ser\u00E1 apenas leitura.
consoleDisplayConnectionUrlHelp=Conex\u00E3o URL para o seu servidor LDAP
bindCredentialsHelp=Senha do administrador do LDAP
action=A\u00E7\u00F5es
join=Participar
id=ID
fullScopeAllowedHelp=Permite a voc\u00EA desabilitar todas as restri\u00E7\u00F5es.
applyPolicy=Aplicar pol\u00EDtica
otpType=Tipo OTP
directGrantHelp=Select the flow you want to use for direct grant authentication.
scopesHelp=Os escopos que ser\u00E3o enviados ao solicitar autoriza\u00E7\u00E3o. Pode ser uma lista de escopos separadas por espa\u00E7o. Valor padr\u00E3o \u00E9 'openid'.
includeAuthnStatement=Incluir AuthnStatement
jsonType.tooltip=Tipo JSON que deve ser utilizado para popular o claim json no token. Os valores v\u00E1lidos s\u00E3o Long, int boolean e String.
multivalued.tooltip=Indica se um atributo suporta m\u00FAltiplos valores. Se verdadeiro, ent\u00E3o a lista de todos os valores desse atributo ser\u00E1 definida como o claim. Se falso, ent\u00E3o apenas o primeiro valor ser\u00E1 utilizado.
enableStartTLS=Habilitar StartTLS
enableStartTls=Habilitar StartTLS
addIdPMapper=Adicionar mapeamento de provedor de identifica\u00E7\u00E3o
eventType=Tipo de evento
homeURL=URL padr\u00E3o para utilizar quando o servidor de autentica\u00E7\u00E3o necessita redirecionar ou linkar para o cliente.
firstBrokerLoginFlowAlias=Fluxo do primeiro login
usermodel.attr.label=Atributo do usu\u00E1rio
eventTypes.REGISTER.name=Registro
rememberMeHelpText=Exibe um checkbox na p\u00E1gina de login para permitir ao usu\u00E1rio continuar logado entre restarts do browser at\u00E9 que a sess\u00E3o expire.
usernameLdapAttribute=Atributo LDAP para Username
evaluate=Avaliar
ssoServiceUrl=URL de servi\u00E7o do Single Sign On
allowRemoteResourceManagementHelp=Should resources be managed remotely by the resource server? If false, resources can only be managed from this Admin UI.
clients=Clientes
changedUsersSyncPeriod=Per\u00EDodo
clientName=Nome
userRegistration=Cadastro de usu\u00E1rio
save=Salvar
login=Login
maxDeltaTimeSeconds=Tempo para zerar falhas
backchannelLogoutHelp=O IDP externo suporta logou via backchannel?
usermodel.realmRoleMapping.rolePrefix.tooltip=Um prefixo para cada Realm Role (opcional).
affirmative=Afirmativa
changedUsersSyncHelp=Intervalo para sincroniza\u00E7\u00E3o dos usu\u00E1rios alterados ou novos do LDAP em segundos.
trustEmailHelp=Se habilitado ent\u00E3o o e-mail provido por este provedor n\u00E3o ser\u00E1 verificado mesmo que a verifica\u00E7\u00E3o esteja habilitada para este realm.
maxFailureWaitSecondsHelp=Tempo m\u00E1ximo que um usu\u00E1rio dever\u00E1 aguardar ap\u00F3s uma falha de quick login.
maxDeltaTimeSecondsHelp=Quando o contador de falhas ser\u00E1 resetado?
adminURLHelp=URL para a inteface administrativa do cliente. Defina este valor se o cliente suporta a API do adaptador REST. Esta API rest permite que o servidor de autentica\u00E7\u00E3o envie pol\u00EDticas de revoga\u00E7\u00E3o e outras tarefas administrativas. Geralmente este valor \u00E9 definido apontando para a URL base do cliente.
otpPolicyPeriodHelp=How many seconds should an OTP token be valid? Defaults to 30 seconds.
contentSecurityPolicy=Content-Security-Policy
storePasswordHelp=Senha para acessar o arquivo em si.
frontchannelLogoutHelp=Quando marcado, o logout requer um redirecionamento do browser para o cliente. Caso contr\u00E1rio o servidor executo uma invoca\u00E7\u00E3o em background para o logout.
userFederation=Federa\u00E7\u00E3o de usu\u00E1rios
directAccess=Habilita o suporte para concess\u00F5es de acesso direto (Direct Access Grants), o que significa que o cliente tem acesso ao nome de usu\u00E1rio/senha e negocia diretamente com o servidor Keycloak pelo token de acesso. Em termos de especifica\u00E7\u00F5es OAuth2, habilita suporte de "Resource Owner Password Credentials Grant" para este cliente.
attributes=Atributos
logic=L\u00F3gica
scopes=Escopos
resourceType=Tipo de recurso
flowType=Flow Type
policyEnforcementModes.PERMISSIVE=Permissiva
auth=Autentica\u00E7\u00E3o
accessTokenLifespanImplicitFlow=Dura\u00E7\u00E3o do token de acesso para fluxos Impl\u00EDcitos
scopeName=An unique name for this scope. The name can be used to uniquely identify a scope, useful when querying for a specific scope.
userInfoUrlHelp=A Url de informa\u00E7\u00F5es de usu\u00E1rio. Opcional.
remainingCount=Quantidade restante
kc.realm.name=Realm
download=Download
authScopes=Autoriza\u00E7\u00E3o de escopos
impersonate=Personificar
members=Membros
host=Host
registration-access-token=O token de acesso para registro prov\u00EA acesso aos cliente para o servi\u00E7o de registro cliente.
adminURL=URL do administrador
settings=Configura\u00E7\u00F5es
failureFactorHelp=Quantas falhas de login antes que a espera seja habilitada.
storeTokensHelp=Habilita/desabilita se os tokens deve ser guardados depois de autenticar os usu\u00E1rios.
singleLogoutServiceUrlHelp=A Url que deve ser utilizada para enviar solicita\u00E7\u00F5es de logout.
ipAddress=Endere\u00E7o IP
useTruststoreSpi=Utilizar Truststore SPI
storeTokens=Salvar Tokens
usermodel.clientRoleMapping.rolePrefix.tooltip=Um prefixo para cada role do cliente (opcional)
includeInIdToken.label=Adicionar ao token de ID
browserFlow=Fluxo de browser
anyScope=Qualquer escopo
serverInfo=Informa\u00E7\u00E3o do servidor
emailThemeHelp=Selecione o tema para os e-mail que s\u00E3o enviados pelo servidor.
emailVerifiedHelp=Has the user's email been verified?
addExecution=Adicionar execu\u00E7\u00E3o
editMode=Modo de edi\u00E7\u00E3o
consents=Consentimentos
canonicalization=M\u00E9todo de Canonicalization 
SSOSessionMax=Sess\u00E3o SSO M\u00E1xima
groupMembership=Grupos associados
minimumQuickLoginWaitSecondsHelp=Quanto tempo aguardar ap\u00F3s uma falha de quick login.
code=C\u00F3digo
fullSyncPeriod=Per\u00EDodo
addNode=Adicionar n\u00F3
policy-description=A description for this policy.
policies=Pol\u00EDticas
certificate=Certificado
importClient=Importar cliente
selectRole.label=Selecione o Role
allTypes=Todos os tipos
prompts.consent=Consentimento
ldapFilter=Filtro do LDAP
postBrokerLoginFlowAlias=Fluxo p\u00F3s login
tokens=Tokens
save-admin-events=If enabled admin events are saved to the database which makes events available to the Admin UI.
encryptAssertionsHelp=Devem as asser\u00E7\u00F5es SAML serem encriptadas com a chave p\u00FAblica do cliente usando AES?
policyGroups=Specifies which user(s) are allowed by this policy.
serviceAccount=Permite autenticar este cliente no Keycloak e recuperar tokens de acesso dedicados para este cliente. Em termos da especifica\u00E7\u00F5es OAuth2, habilita suporte para 'Client Credentials Grants' para este cliente.
requirement=Condi\u00E7\u00E3o
assertionConsumerServiceRedirectBindingURL=URL para conex\u00E3o de redirecionamento do servi\u00E7o consumidor de Assertions
loginThemeHelp=Selecione o tema para p\u00E1ginas de login, OTP, grant, cadastro e recuperar senha.
permissionDescription=A description for this permission.
multivalued.label=M\u00FAltiplos valores
initialAccessToken=Token de acesso inicial
vendorHelp=LDAP vendor (provedor)
applyToResourceType=Aplicar ao tipo de recurso
rememberMe=Lembrar me
flow.registration=Fluxo de registro
registeredClusterNodes=N\u00F3s de cluster registrados
selectRole.tooltip=Entre com o role na caixa \u00E0 esquerda, ou clique neste bot\u00E3o para navegar e selecionar o role desejado.
storePassword=Salvar senha
logoutServiceRedirectBindingURLHelp=URL de liga\u00E7\u00E3o SAML de redirecionamento  para o servi\u00E7o de logout \u00FAnico do cliente. Voce pode deixar este campo em branco s e estiver usando uma liga\u00E7\u00E3o diferente.
defaultGroups=Grupos Padr\u00E3o
flow.browser=Fluxo de browser
editModeLdapHelp=READ_ONLY \u00E9 um LDAP somente leitura. WRITABLE significa que os dados ser\u00E3o sicronizados de volta para o LDAP on demand. UNSYNCED significa que os dados do usu\u00E1rio ser\u00E3o importados, mas n\u00E3o sicronizados de volta para o LDAP.
includeInIdToken.tooltip=O claim deve ser adicionado ao token de ID?
save-user-events=If enabled login events are saved to the database which makes events available to the Admin and Account management UIs.
password=Senha
allowPasswordAuthentication=Permitir autentica\u00E7\u00E3o via senha
composite=Composto
clientAuthorization=Autoriza\u00E7\u00E3o
waitIncrementSecondsHelp=Quando a quantidade de falhas for alcan\u00E7ada, quanto tempo o usu\u00E1rio deve aguardar antes de tentar novamente?
allowKerberosAuthentication=Permitir autentica\u00E7\u00E3o Kerberos
events=Eventos
createPermission=Criar permiss\u00E3o
mapperType=Tipo de mapeamento
testConnection=Testar conex\u00E3o
edit=Editar
archiveFormat=Formato do arquivo
credentialResetConfirm=Enviar e-mail
kerberosRealm=Realm do Kerberos
flow.direct\ grant=Fluxo de Direct Grant
associatedRolesText=Roles associados
defaultLocale=Local padr\u00E3o
clientIdHelp=O identificador do cliente registrado com o provedor de identifica\u00E7\u00E3o.
typeHelp=The type of this resource. It can be used to group different resource instances with the same type.
htmlDisplayName=Nome de exibi\u00E7\u00E3o HTML
authorizationUrl=URL de autoriza\u00E7\u00E3o
flow-type.basic-flow=gen\u00E9rico
contextualAttributes=Atributos contextuais
allowPasswordAuthenticationHelp=Habilita/Desabilita a possibilidade de autentica\u00E7\u00E3o via usu\u00E1rio/senha contra o banco Kerberos
includeInAccessToken.tooltip=O claim deve ser adicionado ao token de acesso?
idpInitiatedSsoRelayStateHelp=O estado de Relay que voc\u00EA deseja enviar com um pedido SAML quando voc\u00EA deseja realizar SSO iniciado por IDP.
otpHashAlgorithmHelp=What hashing algorithm should be used to generate the OTP.
usermodel.clientRoleMapping.clientId.tooltip=ID do cliente para mapeamentos de roles
clientsClientScopesHelp=The scopes associated with this resource.
vendor=Vendor
logoutServiceRedirectBindingURL=URL de conex\u00E3o para o redirecionamento do servi\u00E7o de logout
idpInitiatedSsoRelayState=Estado de relay para SSO iniciado via IDP
validatingX509Certs=Validar certificados X509
masterSamlProcessingUrl=URL de processamento SAML principal
key=Chave
email=E-mail
userInfoUrl=URL de informa\u00E7\u00F5es do usu\u00E1rio
identityProviders=Provedores de identifica\u00E7\u00E3o
nameIdPolicyFormat=Pol\u00EDtica de formato NameID
idpInitiatedSsoUrlName=Nome do fragmento URL para referenciar o cliente quando voc\u00EA deseja um SSO iniciado por IDP. Deixar este campo vazio ir\u00E1 desabilitar SSO iniciado por IDP. A URL que voc\u00EA ir\u00E1 referenciar do seu browser ser\u00E1\: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}
ssoSessionIdle=Tempo que uma sess\u00E3o pode ficar inativa antes de expirar. Tokens e sess\u00F5es de navegador s\u00E3o invalidados quando uma sess\u00E3o \u00E9 expirada.
xFrameOptions=X-Frame-Options
scopeDescriptionHelp=Descri\u00E7\u00E3o do modelo de cliente.
directGrant=Fluxo de Direct Grant
consensus=Consensual
policyType.totp=Baseado em tempo
emailTheme=Tema de e-mail
nameIdFormatHelp=O formato de Name ID para utilizar como assunto.
adminEvents=Eventos de adminstra\u00E7\u00E3o
registerNodeManually=Registrar n\u00F3 manualmente
serverPrincipal=Principal do servidor
redirectURI=URI de redirecionamento
signDocuments=Assinar documentos
periodicFullSync=Syncroniza\u00E7\u00E3o completa peri\u00F3dica
tokenUrl=URL do Token
notBefore=N\u00E3o antes de
createdAt=Criado em
editUsername=Editar nome de usu\u00E1rio
titleEvents=Eventos
lastRegistration=\u00DAltimo registro
rolesHelp=Select the roles you want to associate with the selected user.
requireSsl=SSL requerido
samlEntityDescriptor=Permite que voc\u00CA carregue metadata de IDP externos de um arquivo de configura\u00E7\u00E3o ou baixando a partir de uma URL.
reevaluate=Re-avaliar
addIdpMapperName=Nome do mapeamento
continue=Continuar
details=Detalhes
selectScope=Selecione um escopo
generateNewKeys=Gerar novas chaves
offlineSessionIdle=Sess\u00E3o Offline Inativa
periodicChangedUsersSync=Sincroniza\u00E7\u00E3o peri\u00F3dica de usu\u00E1rios alterados
searchScope=Escopo de pesquisa
userRegistrationHelpText=Habilita/desabilita a p\u00E1gina de cadastro. Um link para a p\u00E1gina de cadastro tamb\u00E9m ser\u00E1 exibido na tela de login.
revokeRefreshToken=Revogar Token de Atualiza\u00E7\u00E3o
resourceName=An unique name for this resource. The name can be used to uniquely identify a resource, useful when querying for a specific resource.
minimumQuickLoginWaitSeconds=Espera m\u00EDnima ap\u00F3s Quick Login
operationTypes=Tipos de opera\u00E7\u00F5es
realmRoles=Roles do Realm
firstName=Primeiro nome
expireTime=Defines the time after which the policy MUST NOT be granted. Only granted if current date/time is before or equal to this value.
expirationHelp=Sets the expiration for events. Expired events are periodically deleted from the database.
nameIdFormat=Formato do NameID
adminThemeHelp=Selecione o tema para o UI de administra\u00E7\u00E3o.
name=Nome do modelo de cliente. Deve ser \u00FAnico neste Realm.
validRedirectUri=URIs de redirecionamento v\u00E1lidas
clientList=Clientes
userSession.modelNote.label=Nota da sess\u00E3o de usu\u00E1rio
permissionName=The name of this permission.
expires=Expira em
pagination=Pagina\u00E7\u00E3o
import=Import a JSON file containing authorization settings for this resource server.
otpHashAlgorithm=Algoritmo de hash OTP
userAttribute=Atributo do usu\u00E1rio
description=Descri\u00E7\u00E3o
revoke=Revogar
eventListenersHelpText=Configure what listeners receive events for the realm.
clientSignatureHelp=O cliente ir\u00E1 assinar os pedidos e respostas saml? E eles devem ser validados?
keyPasswordHelp=Senha para acessar a chave privada no certificado.
frontchannelLogout=Front Channel Logout
providerId=ID
titleRoles=Roles do Realm
loginTimeout=Tempo m\u00E1ximo do Login
rdnLdapAttribute=Atributo LDAP para RDN
fineGrainSamlEndpointConfig=Configura\u00E7\u00E3o de endpoint para configura\u00E7\u00E3o fina do SAML 
hours=Horas
bindType=Tipo de autentica\u00E7\u00E3o
aliasHelp=O alias \u00E9 o identificador \u00FAnico de um provedor de identidade e tamb\u00E9m \u00E9 utilizado para construir a uri de redirecionamento.
maxFailureWaitSeconds=Espera m\u00E1xima
configure=Configura\u00E7\u00E3o
contextualInfo=Informa\u00E7\u00E3o contextual
manage=Administra\u00E7\u00E3o
temporaryPassword=Tempor\u00E1ria
applyPolicyHelp=Specifies all the policies that must be applied to the scopes defined by this policy or permission.
kerberosIntegration=Integra\u00E7\u00E3o com Kerberos
protocolMapper=Protocolo...
requiredSettings=Configura\u00E7\u00F5es obrigat\u00F3rias
sslType.none=Nenhum
time=Tempo
bruteForceDetection=Detec\u00E7\u00E3o de ataque de For\u00E7a Bruta
archiveFormatHelp=Keystore Java ou arquivo em formato PKCS12.
xContentTypeOptions=X-Content-Type-Options
keyAlias=Alias da chave
prefix=Um prefixo para cada Realm Role (opcional).
none=Nenhum
sslType.all=todas requisi\u00E7\u00F5es
type=Tipo
httpPostBindingResponse=Responder com HTTP-POST
saveEvents=Salvar eventos
issuer=Emissor
policyEnforcementModeHelp=The policy enforcement mode dictates how policies are enforced when evaluating authorization requests. 'Enforcing' means requests are denied by default even when there is no policy associated with a given resource. 'Permissive' means requests are allowed even when there is no policy associated with a given resource. 'Disabled' completely disables the evaluation of policies and allow access to any resource.
seconds=Segundos
selectAUser=Selecione um usu\u00E1rio
eventTypes.RESET_PASSWORD.name=Reiniciar senha
otpPolicyDigits=Quantidade de d\u00EDgitos
permissions=Permiss\u00F5es
accountThemeHelp=Selecione o tema para as p\u00E1ginas de administra\u00E7\u00E3o de conta do usu\u00E1rio.
canonicalizationHelp=Canonicalization Method para assinaturas XML.
sessions=Sess\u00F5es
fullSyncPeriodHelp=Intervalo para a sincroniza\u00E7\u00E3o completa em segundos.
priority=Prioridade
trustEmail=Confiar no e-mail recebido
jsonType.label=Tipo JSON do Claim
fullScopeAllowed=Permitir Escopo completo
push=Enviar
titleUsers=Usu\u00E1rios
masterSamlProcessingUrlHelp=Se configurado, esta URL ser\u00E1 utilizada para todos os bindings do "SP's Assertion Consumer" e "Single Logout Services". Ela pode ser sobreescriva idnvidualmente para cada liga\u00E7\u00E3o e servi\u00E7o na Configura\u00E7\u00E3o Detalhada do Endpoint SAML.
claimJsonType=Tipo JSON que deve ser utilizado para popular o claim json no token. Os valores v\u00E1lidos s\u00E3o Long, int boolean e String.
forceAuthenticationHelp=Indica se um provedor de identifica\u00E7\u00E3o deve autenticar o apresentador diretamente ao inv\u00E9s de confiar em um contexto de seguran\u00E7a anterior.
testClusterAvailability=Testar disponibilidade do cluster
forceNameIdFormat=For\u00E7ar formato do NameID
sslType.external=requisi\u00E7\u00F5es externas
multiValued=Indica se um atributo suporta m\u00FAltiplos valores. Se verdadeiro, ent\u00E3o a lista de todos os valores desse atributo ser\u00E1 definida como o claim. Se falso, ent\u00E3o apenas o primeiro valor ser\u00E1 utilizado.
addRole=Adicionar Role
lastName=Sobrenome
usermodel.realmRoleMapping.rolePrefix.label=Prefixo do Realm Role
temporaryPasswordHelpText=If enabled user is required to change password on next login
otpPolicyDigitsHelp=How many digits should the OTP have?
connectionPooling=Pooling de conex\u00F5es
wantAuthnRequestsSignedHelp=Indicate se um provedor de identifica\u00E7\u00E3o deve experar um AuthnRequest assinado.
enabled=Habilitado
authenticationAliasHelp=Name of the configuration
keyPassword=Senha da chave
SSOSessionIdle=Sess\u00E3o SSO inativa
ssoServiceUrlHelp=A Url que deve ser utilizada para enviar solicita\u00E7\u00F5es de autentica\u00E7\u00E3o (SAML AuthnRequest).
startTime=Defines the time before which the policy MUST NOT be granted. Only granted if current date/time is after or equal to this value.
logicHelp=The logic dictates how the policy decision should be made. If 'Positive', the resulting effect (permit or deny) obtained during the evaluation of this policy will be used to perform a decision. If 'Negative', the resulting effect will be negated, in other words, a permit becomes a deny and vice-versa.
copy=Copiar
supportedLocales=Locais dispon\u00EDveis
registrationAccessToken=Token de acesso para registro
showPasswordDataValue=Valor
issuerHelp=O identificador de emissor para o emissor da resposta. Se n\u00E3o for provido nenhuma valida\u00E7\u00E3o ser\u00E1 realizada.
titleSessions=Sess\u00F5es
clientNameHelp=Especifica o nome de exibi\u00E7\u00E3o do cliente. Por exemplo 'Meu Cliente'. Tamb\u00E9m aceita chaves para valores localizados. Por exemplo\: ${meu_cliente}
createPolicy=Criar pol\u00EDtica
clearAdminEvents=Limpar eventos administrativos
rootURL=URL raiz adicionada \u00E0 URLs relativas
clientLoginTimeout=Tempo limite para login do Cliente
nodeReRegistrationTimeoutHelp=Intervalo para especificar o tempo m\u00E1ximo para n\u00F3s clientes de cluster registrados se re-registrarem. Se os n\u00F3s do cluster n\u00E3o enviarem solicita\u00E7\u00F5es de re-registro dentro deste intervalo eles ser\u00E3o deregistrados do Keycloak.
clientAuthentication=Autentica\u00E7\u00E3o do cliente
registrationEmailAsUsername=Email como nome de usu\u00E1rio
logicType.negative=Negativa
otpPolicy=Pol\u00EDtica OTP
flow-type.form-flow=formul\u00E1rio
signDocumentsHelp=Devem os documentos SAML serem assinados pelo realm?
resetPassword=Reiniciar senha
requireSslHelp=\u00C9 necess\u00E1rio SSL? 'Nunca' significa que HTTPS n\u00E3o \u00E9 requerido para nenhum endere\u00E7o IP cliente. 'Requisi\u00E7\u00F5es externas' significa que localhost e IPs privados podem acessar sem HTTPS. 'Todas requisi\u00E7\u00F5es' significa que HTTPS \u00E9 requerido para todos os endere\u00E7os IPs.
identityInformation=Informa\u00E7\u00E3o de identidade
addUser=Adicionar usu\u00E1rio
usermodel.clientRoleMapping.rolePrefix.label=Prefixo para o role de Cliente
partialImport=Importa\u00E7\u00E3o parcial
includeAuthnStatementHelp=Deve ser adicionado um statement especificando o m\u00E9todo e timestamp nas respostas de login?
client-authenticator-type=Autenticador de Cliente usado para autenticar este cliente ao servidor Keycloak
protocol=Protocolo
manageAccount=Administrar a conta
tokenClaimName.label=Nome do Token Claim
create=Criar
clientSecret=Secret do Cliente
from=Remetente
httpPostBindingAuthnRequest=Utilizar HTTP-POST binding para AuthnRequest
includeInAccessToken.label=Adicionar ao token de acesso
iconUri=URI do \u00EDcone
usersInRole=Usu\u00E1rios no role
createGroup=Criar grupo
resource=Recurso
minutes=Minutos
userSession.modelNote.tooltip=Nome da nota de sess\u00E3o do usu\u00E1rio salva no mapa UserSessionModel.note.
usersDN=Users DN
clientsClientTypeHelp='OpenID connect' permite aos Clientes verificarem a identidade do usu\u00E1rio final baseado na autentica\u00E7\u00E3o realizada por um servidor de Autoriza\u00E7\u00E3o. 'SAML' permite cen\u00E1rios de autentica\u00E7\u00E3o e autoriza\u00E7\u00E3o web-based incluindo cross-domain single sign-on (SSO) e utiliza tokens de seguran\u00E7a contendo assertions para trafegar informa\u00E7\u00F5es.
selectUser=Select an user whose identity is going to be used to query permissions from the server.
logoutUrl=URL de logout
storedTokensReadable=Leitura de tokens salvos
admin-clearEvents=Deletes all admin events in the database.
mappers=Mapeamentos
waitIncrementSeconds=Incremento de Espera
usermodel.prop.label=Propriedade
name-id-format=Formato do NameID
credentials=Credenciais
policyType.hotp=Baseado em contador
enableSSL=Habilitar SSL
general=Geral
failureFactor=Falhas de login
signAssertions=Assinar assertions
scopesSelect=Define que esta permiss\u00F5es deve ser aplicada para um ou mais escopos.
adminTheme=Tema para UI de administra\u00E7\u00E3o
alias=Alias
value=Valor
clientSecretHelp=A senha do cliente registrado junto ao provedor de identifica\u00E7\u00E3o.
validateSignatures=Habilita/Desabilita valida\u00E7\u00E3o de assinaturas de respostas SAML.
authentication=Autentica\u00E7\u00E3o
descriptionHelp=Descri\u00E7\u00E3o do modelo de cliente.
logoutUrlHelp='End session endpoint' para utilizar para realizar logour dos usu\u00E1rios do IDP externo.
times.seconds=Segundos
permissionType=Specifies that this permission must be applied to all resources instances of a given type.
policyEnforcementModes.ENFORCING=Restritiva
debug=Debug
clear=Limpar
resources=Recursos
groups=Groups user is a member of. Select a listed group and click the Leave button to leave the group.
logicType.positive=Positiva
signatureAlgorithm=O algoritmo de assinatura a ser utilizado para assinar documentos.
eventTypes.LOGOUT.name=Logout
accountTheme=Tema para conta
requiredActions=A\u00E7\u00F5es requeridas
forceAuthentication=For\u00E7ar autentica\u00E7\u00E3o
assertionConsumerServiceRedirectBindingURLHelp=URL de liga\u00E7\u00E3o SAML de redirecionamento para as asser\u00E7\u00F5es de consumidor de servi\u00E7os do cliente (respostas de login). Voc\u00EA pode deixar este campo em branco se voc\u00EA n\u00E3o tiver uma URL para esta liga\u00E7\u00E3o.
policyDecisionStagey=The decision strategy dictates how the policies associated with a given policy are evaluated and how a final decision is obtained. 'Affirmative' means that at least one policy must evaluate to a positive decision in order to the overall decision be also positive. 'Unanimous' means that all policies must evaluate to a positive decision in order to the overall decision be also positive. 'Consensus' means that the number of positive decisions must be greater than the number of negative decisions. If the number of positive and negative is the same, the final decision will be negative.
resetActions=A\u00E7\u00F5es para reiniciar
selectARole=Selecione um role
titleAuthentication=Autentica\u00E7\u00E3o
category=Categoria
batchSize=Tamanho do lote
usermodel.prop.tooltip=Nome do m\u00E9todo da propriedade na interface UserModel. Por exemplo, o valor 'email' iria referenciar o m\u00E9todo UserModel.getEmail() .
user=Usu\u00E1rio
times.days=Dias
providers=Provedores
