otpTypeHelp=Totp er et tidsbasert engangspassord. 'hotp' er et teller basert engangspassord hvor serveren f\u00F8lger med p\u00E5 en teller som den kan hashe mot.
useKerberosForPasswordAuthentication=Bruk Kerberos for autentisering av passord
anyResource=Enhver ressurs
themes=Tema
addClientScope=Legg til klientmal
clientType='OpenID connect' tillater klienter \u00E5 verifisere identiteten til sluttbrukeren basert p\u00E5 autentisering utf\u00F8rt av en autorisasjonsserver. 'SAML' aktiverer en web-basert autentisering og autoriseringsscenarier som inkluderer cross-domain single sign-on (SSO) og som bruker security tokens som inneholder assertions for \u00E5 dele informasjon videre.
clientSignature=Klientens signatur er p\u00E5krevd
unanimous=Enstemmig
policy-name=Navnet p\u00E5 denne policien.
clientHelp=Velg klienten som vil utf\u00F8re denne autorisasjonsforesp\u00F8rselen.
debugHelp=Aktiver/deaktiver logging av feils\u00F8king til standard output for Krb5LoginModule.
validatorColNames.colConfig=Konfig
nodeHost=Nodevert
quickLoginCheckMilliSeconds=Hvis en feil skjer for raskt samtidig, steng brukeren ute.
unspecified=uspesifisert
signOut=Logg ut
validatorDialogColNames.colName=Rollenavn
credentialType=Type
certificateHelp=Klientsertifikat for \u00E5 validere JWT utstedt av klienten og signert av privatn\u00F8kkel til klient fra din keystore.
forcePostBindingHelp=Bruk alltid POST binding for svar.
roleName=Rollenavn
operationType=Operasjonstype
httpPostBindingAuthnRequestHelp=Indikerer om AuthnRequests m\u00E5 bli sendt ved \u00E5 bruke en HTTP-POST binding. Hvis satt til false, vil HTTP-REDIRECT binding bli brukt.
policyEnforcementMode=Modus for h\u00E5ndhevelse av policy
decisionStrategy=Beslutningsstrategi
requiredUserActionsHelp=Krev en handling n\u00E5r brukeren logger inn. 'Verifiser e-post' sender en e-post til brukeren for \u00E5 verifisere deres e-postadresse. 'Oppdater profil' krever at bruker legger inn personlig informasjon. 'Oppdater passord' krever at bruker skriver inn et nytt passord. 'Konfigurer OTP' krever installasjon av en passordgenerator for mobil.
securityDefences=Sikkerhetsmekanismer
realmSettings=Innstillinger for sikkerhetsdomene
deleteEvents=Fjern hendelser
accessTokenLifespanHelp=Maksimum tid f\u00F8r et access token utl\u00F8per. Det anbefales at denne verdien er kort i forhold til SSO timeout.
redirectURIHelp=Redirect URI som skal brukes n\u00E5r du konfigurerer identitetsleverand\u00F8ren.
resourcePath=Filsti for ressurs
applyToResourceTypeHelp=Spesifiserer om denne tillatelsen skal gjelde for alle ressurser med en gitt type. I dette tilfellet vil tillatelsen bli evaluert for alle instanser av gitt ressurstype.
attestationPreference.none=Ingen
revocation=Oppheving
clientDescriptionHelp=Angir beskrivelse av klienten. For eksempel\: 'Min klient for timelister'. St\u00F8tter n\u00F8kler for lokaliserte verdier. For eksempel\: ${my_client_description}
clientAuthenticator=Klientautentikator
useEntityDescriptor=Importer metadata fra et eksternt IDP SAML entity descriptor.
loginActionTimeout=Timeout for innloggingshandling.
updateFirstLoginHelp=Oppdater profil ved f\u00F8rste innlogging
validRedirectURIs=Gyldig URI m\u00F8nster som en nettleser kan redirecte til etter en vellykket innlogging eller utlogging. Enkle jokertegn er tillatt, for eksempel 'http\://example.com/*'. Relativ sti kan ogs\u00E5 spesifiseres, for eksempel /my/relative/path/*. Relative stier er relative til klientens root URL, eller hvis ingen er spesifisert brukes root URL for autorisasjonsserveren. For SAML m\u00E5 du sette et gyldig URI m\u00F8nster hvis du er avhengig av at URL for forbrukertjenesten er integrert med foresp\u00F8rselen for p\u00E5logging.
assertionConsumerServicePostBindingURL=Assertion consumer service POST binding URL
endpoints=Endepunkter
clientId=Klient-ID
validatingX509CertsHelp=Sertifikatet i PEM format som m\u00E5 brukes for \u00E5 se etter signaturer.
contextualAttributesHelp=Ethvert attributt gitt av et kj\u00F8rende milj\u00F8 eller ved utf\u00F8relseskontekst.
importFile=Importer fil
clientLoginTimeoutHelp=Maksimum tid en klient har for \u00E5 fullf\u00F8re access token protokollen. Dette burde normalt v\u00E6re 1 minutt.
lastAccess=Sist aksessert
protocolHelp=Hvilken SSO protokoll-konfigurasjon som blir levert av denne klientmalen
uiDisplayName=Konsoll vis navn
prompts.none=Ingen
resourcesHelp=Spesifiserer at denne tillatelsen m\u00E5 bli brukt for en spesifikk ressursinstans.
adminEventsSettings=Innstillinger for administratorhendelser
emailVerified=E-post verifisert
passwordConfirmation=Passord bekreftelse
times.minutes=Minutter
forcePostBinding=Force POST binding
defaultRoles=Standardroller
discoveryEndpoint=Importer metadata fra et eksternt IDP discovery descriptor.
countHelp=Angir hvor mange klienter som kan bli opprettet ved \u00E5 bruke token.
otpPolicyPeriod=Engangskode token
uuidLdapAttribute=UUID LDAP-attributt
topLevelFlowType=Hvilken type toppniv\u00E5 flyt er det? Type 'klient' brukes for autentisering av klienter (applikasjoner) n\u00E5r generisk brukes for brukere og alt annet
scopeNameHelp=Navn p\u00E5 klientmal. M\u00E5 v\u00E6re unik i sikkerhetsdomenet.
requiredUserActions=P\u00E5krevde brukerhandlinger
flowTypeHelp=Hva slags skjema det er
consentRequired=Hvis aktivert m\u00E5 brukere gi samtykke for at klienten skal f\u00E5 tilgang.
allowRemoteResourceManagement=H\u00E5ndtering av ekstern ressurs
standardFlow=Dette aktiverer standard OpenID Connect redirect-basert autentisering med autorisasjonskode. I forhold til OpenID Connect eller OAuth2 spesifikasjoner aktiverer dette st\u00F8tte for 'Authorization Code Flow' for denne klienten.
identityProvider=Identitetsleverand\u00F8r
eventListeners=Hendelseslyttere
bindDn=Bind DN
identityProviderLinks=Lenker til identitetsleverand\u00F8r
leave=Forlat
eventTypes.IMPERSONATE.name=Utgi deg for \u00E5 v\u00E6re bruker
wantAuthnRequestsSigned=Vil ha AuthnRequests signert
usermodel.attr.tooltip=Navn p\u00E5 lagret brukerattributt som er navnet p\u00E5 en attributt innenfor UserModel.attribute map.
export=Eksporter
add=Legg til
passwordPolicy=Passordpolicy
backchannelLogout=Backchannel utlogging
count=Teller
testAuthentication=Testautentisering
prompts.login=Innlogging
users=Brukere
offlineSessionIdleHelp=Tiden en sesjon i frakoblet modus er tillatt \u00E5 v\u00E6re inaktiv f\u00F8r den utl\u00F8per. Du m\u00E5 bruke tokens for frakoblet modus for \u00E5 oppdatere sesjonen minst en gang i denne perioden, ellers vil sesjonen utl\u00F8pe.
uris=En URI som ogs\u00E5 kan brukes for \u00E5 identifisere denne ressursen.
forceNameIdFormatHelp=Ignorer forespurt format p\u00E5 Navn-ID emnet og bruk den som er konfigurert i administrasjonskonsollen.
port=Port
expiration=Holdbarhet
realmRolePrefix=Prefiks for sikkerhetsdomenerolle
includeRepresentation=Inkluder representasjon
assertionConsumerServicePostBindingURLHelp=SAML POST binding URL for klientens assertion customer service (innloggingsrespons). Du kan la denne st\u00E5 tom om du ikke \u00F8nsker en URL for denne bindingen.
resourceTypes=Ressurstyper
singleLogoutServiceUrl=Single utloggingstjeneste URL
roles=Roller
includeInUserInfo.label=Legg til i brukerinfo
back=Tilbake
validateSignatureHelp=Aktiver/deaktiver signaturvalidering av eksterne IDP signaturer.
policyCode=JavaScript-koden angir betingelsene for denne politikken.
title=Autentisering
verifyEmail=Bekreft e-postadresse
representation=Representasjon
remove=Fjern
formatOption=Formatalternativer
loginTheme=Innloggingstema
provider=Leverand\u00F8r
flows=Flyt
scope=Scope
nodeReRegistrationTimeout=Timeout for re-registrering av node
client=klient
includeRepresentationHelp=Inkluder JSON-representasjon for \u00E5 skape og oppdatere foresp\u00F8rsler.
connectionURL=Tilkoblings URL
accessTokenLifespan=Levetid for access token
setToNow=Sett til n\u00E5
signAssertionsHelp=Skal assertions i SAML dokumenter bli signert? Denne innstillingen er ikke n\u00F8dvendig hvis et dokument allerede har blitt signert.
firstBrokerLoginFlowAliasHelp=Alias for autentiseringsflyt, som trigges etter f\u00F8rste innlogging med denne identitetsleverand\u00F8ren. Begrepet 'F\u00F8rste innlogging' betyr at det enn\u00E5 ikke eksisterer en Keycloak-konto koblet til den autentiserte kontoen til identitetsleverand\u00F8ren.
owner=Eier
validateSignature=Valider signaturer
implicitFlow=Dette aktiverer st\u00F8tte for OpenID Connect redirect-basert autentisering uten autorisasjonskode. I forhold til OpenID Connect eller OAuth2 spesifikasjoner aktiverer dette st\u00F8tte for 'Implicit Flow' for denne klienten.
headers=Headere
encryptAssertions=Krypter assertions
keyAliasHelp=Arkiv-alias for din privatn\u00F8kkel og sertifikater.
tokenClaimName.tooltip=Navn p\u00E5 claim som skal legges inn i token. Denne kan v\u00E6re et fullt kvalifisert navn som 'address.street'. I dette tilfellet vil et nestet jsonobjekt bli laget.
userName=Brukernavn
clientProfileDescription=Beskrivelse
userObjectClasses=Brukerobjektklasser
usermodel.clientRoleMapping.client.label=Klient-ID
ssoSessionMax=Maksimum tid f\u00F8r en sesjon utl\u00F8per. Tokens og nettlesersesjoner vil bli ugyldig n\u00E5r en sesjon utl\u00F8per.
policyRoles=Spesifiserer klientroller tillatt av denne policien.
times.hours=Timer
browserFlowHelp=Velg flyten du \u00F8nsker \u00E5 bruke for nettleser-autentisering.
temporaryLocked=Brukeren kan ha blitt l\u00E5st p\u00E5 grunn av at innloggingsfors\u00F8k har feilet for mange ganger.
webOrigins=Web origins
realm=Sikkerhetsdomene
prompt=Prompt
username=Brukernavn
showAuthData=Vis autorisasjonsdata
importConfig=Importer metadata fra en nedlastet IDP discovery descriptor.
includeInUserInfo.tooltip=Burde claim bli lagt til i brukerinfo?
initialCounter=Initiell teller
revokeRefreshTokenHelp=Hvis aktivert kan refresh token kun bli brukt en gang. Ellers vil refresh tokens kunne bli brukt flere ganger.
storedTokensReadableHelp=Aktiver/deaktiver hvis nye brukere kan lese lagrede tokens. Dette tildeles broker.read-token rollen.
authenticationFlowTypeHelp=Hva slags skjema det er
authorization=Aktiver/deaktiver finkornet autorisasjonssupport for en klient
editUsernameHelp=Dersom aktivert, er feltet for brukernavn redigerbart, ellers kun lesbart.
consoleDisplayConnectionUrlHelp=Tilkoblings URL din til LDAP-server
bindCredentialsHelp=Passord for LDAP administrator
action=Handling
join=Bli med
id=ID
fullScopeAllowedHelp=Lar deg \u00E5 deaktivere alle restriksjoner.
applyPolicy=Anvend policy
otpType=Type engangskode
directGrantHelp=Velg flyten du \u00F8nsker \u00E5 bruke for direct grant autentisering.
scopesHelp=Scopes som sendes n\u00E5r du ber om autorisasjon. Dette kan v\u00E6re en liste med scopes separert med mellomrom. Standard er satt til 'openid'.
includeAuthnStatement=Inkluder AuthnStatement
jsonType.tooltip=JSON-type som burde bli brukt for \u00E5 fylle json claimet i tokenet. long, int, boolean og String er gyldige verdier.
multivalued.tooltip=Angir om en attributt st\u00F8tter flere verdier. Hvis true, vil listen med alle verdier for dette attributtet bli satt som claims. Hvis false, vil bare den f\u00F8rste verdien bli satt som claim.
enableStartTLS=Aktiver StartTLS
enableStartTls=Aktiver StartTLS
addIdPMapper=Legg til identitetsleverand\u00F8rmappere
eventType=Hendelsestype
homeURL=Standard URL som kan brukes n\u00E5r autorisasjonsserveren trenger \u00E5 redirecte eller lenke tilbake til klienten.
contentSecurityPolicyReportOnly=Rapporterende sikkerhetspolicy for innhold
firstBrokerLoginFlowAlias=Flyt for f\u00F8rste innlogging
usermodel.attr.label=Brukerattributt
eventTypes.REGISTER.name=Registrer
rememberMeHelpText=Vis en avkryssingsboks p\u00E5 innloggingssiden som lar brukere forbli innlogget mellom omstart av nettleser og inntil sesjonen utl\u00F8per.
usernameLdapAttribute=Brukernavn LDAP-attributt
evaluate=Evaluer
ssoServiceUrl=Single sign-on service URL
allowRemoteResourceManagementHelp=Skal ressursene bli h\u00E5ndtert eksternt av ressursserveren? Hvis satt til false kan ressursene kun bli h\u00E5ndtert fra denne administratorkonsollen.
clients=Klienter
changedUsersSyncPeriod=Synkroniseringsperiode for endrede brukere
clientName=Navn
userRegistration=Registrering av bruker
save=Lagre
login=Innlogging
maxDeltaTimeSeconds=Tid for tilbakestilling av feil.
backchannelLogoutHelp=St\u00F8tter ekstern IDP backchannel utlogging?
usermodel.realmRoleMapping.rolePrefix.tooltip=Prefiks for hver sikkerhetsdomenerolle (valgfri).
affirmative=Bekreftende
changedUsersSyncHelp=Tidsperiode for synkronisering av endrede eller nylig opprettede LDAP-brukere i sekunder.
trustEmailHelp=Hvis aktivert vil ikke e-post levert av denne leverand\u00F8ren bli verifisert selv om verifisering er aktivert for sikkerhetsdomenet.
maxFailureWaitSecondsHelp=Maksimum tid en bruker vil v\u00E6re stengt ute.
maxDeltaTimeSecondsHelp=N\u00E5r vil teller for feil nullstilles?
adminURLHelp=URL til administratorgrensesnitt for klienten. Sett denne hvis klienten st\u00F8tter adapter REST API. Dette REST APIet tillater autorisasjonsserveren til \u00E5 sende tilbakekallingsregler og andre administrative oppgaver. Vanligvis er dette satt til klientens base URL.
otpPolicyPeriodHelp=Hvor mange sekunder burde et engangskode token v\u00E6re gyldig? Standard er satt til 30 sekunder.
contentSecurityPolicy=Sikkerhetspolicy for innhold
storePasswordHelp=Passord for \u00E5 f\u00E5 tilgang til arkivet
frontchannelLogoutHelp=Hvis satt til true, krever utlogging en redirect i nettleser til klient. Hvis satt til false, vil server utf\u00F8re en bakgrunnskall for utlogging.
userFederation=Brukerfederering
directAccess=Dette gir st\u00F8tte for Direct Access Grants, som betyr at klienten har tilgang til brukerens brukernavn/passord og kan bytte dette direkte med Keycloak-serveren for access token. I f\u00F8lge OAuth2 spesifikasjonen, aktiverer dette st\u00F8tte for 'Resource Owner Password Credentials Grant' for denne klienten.
attributes=Attributter
logic=Logikk
scopes=Scope
resourceType=Ressurstype
flowType=Type av flyt
policyEnforcementModes.PERMISSIVE=Ettergivende
auth=Auth
accessTokenLifespanImplicitFlow=Access token-levetid for implicit flow
scopeName=Et unikt navn for dette scopet. Navnet kan bli brukt for \u00E5 identifisere et scope, og er nyttig i sp\u00F8rringer for en bestemt ressurs.
userInfoUrlHelp=Brukerinfo URLen. Denne er valgfri.
remainingCount=Resterende antall
kc.realm.name=Sikkerhetsdomene
download=Last ned
authScopes=Autorisasjonsscopes
impersonate=Utgi deg for \u00E5 v\u00E6re bruker
members=Medlemmer
host=Vert
registration-access-token=Access token for registrering gir klienter tilgang til registreringstjenesten for klienter.
adminURL=Admin URL
settings=Innstillinger
failureFactorHelp=Hvor mange feil f\u00F8r ventetid blir aktivert.
storeTokensHelp=Aktiver/deaktiver hvis tokens m\u00E5 bli lagret etter at brukere har blitt autentisert.
singleLogoutServiceUrlHelp=URL som m\u00E5 brukes for \u00E5 sende utloggingsforesp\u00F8rsler.
ipAddress=IP-adresse
useTruststoreSpi=Bruk Truststore SPI
storeTokens=Lagre Tokens
usermodel.clientRoleMapping.rolePrefix.tooltip=Prefiks for hver klientrolle (valgfri).
includeInIdToken.label=Legg til i ID token
browserFlow=Nettleserflyt
anyScope=Ethvert scope
serverInfo=Serverinformasjon
emailThemeHelp=Velg tema for e-post sendt av server.
emailVerifiedHelp=Har brukerens e-post blitt verifisert?
addExecution=Legg til eksekvering
editMode=Redigeringsmodus
consents=Samtykke
canonicalization=Kanoniseringsmetode
SSOSessionMax=Maksimum SSO sesjon
groupMembership=Gruppemedlemskap
minimumQuickLoginWaitSecondsHelp=Ventetid etter en hurtig innloggingsfeil.
code=Kode
fullSyncPeriod=Fullstendig synkroniseringsperiode
addNode=Legg til node
policy-description=En beskrivelse av denne policien.
policies=Policier
certificate=Sertifikat
importClient=Importer klient
selectRole.label=Velg rolle
allTypes=Alle typer
prompts.consent=samtykke
ldapFilter=LDAP filter
postBrokerLoginFlowAlias=Post-p\u00E5loggingsflyt
tokens=Tokens
save-admin-events=Hvis aktivert vil administratorhendelser bli lagret i databasen, som vil gj\u00F8re hendelsene tilgjengelige i administrasjonskonsollen.
encryptAssertionsHelp=Skal SAML assertions bli kryptert med klientens offentlige n\u00F8kkel ved \u00E5 bruke AES?
policyGroups=Spesifiser bruker(e) som tillates av denne policien.
on=P\u00E5
serviceAccount=Lar deg autentisere denne klienten til Keycloak og hente access token dedikert til denne klienten. I f\u00F8lge OAuth2 spesifikasjonen, aktiverer dette st\u00F8tte for 'Client Credentials Grant' for denne klienten.
requirement=Krav
assertionConsumerServiceRedirectBindingURL=Assertion Consumer Service redirect binding URL
loginThemeHelp=Velg tema for sidene\: innlogging, OTP, rettigheter, registrering, glemt passord.
permissionDescription=En beskrivelse av denne tillatelsen.
multivalued.label=Flere verdier
initialAccessToken=F\u00F8rste access token
vendorHelp=LDAP leverand\u00F8r (provider)
clustering=Clustering
applyToResourceType=Bruk p\u00E5 ressurstype
rememberMe=Husk meg
flow.registration=Registreringsflyt
registeredClusterNodes=Registrerte clusternoder
selectRole.tooltip=Skriv inn rolle i tekstboksen til venstre, eller klikk p\u00E5 denne knappen for \u00E5 bla gjennom og velge rollen du \u00F8nsker.
storePassword=Lagre passord
logoutServiceRedirectBindingURLHelp=SAML redirect binding URL for klientens single logout-tjeneste. Du kan la dette st\u00E5 tomt om du bruker en annen binding.
defaultGroups=Standardgrupper
flow.browser=Nettleserflyt
editModeLdapHelp=READ_ONLY er et skrivebeskyttet LDAP-lager. WRITABLE betyr at data vil bli synkronisert tilbake til LDAP p\u00E5 foresp\u00F8rsel. UNSYNCED betyr at brukerdata vil bli importert, men vil ikke bli synkronisert tilbake til LDAP.
includeInIdToken.tooltip=Burde claim bli lagt til i ID token?
save-user-events=Hvis aktivert vil innloggingshendelser bli lagret i databasen, noe som gj\u00F8r hendelsene tilgjengelige for administrator og kontoadministrasjonskonsoll.
password=Passord
allowPasswordAuthentication=Tillat autentisering med passord
composite=Sammensatt
clientAuthorization=Autorisasjon
waitIncrementSecondsHelp=N\u00E5r terskelen for feil er n\u00E5dd, hvor lenge skal brukeren stenges ute?
allowKerberosAuthentication=Tillat autentisering med Kerberos
events=Hendelser
createPermission=Opprett tillatelse
mapperType=Mappertype
testConnection=Testkobling
edit=Rediger
archiveFormat=Arkivformat
credentialResetConfirm=Send e-post
kerberosRealm=Sikkerhetsdomene for Kerberos
flow.direct\ grant=Direct Grant Flyt
associatedRolesText=Assosierte roller
defaultLocale=Standard lokalitet
clientIdHelp=Identifikator for klient registrert hos identitetsleverand\u00F8r.
typeHelp=Ressurstype. Den kan brukes til \u00E5 gruppere ulike ressursinstanser av samme type.
htmlDisplayName=HTML vis navn
authorizationUrl=Autorisasjons URL
contextualAttributes=Kontekstuelle attributter
allowPasswordAuthenticationHelp=Aktiver/deaktivert muligheten for autentisering med brukernavn/passord mot databasen til Kerberos
includeInAccessToken.tooltip=Burde claim bli lagt til i access token?
idpInitiatedSsoRelayStateHelp=Relay state du \u00F8nsker \u00E5 sende med SAML foresp\u00F8rselen n\u00E5r du vil utf\u00F8re en IDP initiert SSO.
otpHashAlgorithmHelp=Hva slags hashing algoritme skal brukes for \u00E5 generere OTP.
clientsClientScopesHelp=Scopes assosiert med denne ressursen.
vendor=Leverand\u00F8r
logoutServiceRedirectBindingURL=Logout-tjeneste redirect binding URL
idpInitiatedSsoRelayState=IDP initiert SSO relay state
validatingX509Certs=Validerer X509 sertifikat
masterSamlProcessingUrl=Master SAML prosesserings URL
key=N\u00F8kkel
email=E-postadresse
userInfoUrl=Brukerinfo URL
identityProviders=Identitetsleverand\u00F8r
nameIdPolicyFormat=Policy for nameid-format
idpInitiatedSsoUrlName=Navn p\u00E5 URL-fragment som refererer til klienten n\u00E5r du vil gj\u00F8re en IDP initiert SSO. La denne st\u00E5 tom om du \u00F8nsker \u00E5 deaktivere IDP initiert SSO. URLen vil v\u00E6re\: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}
ssoSessionIdle=Tiden en sesjon er tillatt \u00E5 v\u00E6re inaktiv f\u00F8r den utl\u00F8per. Tokens og nettlesersesjoner vil bli ugyldig n\u00E5r en sesjon utl\u00F8per.
xFrameOptions=Alternativer for X-Frame
scopeDescriptionHelp=Beskrivelse av klientmal
directGrant=Direct Grant Flyt
consensus=Konsensus
policyType.totp=Tidsbasert
emailTheme=E-posttema
nameIdFormatHelp=Navn-ID formatet som skal brukes for emnet.
adminEvents=administratorhendelser
registerNodeManually=Register node manuelt
serverPrincipal=Server principal
redirectURI=Redirect URI
signDocuments=Signer dokumenter
periodicFullSync=Fullstendig periodisk synkronisering
tokenUrl=Token URL
notBefore=Ikke f\u00F8r
createdAt=Opprettet ved
editUsername=Rediger brukernavn
titleEvents=Hendelser
lastRegistration=Siste registrering
rolesHelp=Velg en rolle som du vil knytte til den valgte brukeren.
requireSsl=Krev SSL
samlEntityDescriptor=Lar deg laste inn ekstern IDP metadata fra en konfigurasjonsfil eller ved \u00E5 laste det ned fra en URL.
reevaluate=Re-evaluering
addIdpMapperName=Navn p\u00E5 mapper.
continue=Fortsett
details=Detaljer
selectScope=Velg et scope
generateNewKeys=Generer nye n\u00F8kler
offlineSessionIdle=Inaktiv sesjon i frakoblet modus
periodicChangedUsersSync=Periodisk synkronisering av endrede brukere
searchScope=Scope for s\u00F8k
userRegistrationHelpText=Aktiver/deaktiver registreringssiden. En lenke for registrering vil v\u00E6re synlig p\u00E5 innloggingssiden.
revokeRefreshToken=Fjern refresh token
resourceName=Et unikt navn for denne ressursen. Navnet kan bli brukt til \u00E5 identifisere en ressurs og er nyttig i sp\u00F8rringer for en bestemt ressurs.
minimumQuickLoginWaitSeconds=Minimum ventetid for hurtig innlogging
operationTypes=Operasjonstyper
realmRoles=Sikkerhetsdomeneroller
firstName=Fornavn
expireTime=Definerer tiden etter en policy M\u00C5 IKKE innvilges. Denne innvilges kun om gjeldende dato/tid er f\u00F8r eller lik denne verdien.
expirationHelp=Setter utl\u00F8pstid for hendelser. Utl\u00F8pte hendelser vil med jevne mellomrom bli slettet fra databasen.
nameIdFormat=Navn-ID format
adminThemeHelp=Velg et tema for administrasjonskonsollen.
name=Navn p\u00E5 klientmal. M\u00E5 v\u00E6re unik i sikkerhetsdomenet.
validRedirectUri=Gyldig redirect URIer
clientList=Klienter
userSession.modelNote.label=Brukersesjonsmerknad
permissionName=Navnet p\u00E5 denne tillatelsen.
expires=Utl\u00F8per
pagination=Paginering
import=Importer en JSON-fil som inneholder innstillinger for autorisasjon for denne ressursserveren.
otpHashAlgorithm=OTP hash-algoritme
userAttribute=Brukerattributt
description=Beskrivelse
revoke=Opphev
eventListenersHelpText=Konfigurer hvilke lyttere som skal motta eventer fra sikkerhetsdomenet.
clientSignatureHelp=Skal klienten signere sine SAML foresp\u00F8rsler og svar? Og skal de valideres?
keyPasswordHelp=Passord for \u00E5 f\u00E5 tilgang til privatn\u00F8kler i arkivet
frontchannelLogout=Front channel utlogging
policyClient=Spesifiser klient(er) som tillates av denne policien.
providerId=ID
titleRoles=Sikkerhetsdomeneroller
loginTimeout=Timeout for innlogging
rdnLdapAttribute=RDN LDAP-attributt
fineGrainSamlEndpointConfig=Finkornet SAML endepunktskonfigurasjon
hours=Timer
bindType=Autentiseringstype
aliasHelp=Aliaset identifiserer en identitetsleverand\u00F8r og kan brukes for \u00E5 bygge en redirect uri.
maxFailureWaitSeconds=Maksimum ventetid
configure=Konfigurer
contextualInfo=Kontekstuell informasjon
manage=H\u00E5ndter
temporaryPassword=Midlertidig
applyPolicyHelp=Spesifiserer alle policies som m\u00E5 bli anvendt for scopes definert av denne policien eller tillatelsen.
kerberosIntegration=Kerberos Integrasjon
protocolMapper=Protokoll...
requiredSettings=P\u00E5krevde innstillinger
sslType.none=Ingen
time=Tid
bruteForceDetection=Deteksjon av Brute Force
archiveFormatHelp=Java keystore eller PKCS12 arkivformat.
xContentTypeOptions=Alternativer for X-innholdstyper
keyAlias=N\u00F8kkelalias
prefix=Prefiks for hver sikkerhetsdomenerolle (valgfri).
none=Ingen
sslType.all=Alle foresp\u00F8rsler
usermodel.clientRoleMapping.client.tooltip=Klient-ID for \u00E5 mappe roller
type=Type
httpPostBindingResponse=HTTP-POST binding svar
saveEvents=Lagre hendelser
issuer=Utgiver
policyEnforcementModeHelp=Modus for h\u00E5ndhevelse av policy dikterer hvordan policier blir h\u00E5ndhevet n\u00E5r autorisasjonsforesp\u00F8rsler blir evaluert. 'H\u00E5ndhevende' betyr at foresp\u00F8rsler blir nektet som standard selv om det ikke er en policy knyttet til en gitt ressurs. 'Ettergivende' betyr at foresp\u00F8rsler blir tillatt selv om det ikke er en policy knyttet til en gitt ressurs. 'Deaktivert' deaktiverer fullstendig evalueringen av policier og tillater tilgang til enhver ressurs.
lastUpdated=Sist oppdatert
seconds=Sekunder
selectAUser=Velg en bruker
eventTypes.RESET_PASSWORD.name=Tilbakestill passord
otpPolicyDigits=Antall siffer
permissions=Tillatelser
accountThemeHelp=Velg tema for brukerkontoadministrasjonssider.
canonicalizationHelp=Kanoniseringsmetode for XML signaturer.
sessions=Sesjoner
fullSyncPeriodHelp=Periode for fullstendig synkronisering i sekunder
priority=Prioritet
trustEmail=Stol p\u00E5 e-post
jsonType.label=JSON-type for claims
fullScopeAllowed=Tillatt med fullt scope
push=Send
titleUsers=Brukere
masterSamlProcessingUrlHelp=Hvis konfigurert vil denne URLen bli brukt for hver binding til b\u00E5de SPs Assertion Consumer og Single Logout-tjenester. Denne kan bli individuelt overstyrt for hver binding og tjenester i konfigurasjonen for finkornet SAML endepunkt.
claimJsonType=JSON-type som burde bli brukt for \u00E5 fylle json claimet i tokenet. long, int, boolean og String er gyldige verdier.
forceAuthenticationHelp=Indikerer om identitetsleverand\u00F8r m\u00E5 autentisere presentat\u00F8ren direkte i stedet for \u00E5 stole p\u00E5 en tidligere sikkerhetskontekst.
testClusterAvailability=Test cluster tilgjengelighet
forceNameIdFormat=Force navn-ID format
sslType.external=Eksterne foresp\u00F8rsler
multiValued=Angir om en attributt st\u00F8tter flere verdier. Hvis true, vil listen med alle verdier for dette attributtet bli satt som claims. Hvis false, vil bare den f\u00F8rste verdien bli satt som claim.
addRole=Legg til rolle
lastName=Etternavn
usermodel.realmRoleMapping.rolePrefix.label=Prefiks for sikkerhetsdomenerolle
temporaryPasswordHelpText=Hvis aktivert, er brukeren p\u00E5krevd til \u00E5 endre passordet ved neste innlogging
otpPolicyDigitsHelp=Hvor mange sifre skal OTP ha?
connectionPooling=Connection Pooling
wantAuthnRequestsSignedHelp=Indikerer om identitetsleverand\u00F8r forventer en signert AuthnRequest.
enabled=Aktivert
authenticationAliasHelp=Navn p\u00E5 konfigurasjonen
keyPassword=N\u00F8kkelpassord
SSOSessionIdle=Inaktiv SSO sesjon
ssoServiceUrlHelp=URL som m\u00E5 brukes for \u00E5 sende autentiseringsforesp\u00F8rsler (SAML AuthnRequest).
startTime=Definerer tiden f\u00F8r policien M\u00C5 IKKE innvilges. Denne innvilges kun om gjeldende dato/tid er f\u00F8r eller lik denne verdien.
logicHelp=Logikken som dikterer hvordan beslutningspolicien skal utf\u00F8rres. Hvis 'Positiv', vil resulterende effekt (tillate eller nekte) oppn\u00E5dd under evalueringen av denne policien bli brukt for \u00E5 ta en beslutning. Hvis 'Negativ', vil resulterende effekt bli opphevet, med andre ord blir en tillatelse til et avslag og motsatt.
copy=Kopi
supportedLocales=St\u00F8ttede lokaliteter
registrationAccessToken=Access token for registrering
showPasswordDataValue=Verdi
issuerHelp=Identifikator for utgiver av foresp\u00F8rselen. Hvis dette ikke er oppgitt vil ingen validering utf\u00F8res.
titleSessions=Sesjoner
clientNameHelp=Angir klientnavnet som blir vist. For eksempel, 'Min klient'. St\u00F8tter n\u00F8kler for lokaliserte verdier. For eksempel\: ${my_client}
createPolicy=Opprett policy
clearAdminEvents=Fjern administratorhendelser
rootUrl=Root URL
rootURL=Root URL lagt til relative URLer
clientLoginTimeout=Timeout av klientinnlogging
nodeReRegistrationTimeoutHelp=Intervall for \u00E5 angi maksimum tid for registrerte klienters clusternoder for \u00E5 re-registreres. Hvis en clusternode ikke sender re-regisreringsforesp\u00F8rsel til Keycloak innen dette intervallet, vil den bli uregistrert fra Keycloak.
clientAuthentication=Autentisering av klient
registrationEmailAsUsername=E-postadresse som brukernavn
logicType.negative=Negativ
otpPolicy=Policy for engangskode
flow-type.form-flow=skjema
signDocumentsHelp=Skal SAML dokumenter bli signert av sikkerhetsdomenet?
resetPassword=Tilbakestill passord
requireSslHelp=Kreves HTTPS? 'Ingen' betyr at HTTPS ikke kreves for noen klienters IP-adresse. 'Ekstern foresp\u00F8rsel' betyr at localhost og private IP-adresser kan f\u00E5 tilgang uten HTTPS. 'Alle foresp\u00F8rsler' betyr at HTTPS kreves for alle IP-adresser.
identityInformation=Identitetsinformasjon
addUser=Legg til bruker
usermodel.clientRoleMapping.rolePrefix.label=Prefiks for klientrolle
partialImport=Delvis import
includeAuthnStatementHelp=Skal et statement som spesifiserer metoden for tidsstempel inng\u00E5 i innloggingssvaret?
client-authenticator-type=Klientautentikator som blir brukt for \u00E5 autentisere denne klienten mot keycloak-server
protocol=Protokoll
manageAccount=Administrer konto
tokenClaimName.label=Navn p\u00E5 token claim
create=Opprett
clientSecret=Klient secret
from=Fra
httpPostBindingAuthnRequest=HTTP-POST binding for AuthnRequest
includeInAccessToken.label=Legg til i access token
iconUri=Ikon URI
createGroup=Opprett gruppe
resource=Ressurs
created=Opprettet
minutes=Minutter
userSession.modelNote.tooltip=Navn p\u00E5 lagret brukersesjonsmerknad innenfor UserSessionModel.note map.
usersDN=DN-brukere
clientsClientTypeHelp='OpenID connect' tillater klienter \u00E5 verifisere identiteten til sluttbrukeren basert p\u00E5 autentisering utf\u00F8rt av en autorisasjonsserver. 'SAML' aktiverer en web-basert autentisering og autoriseringsscenarier som inkluderer cross-domain single sign-on (SSO) og som bruker security tokens som inneholder assertions for \u00E5 dele informasjon videre.
selectUser=Velg en bruker hvis identitet vil bli brukt for \u00E5 s\u00F8ke tillatelser fra serveren.
webOriginsHelp=Tillat CORS origins. For \u00E5 tillate alle origins med gyldig Redirect URIer legg til '+'. For \u00E5 tillate alle origins legg til '*'.
logoutUrl=Utloggings URL
storedTokensReadable=Lagrede lesbare tokens
admin-clearEvents=Sletter alle administratorhendelser i databasen.
mappers=Mappere
waitIncrementSeconds=\u00F8kning av ventetid
usermodel.prop.label=Egenskap
name-id-format=Navn-ID format
credentials=Innloggingsdetaljer
policyType.hotp=Tellerbasert
enableSSL=Aktiver SSL
general=Generelt
failureFactor=Maksimum antall innloggingsfeil
signAssertions=Signer assertions
scopesSelect=Spesifiserer at denne tillatelse m\u00E5 anvendes p\u00E5 en eller flere scopes.
adminTheme=Administrasjonskonsolltema
alias=Alias
value=Verdi
clientSecretHelp=Klient secret registrert hos identitetsleverand\u00F8r.
validateSignatures=Aktiver/deaktiver signaturvalidering av SAML svar.
authentication=Autentisering
descriptionHelp=Beskrivelse av klientmal
logoutUrlHelp=Endepunkt for avsluttende sesjon som brukes for \u00E5 logge ut bruker fra ekstern IDP.
times.seconds=Sekunder
permissionType=Spesifiserer at denne tillatelsen m\u00E5 bli anvendt for alle ressursinstanser for en gitt type.
policyEnforcementModes.ENFORCING=H\u00E5ndhevende
debug=Feils\u00F8king
clear=T\u00F8m
resources=Ressurser
groups=Gruppen som brukeren er medlem av. Velg en gruppe p\u00E5 listen og klikk p\u00E5 'Forlat' for \u00E5 forlate gruppen.
logicType.positive=Positiv
signatureAlgorithm=Signaturalgoritmen som brukes for \u00E5 signere et dokument.
eventTypes.LOGOUT.name=Logg ut
accountTheme=Kontotema
requiredActions=P\u00E5krevde handlinger
forceAuthentication=Force autentisering
assertionConsumerServiceRedirectBindingURLHelp=SAML redirect for klientens assertion consumer service (innloggingsrespons). Du kan la denne st\u00E5 tom om du ikke \u00F8nsker en URL for denne bindingen.
policyDecisionStagey=Beslutningsstrategi som dikterer hvordan policies knyttet til en gitt policy blir evaluert og hvordan endelig avgj\u00F8relse oppn\u00E5s. 'Bekreftende' betyr at minst en policy m\u00E5 evalueres til en positiv beslutning for at den samlede avgj\u00F8relsen kan bli positiv. 'Enstemmig' betyr at alle policies m\u00E5 evalueres til en positiv beslutning for at den samlede avgj\u00F8relsen kan bli positiv. 'Konsensus' betyr at antall positive beslutninger m\u00E5 v\u00E6re h\u00F8yere enn antall negative beslutninger. Hvis antallet av positive og negative er likt, blir den samlede avgj\u00F8relsen negativ.
resetActions=Tilbakestill handlinger
selectARole=Velg en rolle
titleAuthentication=Autentisering
category=Kategori
batchSize=Batch st\u00F8rrelse
usermodel.prop.tooltip=Navn p\u00E5 egenskapsmetoden i UserModel-grensesnittet. For eksempel, en verdi av 'e-post' vil referere til metoden UserModel.getEmail().
user=Bruker
times.days=Dager
providers=Leverand\u00F8rer
