{
  "fromDisplayName": "差出人のアドレスのユーザー・フレンドリーな名前です（オプション）。",
  "replyToDisplayName": "返信先のアドレスのユーザー・フレンドリーな名前です（オプション）。",
  "envelopeFrom": "バウンスに使用されるEメールアドレス（オプション）。",
  "password": "SMTPパスワード。このフィールドは、ボールトから値を取得できます。${vault.ID}形式を使用します。",
  "frontendUrl": "レルムのフロントエンドURLを設定します。デフォルトのホスト名プロバイダーと組み合わせて使用し、特定のレルムのフロントエンド・リクエストのベースURLをオーバーライドします。",
  "requireSsl": "HTTPSが必須かどうか。「なし」は、HTTPSがどのIPアドレスのクライアントにも要求されないことを意味します。「外部リクエスト」は、ローカルホストとプライベートIPアドレスのクライアントがHTTPSなしでアクセスできることを意味します。「すべてのリクエスト」は、HTTPSがすべてのIPアドレスのクライアントに要求されることを意味します。",
  "userManagedAccess": "有効にすると、ユーザーはアカウント管理コンソールを使用してリソースとパーミッションを管理できます。",
  "endpoints": "プロトコル・エンドポイントの設定を表示します。",
  "accountTheme": "ユーザー・アカウント管理画面のテーマを選択します。",
  "adminUITheme": "管理コンソールのテーマを選択します。",
  "emailTheme": "サーバーから送信されるEメールのテーマを選択します。",
  "save-user-events": "有効の場合は、ログインイベントがデータベースに保存され、管理コンソールとアカウント管理で使用することができます。",
  "save-admin-events": "有効の場合は、管理イベントがデータベースに保存され、管理コンソールで使用可能になります。",
  "expiration": "イベントの有効期限を設定します。期限切れのイベントはデータベースから定期的に削除されます。",
  "admin-clearEvents": "データベース内のすべての管理イベントを削除します。",
  "includeRepresentation": "作成または更新リクエストのJSON Representationを含めるかどうかを設定します。",
  "failureFactor": "検出するまでの失敗回数です。",
  "permanentLockout": "最大ログイン失敗回数を超えたときに、ユーザーを永久にロックします。",
  "waitIncrementSeconds": "失敗回数が閾値に達した場合、どれくらいの時間ユーザーはロックアウトされるか設定します。",
  "maxFailureWaitSeconds": "ユーザーがロックアウトされる最大待機時間を設定します。",
  "maxDeltaTimeSeconds": "いつ失敗回数がリセットされるか設定します。",
  "quickLoginCheckMilliSeconds": "クイックログイン失敗があまりにも頻繁に発生した場合は、ユーザーをロックアウトします。",
  "minimumQuickLoginWaitSeconds": "クイックログイン失敗後にどれくらいの時間待機するか設定します。",
  "ssoSessionIdle": "セッションの有効期限が切れるまでのアイドル時間です。セッションの有効期限が切れると、トークンとブラウザー・セッションは無効化されます。",
  "ssoSessionMax": "セッションの有効期限が切れるまでの最大時間です。セッションの有効期限が切れると、トークンとブラウザー・セッションは無効化されます。",
  "ssoSessionIdleRememberMe": "リメンバーミー・セッションの有効期限が切れるまでのアイドル時間です。セッションが期限切れになると、トークンおよびブラウザー・セッションは無効になります。設定されていない場合は、標準のSSOセッション・アイドル値が使用されます。",
  "clientSessionIdle": "クライアント・セッションが期限切れになるまでアイドル状態にできる時間。トークンは、クライアント・セッションが期限切れになると無効になります。設定しない場合、標準のSSOセッション・アイドルの値が使用されます。",
  "offlineSessionIdle": "セッションの有効期限が切れるまでのオフライン時間です。この期限内に少なくとも1回はオフライン・トークンを使用してリフレッシュしないと、オフライン・セッションは有効期限切れとなります。",
  "defaultSigAlg": "このレルムでトークンの署名に使用されるデフォルトのアルゴリズム",
  "revokeRefreshToken": "有効にすると、リフレッシュ・トークンは「リフレッシュ・トークンの最大再利用回数」までしか使用できず、別のトークンが使用されると無効化されます。無効にすると、リフレッシュ・トークンは使用後に無効化されず、複数回使用できます。",
  "refreshTokenMaxReuse": "リフレッシュ・トークンを再利用できる最大回数。別のトークンが使用された場合、即時に無効化されます。",
  "clientLoginTimeout": "クライアントがアクセストークン・プロトコルを終了するまでの最大時間。これは通常1分です。",
  "editUsername": "有効の場合はユーザー名フィールドが編集可能になり、そうでない場合は読み取り専用になります。"
}