{
  "clientType": "'OpenID connect' leidžia klientams tikrinti galutinio naudotojo tapatybę remiantis autorizacijos serverio atlikta autentifikacija. 'SAML' įgalina žiniatinklio, įskaitant skirtingų domenų atvejus, vieningos autentifikacijos ir autorizacijos scenarijus perduodant informaciją saugiose žinutėse.",
  "serviceAccount": "Įgalina klientą autentifikuotis su Keycloak serveriu ir gauti dedikuotą prieigos raktą skirtą šiam klientui. OAuth2 specifikacijos terminais, tai reiškia 'Client Credentials Grant' teisę šiam klientui.",
  "authorization": "Įgalinti detalų kliento autorizacijos palaikymą",
  "directAccess": "Įgalina tiesioginį prieigos suteikimą, kuomet klientas turi prieigą prie naudotojo vardo ir slaptažodžio ir prieigos raktų gavimui šiais duomenimis gali tiesiogiai apsikeisti su Keycloak serveriu. OAuth2 specifikacijos terminais, šiam klientui įgalinimas 'Resource Owner Password Credentials Grant'.",
  "standardFlow": "Įgalina standartinį OpenID Connect nukreipimą, kuomet autentifikacijos metu yra perduodamas autorizacijos kodas. OpenID Connect arba OAuth2 specifikacijos terminais tai reiškia 'Authorization Code Flow' įgalinimą šiam klientui.",
  "implicitFlow": "Įgalina OpenID Connect nukreipimą, kuomet autentifikacijos metu nėra perduodamas autorizacijos kodas. OpenID Connect arba OAuth2 specifikacijos terminais tai reiškia  'Implicit Flow' įgalinimą šiam klientui.",
  "rootURL": "Prie reliatyvių nuorodų pridedamas šakninis URL",
  "validRedirectURIs": "Nukreipimo URI šablonas, kuomet naršyklei leidžiama nukreipti naudotoją po sėkmingos autentifikacijos ar atsijungimo metu. Leidžiami pakaitos simboliai, pvz. 'http://pavyzdys.lt/*'. Leidžiami reliatyvūs keliai pvz. /mano/reliatyvus/kelias/*. Reliatyvumas skaičiuojamas nuo kliento šakninio URL (jei nurodyta) arba nuo autentifikacijos serverio šakninio adreso. SAML atveju, kuomet tikimasi gavėjo paslaugos URL įtraukimo į prisijungimo užklausą, privaloma nurodyti teisingus URI šablonus.",
  "nameIdFormat": "Koks tapatybės identifikatoriaus formatas turi būti naudojamas.",
  "forceNameIdFormat": "Ignoruoti NameID tapatybės identifikatoriaus formatą, naudojant administratoriaus konsolėje nurodytą formatą.",
  "forcePostBinding": "Visuomet naudoti POST sąryšį siunčiant atsakymus.",
  "includeAuthnStatement": "Ar prisijungimo būdas ir laikas šurėtų būti įtraukiami į prisijungimo operacijos atsakymą?",
  "optimizeLookup": "Ar privalo būti itrauktas pasirašymo rakto ID į SAML protokolo žinutės <Extensions> elementą kuomet pasirašomi Keycloak REDIRECT SP sąsajos dokumentai? Tokiu būdu tikrinančioji pusė optimizuoja tikrinimo proceą naudodama tik vieną raktą vietoj to, kad bandytų visų raktų kombinacijas.",
  "signDocuments": "Ar SAML dokumentai turi būtį pasirašomi šios srities?",
  "signAssertions": "Ar SAML sprendiniai SAML dokumentuose turi būti pasirašomi? Šis nustatymas nebūtinas, kuomet naudojamas viso dokumento pasirašymas.",
  "signatureAlgorithm": "Parašo algoritmas naudojamas dokumentų pasirašymui.",
  "canonicalization": "XML parašo metodas.",
  "webOrigins": "Leidžiamos CORS nuorodos. Norėdami leisti nukreipimą į teisingas nuorodas, naudokite '+'. Norėdami leisti visas nuorodas, naudokite '*'.",
  "homeURL": "Numatytas URL, kuris turi būti naudojamas naudotojo nukreipimui atgal į klientą.",
  "adminURL": "Kliento administravimo tinklinės sąsajos URL. Įrašyti tuomet, kai klientas palaiko adapterio REST API. Šis REST API leidžia autentifikacijos serveriui perduoti atšaukimo ir kitas su administravimu susijusias taisykles. Dažniausiai šis URL sutampa su kliento pagrindiniu URL.",
  "client": "Nurodykite klientą, kuris atlieka autorizacijos užklausas. Nei nenurodyta, tuomet autorizacijos užklausa bus vertinama naudojant dabartinį klientą.",
  "clientId": "Identifikatorius, naudojamas URI adresuose ir prieigos raktuose. Pavyzdžiui 'my-client'. SAML protokolo atveju, šią reikšmę tikimasi gauti kaip authn užklausos siuntėją",
  "selectUser": "Nurodykite naudotoją, kurio vardu atliekamas teisių serveryje filtravimas.",
  "roles": "Nurodykite pasirinkto naudotojo roles.",
  "contextualAttributes": "Galite pateikti vykdymo aplinkos arba vykdymo konteksto atributus.",
  "applyToResourceType": "Nurodykite ar šis leidimas turi būti pritaikomas visiems šio tipo resursams. Jei įgalinta, tuomet leidimo tikrinimas bus atliekamas visiems nurodyto tipo resursams.",
  "resources": "Nurodykite, kad šis leidimas turi būti taikomas tik tam tikriems resursams.",
  "scopesSelect": "Nurodo, kad šis leidimas turi būti pritaikytas vienai ar daugiau taikymo sričių.",
  "clientName": "Reikšmė, kuri rodoma naudotojams. Pavyzdžiui 'My Client'. Galimos lokalizuotos reikšmės - pavyzdžiui: ${my_client}",
  "description": "Nurodomas kliento aprašas. Pavyzdžiui 'Mano laiko lentelių klientas'. Palaikomos lokalizuotos reikšmės. Pavyzdžiui: ${my_client_description}",
  "loginTheme": "Pasirinkite kaip atrodys Jūsų prisijungimo, OTP, teisių suteikimo, naudotojų registracijos ir slaptažodžių priminimo langai.",
  "encryptAssertions": "Ar SAML sprendiniai turi būti užkoduojami kliento viešuoju raktu naudojant AES?",
  "clientSignature": "Ar kliento siunčiamos SAML užklausos ir atsakymai bus pasirašyti? Jei taip, tuomet ar juos privaloma tikrinti?",
  "expiration": "Nurodykite kiek laiko galios prieigos raktas ",
  "count": "Nurodykite kiek klientų gali būti sukurti naudojant prieigos raktą",
  "client-authenticator-type": "Kliento autentifikavimo priemonės naudojamos kliento autentifikavimuisi į Keycloak serverį",
  "registration-access-token": "Registracijos prieigos raktas klientams suteikia prieigą prie klientų registracijos paslaugos ",
  "nodeReRegistrationTimeout": "Nurodykite maksimalų laiko intervalą, per kurį mazgai privalo iš naujo prisiregistruoti. Jei mazgas neatsiųs persiregistravimo užklausos per nurodytą laiką, tuomet šis mazgas bus išregistruojamas iš Keycloak ",
  "userInfoSignedResponseAlgorithm": "JWA algoritmas naudojamas pasirašyti naudotojo informacijos prieigos taško atsaką. Jei nustatyta 'unsigned', tuomet naudotojo informacijos atsakas nebus pasirašytas ir bus grąžintas application/json formatu.",
  "requestObjectSignatureAlgorithm": "JWA algoritmas, kurį klientas naudoja siunčiant OIDC užklausos objektą, nusakytą 'request' arba 'request_uri' parameterais. Jei nustatyta 'any', tuomet užklausos objektas gali būti nepasirašytas arba pasirašytas bet kuriuo algoritmu.",
  "idpInitiatedSsoUrlName": "Pavadinimas, kuris IDP inicijuoto SSO prisijungimo metu, perduodamas klientui per URL fragmentą. Palikus tuščią reikšmę IDP inicjuojamą SSO prisijungimo funkcionalumas išjungiamas. Šis fragmentas buv naudojamas formuojant šią nuorodą: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}",
  "idpInitiatedSsoRelayState": "SSO būsenos parametro (RelayState) perdavimas kartu su IDP inicijuota SSO SAML užklausa.",
  "masterSamlProcessingUrl": "Kuomet sukonfigūruotas, šis URL bus naudojamas visoms, 'SP Assertion Consumer' ir 'Single Logout Services' užklausoms. Detalioje SAML prieigos adresų konfigūravimo skyriuje šios reikšmės gali būti atskirai pakeistos.",
  "accessTokenLifespan": "Laikas, po kurio prisijungimui naudojamas raktas (Access Token) nustoja galioti. Rekomenduojama, kad šios reikšmės galiojimas būtų reliatyviai trumpas palyginus su SSO galiojimo laiku.",
  "assertionConsumerServicePostBindingURL": "Kliento sprendinių priėmimo paslaugos (prisijungimo rezultatų) SAML POST jungties URL. Jei tokių jungčių neturite, tuomet palikite tuščias reikšmes.",
  "assertionConsumerServiceRedirectBindingURL": "Kliento sprendinio priėmimo paslaugos SAML nukreipimo jungties URL (prisijungimo atsakymams). Jei tokių jungčių neturite, tuomet palikite tuščias reikšmes.",
  "logoutServiceRedirectBindingURL": "Kliento vieningo atsijungimo paslaugos SAML nukreipimo jungties. Jei naudojate kitas jungtis, tuomet šias reikšmes galite palikti neužpildytas.",
  "frontchannelLogout": "Jei įgalinta, tuomet atsijungimas atliekamas naršyklės nukreipimu į kliento puslapį. Kitu atveju, atsijungimas atliekamas perduodant serveris-serveris užklausą.",
  "browserFlow": "Pasirinkite autentifikacijos naršyklėje seką",
  "directGrant": "Pasirinkite tiesioginių teisių seką (direct grant authentication).",
  "certificate": "Kliento sertifikatas naudojamas kliento išduotų ir privačiu raktu pasirašytų JWT prieigos raktų tikrinimui.",
  "jwksUrl": "URL, kuriuo pasiekiami kliento JWK formatu saugomi raktai. Žiūrėkite JWK specifikaciją detalesnei informacijai. Jei naudojamas kliento adapteris su \"jwt\" kredencialais, tuomet galite naudoti jūsų programos URL su '/k_jwks' sufiksu. Pavyzdžiui 'http://www.myhost.com/myapp/k_jwks' .",
  "archiveFormat": "Java raktų saugykla (keystore) arba PKCS12 formato rinkmena.",
  "keyAlias": "Privataus rakto ir sertifikato rinkmenos pseudonimas.",
  "keyPassword": "Slaptažodžių saugykloje esančio privataus rakto slaptažodis",
  "storePassword": "Slaptažodis, reikalingas norint atidaryti slaptažodžių saugyklą",
  "consentRequired": "Jei įgalinta, tuomet naudotojai privalo patvirtinti, kad pageidauja prisijungti prie kliento (programos).",
  "import": "Importuoti šio resursų serverio autorizacijos nustatymų JSON rinkmeną.",
  "policyEnforcementMode": "Taisyklių vykdymo rėžimas nusako kaip turi būti tenkinamos autorizacijos užklausų taisyklės. 'Taikyti' reiškia, kad tuo atveju kai nėra sukonfigūruota nei viena su resursu susijusi taisyklė, prieiga draudžiama. 'Liberalus' reiškia, kad tuo atveju kai nėra sukonfigūruota nei viena su resursu susijusi taisyklė, prieiga leidžiama. 'Išjungta' reiškia, kad neatliekamas taisyklių tikrinimas ir prieiga leidžiama prie visų resursų.",
  "allowRemoteResourceManagement": "Ar leidžiama nuotoliniu būdu resursų serveriui valdyti resursus? Jei neįgalinta, tuomet resursai gali būti valdomi tik per šią administravimo konsolę.",
  "resourceName": "Unikalus resurso vardas. Vardas turi unikaliai identifikuoti resursą. Naudingas, kuomet ieškoma specifinių resursų.",
  "type": "Šio resurso tipas. Reikšmė leidžia sugrupuoti skirtingus resursus turinčius tą patį tipą.",
  "uris": "URI kuris taip pat gali būti naudojamas vienareikšmiškam resurso identifikavimui.",
  "scopes": "Su šiuo resursu susietos taikymo sritys.",
  "fullScopeAllowed": "Įgalinimo atveju visi apribojimai išjungiami",
  "resetActions": "Nurodykite naudotojui el. paštu siunčiamus privalomus atlikti veiksmus. 'Patvirtinti el. pašto adresą' į naudotojo el. pašto adresą siunčia patvirtinimo nuorodą. 'Atnaujinti profilio informaciją' reikalauja naudotojo peržiūrėti ir atnaujinti profilio informaciją. 'Atnaujinti slaptažodį' reikalauja naudotojo pasikeisti slaptažodį. 'Konfigūruoti OTP' reikalauja atnaujinti mobilaus slaptažodžių generatoriaus konfigūraciją.",
  "scopeName": "Unikalus taikymo srities pavadinimas. Šis pavadinimas gali vienareikšmiškai identifikuoti taikymo sritį. Naudingas kuomet ieškoma šios tam tikros srities. ",
  "policy-name": "Šios taisyklės pavadinimas.",
  "policy-description": "Šios taisyklės aprašymas.",
  "policyDecisionStagey": "Sprendimo strategija nurodo kaip priimamas galutinis sprendimas, kuomet yra vykdomos visos šio leidimo taisyklės. 'Pozityvi' reiškia, kad galutiniam teigiamam sprendimui turi būti tenkinama bent viena taisyklė. 'Vienbalsė' reiškia, kad galutiniam teigiamam sprendimui visos taisyklės turi būti teigiamos. 'Daugumos' reiškia, kad galutinis teigiamas sprendimas bus priimtas tuomet, kai teigiamų taisyklių bus daugiau nei neigiamų. Jei teigiamų ir neigiamų taisyklių skaičius yra vienodas, tuomet galutinis rezultatas bus neigiamas.",
  "applyPolicy": "Nurodo visas taisykles, kurios turi būti įvertintos šios taisyklės ar leidimo taikymo sričiai.",
  "policyGroups": "Nurodo kurie naudotojai tenkina šią taisyklę.",
  "policyRoles": "Nurodo *kliento* rolė(įs) kurios tenkina šią taisyklę.",
  "startTime": "Nurodykite laiką iki kurio ši taisyklė NETENKINAMA. Teigiamas rezultatas duodamas tik tuo atveju, kuomet dabartinė data ir laikas yra vėlesnė arba lygi šiai reikšmei.",
  "expireTime": "Nurodykite laiką po kurio ši taisyklė NETENKINAMA. Teigiamas rezultatas duodamas tik tuo atveju, kuomet dabartinė data ir laikas yra ankstesni arba lygi šiai reikšmei.",
  "month": "Nurodykite mėnesį iki kurio ši taisyklė TENKINAMA. Užpildžius antrąjį laukelį, taisyklė bus TENKINAMA jei mėnesis patenka į nurodytą intervalą. Reikšmės nurodomos imtinai.",
  "dayMonth": "Nurodykite mėnesio dieną iki kurios ši taisyklė TENKINAMA. Užpildžius antrąjį laukelį, taisyklė bus TENKINAMA jei diena patenka į nurodytą intervalą. Reikšmės nurodomos imtinai.",
  "hour": "Nurodykite valandą iki kurios ši taisyklė TENKINAMA. Užpildžius antrąjį laukelį, taisyklė bus TENKINAMA jei valanda patenka į nurodytą intervalą. Reikšmės nurodomos imtinai.",
  "minute": "Nurodykite minutę iki kurios ši taisyklė TENKINAMA. Užpildžius antrąjį laukelį, taisyklė bus TENKINAMA jei minutė patenka į nurodytą intervalą. Reikšmės nurodomos imtinai.",
  "policyCode": "JavaScript kodas kuriame aprašytos šios taisyklės sąlygos.",
  "logic": "Logika nurodo kaip turi būti tenkinama taisyklė. Jei nurodyta 'Teigiama', tuomet šios taisyklės vykdymo metu gautas rezultatas (leisti arba drausti) bus naudojamas sprendinio priėmimui. Jei nurodyta 'Neigiama', tuomet šios taisyklės vykdymo rezultatas bus paneigtas, t.y. leidžiama taps draudžiama ir atvirkščiai.",
  "permissionName": "Šio leidimo pavadinimas.",
  "permissionDescription": "Šio leidimo aprašymas.",
  "permissionType": "Nurodykite, kad ši taisyklė turi būti taikoma visiems šio tipo resursams."
}