{
  "redirectURI": "A url de redirecionamento para usar quando da configuração do provedor de identidade.",
  "alias": "O alias é o identificador único de um provedor de identidade e também é utilizado para construir a uri de redirecionamento.",
  "clientId": "O identificador do cliente registrado com o provedor de identificação.",
  "clientSecret": "A senha do cliente registrado junto ao provedor de identificação.",
  "discoveryEndpoint": "Importar metadata de um descritor de descoberta remoto do IDP.",
  "importConfig": "Importar metadata fr um descritor de descoberta baixado do IDP.",
  "logoutUrl": "'End session endpoint' para utilizar para realizar logour dos usuários do IDP externo.",
  "backchannelLogout": "O IDP externo suporta logou via backchannel?",
  "userInfoUrl": "A Url de informações de usuário. Opcional.",
  "issuer": "O identificador de emissor para o emissor da resposta. Se não for provido nenhuma validação será realizada.",
  "scopes": "Os escopos que serão enviados ao solicitar autorização. Pode ser uma lista de escopos separadas por espaço. Valor padrão é 'openid'.",
  "validateSignature": "Habilita/Desabilita a validação de assinatura de IDP externo.",
  "storeTokens": "Habilita/desabilita se os tokens deve ser guardados depois de autenticar os usuários.",
  "storedTokensReadable": "Habilita/desabilita se novos usuários podem ler quaisquer tokens salvo. Isto irá adicionar o role broker.read-token.",
  "trustEmail": "Se habilitado então o e-mail provido por este provedor não será verificado mesmo que a verificação esteja habilitada para este realm.",
  "firstBrokerLoginFlowAlias": "Alias do fluxo de autenticação que será invocado depois do primeiro login com este provedor de identificação. O termo 'Primeiro Login' significa que ainda não existe uma conta no Keycloak ligada a esta conta autenticada neste provedor.",
  "useEntityDescriptor": "Importar metadata de um descritor de entidade IDP SAML remoto.",
  "samlEntityDescriptor": "Permite que vocÊ carregue metadata de IDP externos de um arquivo de configuração ou baixando a partir de uma URL.",
  "ssoServiceUrl": "A Url que deve ser utilizada para enviar solicitações de autenticação (SAML AuthnRequest).",
  "singleLogoutServiceUrl": "A Url que deve ser utilizada para enviar solicitações de logout.",
  "httpPostBindingAuthnRequest": "Indica se o AuthnRequest deve ser enviado utilizando HTTP-POST. Se falso, HTTP-REDIRECT será utilizado.",
  "wantAuthnRequestsSigned": "Indicate se um provedor de identificação deve experar um AuthnRequest assinado.",
  "signatureAlgorithm": "O algoritmo de assinatura a ser utilizado para assinar documentos.",
  "forceAuthentication": "Indica se um provedor de identificação deve autenticar o apresentador diretamente ao invés de confiar em um contexto de segurança anterior.",
  "validateSignatures": "Habilita/Desabilita validação de assinaturas de respostas SAML.",
  "validatingX509Certs": "O certificado em formato PEM que deve ser usado para verificar assinaturas.",
  "addIdpMapperName": "Nome do mapeamento"
}