{
  "requireSsl": "És HTTP obligatori? ''cap'' significa que HTTPS no és obligatori per cap direcicón IP de client, ''peticions externes'' indica que localhost i les adreces IP privades poden accedir sense HTTPS, ''totes les peticions'' vol dir que HTTPS és obligatori per a totes les adreces IP.",
  "accountTheme": "Selecciona el tema per a les pàgines de gestió del compte d''usuari.",
  "adminUITheme": "Selecciona el tema per a la consola d''administració.",
  "emailTheme": "Selecciona el tema per als correus electrònics que són enviats pel servidor.",
  "failureFactor": "Indica quants errors es permeten abans que es dispari una espera.",
  "waitIncrementSeconds": "Quan s''ha arribat al llindar d''error, quant de temps ha d''estar un usuari bloquejat?",
  "maxFailureWaitSeconds": "Temps màxim que un usuari queda bloquejat.",
  "maxDeltaTimeSeconds": "Quan s''ha de reiniciar el comptador d''errors?",
  "quickLoginCheckMilliSeconds": "Si ocorren errors de forma concurrent i molt ràpida, bloquejar a l''usuari.",
  "minimumQuickLoginWaitSeconds": "Quant de temps s''ha d''esperar després d''un error en un intent ràpid d''identificació",
  "ssoSessionIdle": "Temps màxim que una sessió pot estar inactiva abans que expiri. Els tokens i sessions de navegador són invalidades quan la sessió expira.",
  "ssoSessionMax": "Temps màxim abans que una sessió expiri. Els tokens i sessions de navegador són invalidats quan una sessió expira.",
  "offlineSessionIdle": "Temps màxim inactiu d''una sessió sense connexió abans que expiri. Necessites fer servi un token sense connexió per refrescar almenys una vegada dins d'aquest període, en un altre cas la sessió sense connexió expirarà.",
  "revokeRefreshToken": "Si està activat els tokens d''actualització només poden usar-se una vegada. En un altre cas els tokens d''actualització no es revoquen quan s''utilitzen i poden ser usat múltiples vegades.",
  "clientLoginTimeout": "Temps màxim que un client té per finalitzar el protocol d''obtenció del token d''accés. Hauria de ser normalment de l''ordre d''1 minut.",
  "editUsername": "Si està habilitat, el nom d''usuari és editable, altrament és de només lectura."
}