{
  "redirectURI": "L''URI de redirecció usada per configurar el proveïdor d''identitat.",
  "alias": "L''àlies que identifica de forma única un proveïdor d''identitat, es far servir també per construir la URI de redirecció.",
  "clientId": "L''identificador del client registrat amb el proveïdor d''identitat.",
  "clientSecret": "El secret del client registrat amb el proveïdor d''identitat.",
  "discoveryEndpoint": "Importa metadades des d''un descriptor d''un proveïdor d''identitat (IDP) remot.",
  "importConfig": "Importa metadades des d''un descriptor d''un proveïdor d''identitat (IDP) descarregat.",
  "logoutUrl": "Punt de tancament de sessió per utilitzar en la desconnexió d''usuaris des d''un proveïdor d''identitat (IDP) extern.",
  "backchannelLogout": "Does the external IDP support backchannel logout?",
  "userInfoUrl": "L''URL d''informació d''usuari. Opcional.",
  "issuer": "L''identificador de l''emissor per a l''emissor de la resposta. Si no s''indica, no es realitzarà cap validació.",
  "scopes": "Els àmbits que s''enviaran quan es sol·liciti autorització. Pot ser una llista d''àmbits separats per espais. El valor per defecte és ''openid''.",
  "validateSignature": "Habilitar/deshabilitar la validació de signatures de proveïdors d''identitat (IDP) externs",
  "storeTokens": "Habilitar/deshabilitar si els tokens han de ser emmagatzemats després d''autenticar als usuaris.",
  "storedTokensReadable": "Habilitar/deshabilitar si els nous usuaris poden llegir els tokens emmagatzemats. Això assigna el rol ''broker.read-token''.",
  "trustEmail": "Si està habilitat, l''email rebut d''aquest proveïdor no es verificarà encara que la verificació estigui habilitada per al domini.",
  "useEntityDescriptor": "Importar metadades des d''un descriptor d'entitat remot d''un IDP de SAML",
  "samlEntityDescriptor": "Et permet carregar metadades d''un proveïdor d''identitat (IDP) extern d''un arxiu de coniguración o descarregar des d''una URL.",
  "ssoServiceUrl": "L''URL que s''ha de fer servir per enviar peticions d''autenticació (SAML AuthnRequest).",
  "singleLogoutServiceUrl": "L''URL que ha de fer-se servir per enviar peticions de desconnexió.",
  "httpPostBindingAuthnRequest": "Indica si AuthnRequest ha de ser enviat usant HTTP-POST. Si no està activat es fa HTTP-REDIRECT.",
  "wantAuthnRequestsSigned": "Indica si el proveïdor d''identitat espera rebre signades les AuthnRequest.",
  "signatureAlgorithm": "L''algorisme de signatura usat per signar els documents.",
  "forceAuthentication": "Indica si el proveïdor d''identitat ha d'autenticar en presentar directament les credencials en lloc de dependre d''un context de seguretat previ.",
  "validateSignatures": "Habilitar/deshabilitar la validació de signatura en respostes SAML.",
  "validatingX509Certs": "El certificat en format PEM que ha de fer-se servir per comprovar les signatures.",
  "addIdpMapperName": "Nom de l''assignador."
}