{
  "requireSsl": "É necessário SSL? 'Nunca' significa que HTTPS não é requerido para nenhum endereço IP cliente. 'Requisições externas' significa que localhost e IPs privados podem acessar sem HTTPS. 'Todas requisições' significa que HTTPS é requerido para todos os endereços IPs.",
  "accountTheme": "Selecione o tema para as páginas de administração de conta do usuário.",
  "adminUITheme": "Selecione o tema para o UI de administração.",
  "emailTheme": "Selecione o tema para os e-mail que são enviados pelo servidor.",
  "save-user-events": "If enabled login events are saved to the database which makes events available to the Admin and Account management UIs.",
  "save-admin-events": "If enabled admin events are saved to the database which makes events available to the Admin UI.",
  "expiration": "Sets the expiration for events. Expired events are periodically deleted from the database.",
  "admin-clearEvents": "Deletes all admin events in the database.",
  "includeRepresentation": "Include JSON representation for create and update requests.",
  "failureFactor": "Quantas falhas de login antes que a espera seja habilitada.",
  "waitIncrementSeconds": "Quando a quantidade de falhas for alcançada, quanto tempo o usuário deve aguardar antes de tentar novamente?",
  "maxFailureWaitSeconds": "Tempo máximo que um usuário deverá aguardar após uma falha de quick login.",
  "maxDeltaTimeSeconds": "Quando o contador de falhas será resetado?",
  "quickLoginCheckMilliSeconds": "Se uma falha ocorre concorrentemente neste período, travar a conta do usuário.",
  "minimumQuickLoginWaitSeconds": "Quanto tempo aguardar após uma falha de quick login.",
  "ssoSessionIdle": "Tempo que uma sessão pode ficar inativa antes de expirar. Tokens e sessões de navegador são invalidados quando uma sessão é expirada.",
  "ssoSessionMax": "Tempo máximo antes que uma sessão seja expirada. Tokens e sessões de navegador são invalidados quando uma sessão é expirada.",
  "offlineSessionIdle": "Tempo que uma sessão offline pode ficar inativa antes de expirar. Você precisa utilizar um token de atualização offline pelo menos uma vez neste período, caso contrário a sessão offline será expirada.",
  "revokeRefreshToken": "Se habilitado os tokens de atualização podem ser utilizados somente uma vez. Caso contrário os tokens de atualização não são revogados quando utilizados e podem ser utilizados várias vezes.",
  "clientLoginTimeout": "Tempo máximo que um cliente tem para finalizar o procolo do token de acesso. Normalmente deve ser 1 minuto.",
  "editUsername": "Se habilitado, o campo nome de usuário é editável, senão será apenas leitura."
}