{
  "clientType": "'OpenID connect' tillater klienter å verifisere identiteten til sluttbrukeren basert på autentisering utført av en autorisasjonsserver. 'SAML' aktiverer en web-basert autentisering og autoriseringsscenarier som inkluderer cross-domain single sign-on (SSO) og som bruker security tokens som inneholder assertions for å dele informasjon videre.",
  "serviceAccount": "Lar deg autentisere denne klienten til Keycloak og hente access token dedikert til denne klienten. I følge OAuth2 spesifikasjonen, aktiverer dette støtte for 'Client Credentials Grant' for denne klienten.",
  "authorization": "Aktiver/deaktiver finkornet autorisasjonssupport for en klient",
  "directAccess": "Dette gir støtte for Direct Access Grants, som betyr at klienten har tilgang til brukerens brukernavn/passord og kan bytte dette direkte med Keycloak-serveren for access token. I følge OAuth2 spesifikasjonen, aktiverer dette støtte for 'Resource Owner Password Credentials Grant' for denne klienten.",
  "standardFlow": "Dette aktiverer standard OpenID Connect redirect-basert autentisering med autorisasjonskode. I forhold til OpenID Connect eller OAuth2 spesifikasjoner aktiverer dette støtte for 'Authorization Code Flow' for denne klienten.",
  "implicitFlow": "Dette aktiverer støtte for OpenID Connect redirect-basert autentisering uten autorisasjonskode. I forhold til OpenID Connect eller OAuth2 spesifikasjoner aktiverer dette støtte for 'Implicit Flow' for denne klienten.",
  "rootURL": "Root URL lagt til relative URLer",
  "validRedirectURIs": "Gyldig URI mønster som en nettleser kan redirecte til etter en vellykket innlogging eller utlogging. Enkle jokertegn er tillatt, for eksempel 'http://example.com/*'. Relativ sti kan også spesifiseres, for eksempel /my/relative/path/*. Relative stier er relative til klientens root URL, eller hvis ingen er spesifisert brukes root URL for autorisasjonsserveren. For SAML må du sette et gyldig URI mønster hvis du er avhengig av at URL for forbrukertjenesten er integrert med forespørselen for pålogging.",
  "nameIdFormat": "Navn-ID formatet som skal brukes for emnet.",
  "forceNameIdFormat": "Ignorer forespurt format på Navn-ID emnet og bruk den som er konfigurert i administrasjonskonsollen.",
  "forcePostBinding": "Bruk alltid POST binding for svar.",
  "includeAuthnStatement": "Skal et statement som spesifiserer metoden for tidsstempel inngå i innloggingssvaret?",
  "signDocuments": "Skal SAML dokumenter bli signert av sikkerhetsdomenet?",
  "signAssertions": "Skal assertions i SAML dokumenter bli signert? Denne innstillingen er ikke nødvendig hvis et dokument allerede har blitt signert.",
  "signatureAlgorithm": "Signaturalgoritmen som brukes for å signere et dokument.",
  "canonicalization": "Kanoniseringsmetode for XML signaturer.",
  "webOrigins": "Tillat CORS origins. For å tillate alle origins med gyldig Redirect URIer legg til '+'. For å tillate alle origins legg til '*'.",
  "homeURL": "Standard URL som kan brukes når autorisasjonsserveren trenger å redirecte eller lenke tilbake til klienten.",
  "adminURL": "URL til administratorgrensesnitt for klienten. Sett denne hvis klienten støtter adapter REST API. Dette REST APIet tillater autorisasjonsserveren til å sende tilbakekallingsregler og andre administrative oppgaver. Vanligvis er dette satt til klientens base URL.",
  "client": "Velg klienten som vil utføre denne autorisasjonsforespørselen.",
  "clientId": "Angir ID referert i URI og tokens. For eksempel 'min-klient'. For SAML er dette også forventet utgiververdi fra authn-forespørsler",
  "selectUser": "Velg en bruker hvis identitet vil bli brukt for å søke tillatelser fra serveren.",
  "roles": "Velg en rolle som du vil knytte til den valgte brukeren.",
  "contextualAttributes": "Ethvert attributt gitt av et kjørende miljø eller ved utførelseskontekst.",
  "applyToResourceType": "Spesifiserer om denne tillatelsen skal gjelde for alle ressurser med en gitt type. I dette tilfellet vil tillatelsen bli evaluert for alle instanser av gitt ressurstype.",
  "resources": "Spesifiserer at denne tillatelsen må bli brukt for en spesifikk ressursinstans.",
  "scopesSelect": "Spesifiserer at denne tillatelse må anvendes på en eller flere scopes.",
  "clientName": "Angir klientnavnet som blir vist. For eksempel, 'Min klient'. Støtter nøkler for lokaliserte verdier. For eksempel: ${my_client}",
  "description": "Angir beskrivelse av klienten. For eksempel: 'Min klient for timelister'. Støtter nøkler for lokaliserte verdier. For eksempel: ${my_client_description}",
  "loginTheme": "Velg tema for sidene: innlogging, OTP, rettigheter, registrering, glemt passord.",
  "encryptAssertions": "Skal SAML assertions bli kryptert med klientens offentlige nøkkel ved å bruke AES?",
  "clientSignature": "Skal klienten signere sine SAML forespørsler og svar? Og skal de valideres?",
  "expiration": "Angir hvor lenge et token skal være gyldig",
  "count": "Angir hvor mange klienter som kan bli opprettet ved å bruke token.",
  "client-authenticator-type": "Klientautentikator som blir brukt for å autentisere denne klienten mot keycloak-server",
  "registration-access-token": "Access token for registrering gir klienter tilgang til registreringstjenesten for klienter.",
  "nodeReRegistrationTimeout": "Intervall for å angi maksimum tid for registrerte klienters clusternoder for å re-registreres. Hvis en clusternode ikke sender re-regisreringsforespørsel til Keycloak innen dette intervallet, vil den bli uregistrert fra Keycloak.",
  "idpInitiatedSsoUrlName": "Navn på URL-fragment som refererer til klienten når du vil gjøre en IDP initiert SSO. La denne stå tom om du ønsker å deaktivere IDP initiert SSO. URLen vil være: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}",
  "idpInitiatedSsoRelayState": "Relay state du ønsker å sende med SAML forespørselen når du vil utføre en IDP initiert SSO.",
  "masterSamlProcessingUrl": "Hvis konfigurert vil denne URLen bli brukt for hver binding til både SPs Assertion Consumer og Single Logout-tjenester. Denne kan bli individuelt overstyrt for hver binding og tjenester i konfigurasjonen for finkornet SAML endepunkt.",
  "accessTokenLifespan": "Maksimum tid før et access token utløper. Det anbefales at denne verdien er kort i forhold til SSO timeout.",
  "assertionConsumerServicePostBindingURL": "SAML POST binding URL for klientens assertion customer service (innloggingsrespons). Du kan la denne stå tom om du ikke ønsker en URL for denne bindingen.",
  "assertionConsumerServiceRedirectBindingURL": "SAML redirect for klientens assertion consumer service (innloggingsrespons). Du kan la denne stå tom om du ikke ønsker en URL for denne bindingen.",
  "logoutServiceRedirectBindingURL": "SAML redirect binding URL for klientens single logout-tjeneste. Du kan la dette stå tomt om du bruker en annen binding.",
  "frontchannelLogout": "Hvis satt til true, krever utlogging en redirect i nettleser til klient. Hvis satt til false, vil server utføre en bakgrunnskall for utlogging.",
  "browserFlow": "Velg flyten du ønsker å bruke for nettleser-autentisering.",
  "directGrant": "Velg flyten du ønsker å bruke for direct grant autentisering.",
  "certificate": "Klientsertifikat for å validere JWT utstedt av klienten og signert av privatnøkkel til klient fra din keystore.",
  "archiveFormat": "Java keystore eller PKCS12 arkivformat.",
  "keyAlias": "Arkiv-alias for din privatnøkkel og sertifikater.",
  "keyPassword": "Passord for å få tilgang til privatnøkler i arkivet",
  "storePassword": "Passord for å få tilgang til arkivet",
  "consentRequired": "Hvis aktivert må brukere gi samtykke for at klienten skal få tilgang.",
  "import": "Importer en JSON-fil som inneholder innstillinger for autorisasjon for denne ressursserveren.",
  "policyEnforcementMode": "Modus for håndhevelse av policy dikterer hvordan policier blir håndhevet når autorisasjonsforespørsler blir evaluert. 'Håndhevende' betyr at forespørsler blir nektet som standard selv om det ikke er en policy knyttet til en gitt ressurs. 'Ettergivende' betyr at forespørsler blir tillatt selv om det ikke er en policy knyttet til en gitt ressurs. 'Deaktivert' deaktiverer fullstendig evalueringen av policier og tillater tilgang til enhver ressurs.",
  "allowRemoteResourceManagement": "Skal ressursene bli håndtert eksternt av ressursserveren? Hvis satt til false kan ressursene kun bli håndtert fra denne administratorkonsollen.",
  "resourceName": "Et unikt navn for denne ressursen. Navnet kan bli brukt til å identifisere en ressurs og er nyttig i spørringer for en bestemt ressurs.",
  "type": "Ressurstype. Den kan brukes til å gruppere ulike ressursinstanser av samme type.",
  "uris": "En URI som også kan brukes for å identifisere denne ressursen.",
  "scopes": "Scopes assosiert med denne ressursen.",
  "fullScopeAllowed": "Lar deg å deaktivere alle restriksjoner.",
  "resetActions": "Sett med handlinger som kan utføres ved å sende en bruker en Tilbakestillingshandling for E-post. 'Verifiser e-post' sender en e-post til brukeren for å verifisere e-postadresse. 'Oppdater profil' krever at bruker legger inn personlig informasjon. 'Oppdater passord' krever at bruker skriver inn et nytt passord. 'Konfigurer OTP' krever installasjon av en passordgenerator for mobil.",
  "scopeName": "Et unikt navn for dette scopet. Navnet kan bli brukt for å identifisere et scope, og er nyttig i spørringer for en bestemt ressurs.",
  "policy-name": "Navnet på denne policien.",
  "policy-description": "En beskrivelse av denne policien.",
  "policyDecisionStagey": "Beslutningsstrategi som dikterer hvordan policies knyttet til en gitt policy blir evaluert og hvordan endelig avgjørelse oppnås. 'Bekreftende' betyr at minst en policy må evalueres til en positiv beslutning for at den samlede avgjørelsen kan bli positiv. 'Enstemmig' betyr at alle policies må evalueres til en positiv beslutning for at den samlede avgjørelsen kan bli positiv. 'Konsensus' betyr at antall positive beslutninger må være høyere enn antall negative beslutninger. Hvis antallet av positive og negative er likt, blir den samlede avgjørelsen negativ.",
  "applyPolicy": "Spesifiserer alle policies som må bli anvendt for scopes definert av denne policien eller tillatelsen.",
  "policyClient": "Spesifiser klient(er) som tillates av denne policien.",
  "policyGroups": "Spesifiser bruker(e) som tillates av denne policien.",
  "policyRoles": "Spesifiserer klientroller tillatt av denne policien.",
  "startTime": "Definerer tiden før policien MÅ IKKE innvilges. Denne innvilges kun om gjeldende dato/tid er før eller lik denne verdien.",
  "expireTime": "Definerer tiden etter en policy MÅ IKKE innvilges. Denne innvilges kun om gjeldende dato/tid er før eller lik denne verdien.",
  "policyCode": "JavaScript-koden angir betingelsene for denne politikken.",
  "logic": "Logikken som dikterer hvordan beslutningspolicien skal utførres. Hvis 'Positiv', vil resulterende effekt (tillate eller nekte) oppnådd under evalueringen av denne policien bli brukt for å ta en beslutning. Hvis 'Negativ', vil resulterende effekt bli opphevet, med andre ord blir en tillatelse til et avslag og motsatt.",
  "permissionName": "Navnet på denne tillatelsen.",
  "permissionDescription": "En beskrivelse av denne tillatelsen.",
  "permissionType": "Spesifiserer at denne tillatelsen må bli anvendt for alle ressursinstanser for en gitt type."
}