{
  "requireSsl": "Kreves HTTPS? 'Ingen' betyr at HTTPS ikke kreves for noen klienters IP-adresse. 'Ekstern forespørsel' betyr at localhost og private IP-adresser kan få tilgang uten HTTPS. 'Alle forespørsler' betyr at HTTPS kreves for alle IP-adresser.",
  "accountTheme": "Velg tema for brukerkontoadministrasjonssider.",
  "adminUITheme": "Velg et tema for administrasjonskonsollen.",
  "emailTheme": "Velg tema for e-post sendt av server.",
  "save-user-events": "Hvis aktivert vil innloggingshendelser bli lagret i databasen, noe som gjør hendelsene tilgjengelige for administrator og kontoadministrasjonskonsoll.",
  "save-admin-events": "Hvis aktivert vil administratorhendelser bli lagret i databasen, som vil gjøre hendelsene tilgjengelige i administrasjonskonsollen.",
  "expiration": "Setter utløpstid for hendelser. Utløpte hendelser vil med jevne mellomrom bli slettet fra databasen.",
  "admin-clearEvents": "Sletter alle administratorhendelser i databasen.",
  "includeRepresentation": "Inkluder JSON-representasjon for å skape og oppdatere forespørsler.",
  "failureFactor": "Hvor mange feil før ventetid blir aktivert.",
  "waitIncrementSeconds": "Når terskelen for feil er nådd, hvor lenge skal brukeren stenges ute?",
  "maxFailureWaitSeconds": "Maksimum tid en bruker vil være stengt ute.",
  "maxDeltaTimeSeconds": "Når vil teller for feil nullstilles?",
  "quickLoginCheckMilliSeconds": "Hvis en feil skjer for raskt samtidig, steng brukeren ute.",
  "minimumQuickLoginWaitSeconds": "Ventetid etter en hurtig innloggingsfeil.",
  "ssoSessionIdle": "Tiden en sesjon er tillatt å være inaktiv før den utløper. Tokens og nettlesersesjoner vil bli ugyldig når en sesjon utløper.",
  "ssoSessionMax": "Maksimum tid før en sesjon utløper. Tokens og nettlesersesjoner vil bli ugyldig når en sesjon utløper.",
  "offlineSessionIdle": "Tiden en sesjon i frakoblet modus er tillatt å være inaktiv før den utløper. Du må bruke tokens for frakoblet modus for å oppdatere sesjonen minst en gang i denne perioden, ellers vil sesjonen utløpe.",
  "revokeRefreshToken": "Hvis aktivert kan refresh token kun bli brukt en gang. Ellers vil refresh tokens kunne bli brukt flere ganger.",
  "clientLoginTimeout": "Maksimum tid en klient har for å fullføre access token protokollen. Dette burde normalt være 1 minutt.",
  "editUsername": "Dersom aktivert, er feltet for brukernavn redigerbart, ellers kun lesbart."
}