{
  "clientType": "''OpenID connect'' permet als clients verificar la identitat de l''usuari final basat en l''autenticació realitzada per un servidor d''autorització. ''SAML'' habilita l''autenticació i autorització d''escenaris basats en web incloent cross-domain i single sign-on (SSO) i utilitza tokens de seguretat que contenen afirmacions per passar informació.",
  "serviceAccount": "Permetre autenticar aquest client contra Keycloak i rebre un token d''accés dedicat per a aquest client.",
  "rootURL": "URL arrel afegida a les URL relatives",
  "validRedirectURIs": "Patró d''URI vàlida per a la qual un navegador pot sol·licitar la redirecció després d''un inici o tancament de sessió completat. Es permeten comodins simples p.ex. ''http://example.com/*''. També es poden indicar rutes relatives p.ex. ''/my/relative/path/*''. Les rutes relatives generaran un URI de redirecció fent servir el host i port de la petició. Per SAML, s''han de fixar patrons d''URI vàlids si vols confiar en l''URL del servei del consumidor indicada en la petició d''inici de sessió.",
  "nameIdFormat": "El format de NameID que es farà servir per al títol",
  "forceNameIdFormat": "Ignorar la petició de subjecte NameID i fer servir la configurada a la consola d''administració.",
  "forcePostBinding": "Fer servir sempre POST per a les respostes",
  "includeAuthnStatement": "Hauria d''incloure''s una declaració especificant el mètode i la marca de temps en la resposta d''inici de sessió?",
  "signDocuments": "Hauria el domini de signar els documents SAML?",
  "signAssertions": "Haurien de signar-se les assercions en documents SAML? Aquest ajust no és necessari si el document ja s''està signant.",
  "signatureAlgorithm": "L''algorisme de signatura usat per signar els documents.",
  "canonicalization": "Mètode de canonicalització per a les signatures XML",
  "webOrigins": "Orígens CORS permesos. Per permetre tots els orígens d''URIs de redirecció vàlides afegeix ''+''. Per permetre tots els orígens afegeix ''*''.",
  "homeURL": "URL per defecte per utilitzar quan el servidor d''autorització necessita redirigir o enviar de tornada al client.",
  "adminURL": "URL a la interfície d''administració del client. Fixa aquest valor si el client suporta l''adaptador de REST. Aquesta API REST permet al servidor d''autenticació enviar al client polítiques de revocació i altres tasques administratives. Normalment es fixa a l''URL base del client.",
  "clientId": "Indica l''identificador (ID) referenciat en URIs i tokens. Per exemple ''my-client''",
  "clientName": "Indica el nom visible del client. Per exemple ''My Client''. També suporta claus per valors localitzats. Per exemple: ${my_client}",
  "description": "Indica la descripció del client. Per exemple ''My Client for TimeSheets''. També suporta claus per a valors localitzats. Per exemple: ${my_client_description}",
  "loginTheme": "Selecciona el tema per a les pàgines d''inici de sessió, OTP, permisos, registre i recordatori de contrasenya.",
  "encryptAssertions": "Haurien de xifrar-se les afirmacions SAML amb la clau pública del client fent servir AES?",
  "clientSignature": "Signarà el client les seves peticions i respostes SAML? I haurien de ser validades?",
  "client-authenticator-type": "Client autenticador usat per autenticar aquest client contra el servidor Keycloak",
  "nodeReRegistrationTimeout": "Indica el màxim interval de temps perquè els nodes del clúster registrats es tornin a registrar. Si el node del clúster no envia una petició de re-registre a Keycloak dins d''aquest interval, serà desregistrat de Keycloak",
  "idpInitiatedSsoUrlName": "Nom del fragment de l''URL per referenciar al client quan vols un SSO iniciat per l''IDP. Deixant això buit desactiva els SSO iniciats per l''IDP. L''URL referenciada des del navegador serà: {server-root}/realms/{realm}/protocol/saml/clients/{client-url-name}",
  "idpInitiatedSsoRelayState": "Estat de retransmissió que vols enviar amb una petició SAML quan s''inicia un SSO iniciat per l''IDP",
  "masterSamlProcessingUrl": "Si està configurada, aquesta URL es fara servir per a cada enllaç al proveïdor del servei del consumidor d''assercions i serveis de desconnexió únics. Pot ser sobreescrit de forma individual per a cada enllaç i servei en el punt final de configuració fina de SAML.",
  "accessTokenLifespan": "Temps màxim abans que un token d''accés expiri. Es recomana que aquest valor sigui curt en relació al temps màxim de SSO",
  "assertionConsumerServicePostBindingURL": "SAML POST Binding URL for the client''s assertion consumer service (login responses).  You can leave this blank if you do not have a URL for this binding.",
  "assertionConsumerServiceRedirectBindingURL": "Assertion Consumer Service Redirect Binding URL",
  "logoutServicePostBindingURL": "URL d''enllaç SAML POST per a la desconnexió única del client. Pots deixar-ho en blanc si estàs fent servir un enllaç diferent.",
  "logoutServiceRedirectBindingURL": "URL d''enllaç SAML de redirecció per a la desconnexió única del client. Pots deixar-ho en blanc si estàs fent servir un enllaç diferent.",
  "frontchannelLogout": "Quan està activat, la desconnexió requereix una redirecció del navegador cap al client. Quan no està activat, el servidor realitza una invovación de desconnexió en segon pla.",
  "certificate": "Certificat de client per validar els JWT emesos per aquest client i signats amb la clau privada del client del teu magatzem de claus.",
  "archiveFormat": "Format d''arxiu Java keystore o PKCS12",
  "keyAlias": "Àlies de l''arxiu de la teva clau privada i certificat.",
  "keyPassword": "Contrasenya per accedir a la clau privada continguda en l''arxiu",
  "storePassword": "Contrasenya per accedir a l''arxiu",
  "consentRequired": "Si està habilitat, els usuaris han de consentir l''accés del client.",
  "fullScopeAllowed": "Permet deshabilitar totes les restriccions."
}