{
  "redirectURI": "La URI de redirección usada para configurar el proveedor de identidad.",
  "alias": "El alias que identifica de forma única un proveedor de identidad, se usa también para construir la URI de redirección.",
  "clientId": "El identificador del cliente registrado con el proveedor de identidad.",
  "clientSecret": "El secreto del cliente registrado con el proveedor de identidad.",
  "discoveryEndpoint": "Importar metadatos desde un descriptor de un proveedor de identidad (IDP) remoto.",
  "importConfig": "Importar metadatos desde un descriptor de un proveedor de identidad (IDP) descargado.",
  "logoutUrl": "Punto de cierre de sesión para usar en la desconexión de usuarios desde un proveedor de identidad (IDP) externo.",
  "backchannelLogout": "Does the external IDP support backchannel logout?",
  "userInfoUrl": "La URL de información de usuario. Opcional.",
  "issuer": "El identificador del emisor para el emisor de la respuesta. Si no se indica, no se realizará ninguna validación.",
  "scopes": "Los ámbitos que se enviarán cuando se solicite autorización. Puede ser una lista de ámbitos separados por espacios. El valor por defecto es ''openid''.",
  "validateSignature": "Habilitar/deshabilitar la validación de firmas de proveedores de identidad (IDP) externos",
  "storeTokens": "Habilitar/deshabilitar si los tokens deben ser almacenados después de autenticar a los usuarios.",
  "storedTokensReadable": "Habilitar/deshabilitar si los nuevos usuarios pueden leer los tokens almacenados. Esto asigna el rol ''broker.read-token''.",
  "trustEmail": "Si está habilitado, el email recibido de este proveedor no se verificará aunque la verificación esté habilitada para el dominio.",
  "useEntityDescriptor": "Importar metadatos desde un descriptor de entidad remoto de un IDP de SAML",
  "samlEntityDescriptor": "Te permite cargar metadatos de un proveedor de identidad (IDP) externo de un archivo de coniguración o descargarlo desde una URL.",
  "ssoServiceUrl": "La URL que debe ser usada para enviar peticiones de autenticación (SAML AuthnRequest).",
  "singleLogoutServiceUrl": "La URL que debe usarse para enviar peticiones de desconexión.",
  "httpPostBindingAuthnRequest": "Indica si AuthnRequest debe ser enviada usando HTTP-POST. Si no está activado se hace HTTP-REDIRECT.",
  "wantAuthnRequestsSigned": "Indica si el proveedor de identidad espera recibir firmadas las AuthnRequest.",
  "signatureAlgorithm": "El algoritmo de firma usado para firmar los documentos.",
  "forceAuthentication": "Indica si el proveedor de identidad debe autenticar al presentar directamente las credenciales en lugar de depender de un contexto de seguridad previo.",
  "validateSignatures": "Habilitar/deshabilitar la validación de firma en respuestas SAML.",
  "validatingX509Certs": "El certificado en formato PEM que debe usarse para comprobar las firmas.",
  "addIdpMapperName": "Nombre del asignador."
}